using System;

namespace System.Net
{
	/// <summary>Заголовки HTTP, которые могут быть указаны в клиентском запросе.</summary>
	// Token: 0x020005D2 RID: 1490
	public enum HttpRequestHeader
	{
		/// <summary>Заголовок Cache-Control, указывающий директивы, которые должны соблюдаться всеми механизмами управления кэшем по всей цепочке запросов и ответов.</summary>
		// Token: 0x04001AB1 RID: 6833
		CacheControl,
		/// <summary>Заголовок Connection, указывающий параметры, необходимые для конкретного подключения.</summary>
		// Token: 0x04001AB2 RID: 6834
		Connection,
		/// <summary>Заголовок Date, указывающий дату и время возникновения запроса.</summary>
		// Token: 0x04001AB3 RID: 6835
		Date,
		/// <summary>Заголовок Keep-Alive, указывающий параметр, используемый для поддержки постоянного подключения.</summary>
		// Token: 0x04001AB4 RID: 6836
		KeepAlive,
		/// <summary>Заголовок Pragma, указывающий директивы реализации, которые могут применяться к любому агенту про всей цепочке запросов и ответов.</summary>
		// Token: 0x04001AB5 RID: 6837
		Pragma,
		/// <summary>Заголовок Trailer, указывающий поля заголовка, которые присутствуют в индексе завершения сообщения, зашифрованного с помощью поблочного кодирования.</summary>
		// Token: 0x04001AB6 RID: 6838
		Trailer,
		/// <summary>Заголовок Transfer-Encoding, указывающий тип преобразования (при его наличии), которое было применено к основному тексту сообщения.</summary>
		// Token: 0x04001AB7 RID: 6839
		TransferEncoding,
		/// <summary>Заголовок Upgrade, указывающий дополнительные протоколы связи, поддерживаемые клиентом.</summary>
		// Token: 0x04001AB8 RID: 6840
		Upgrade,
		/// <summary>Заголовок Via, указывающий промежуточные протоколы для использования шлюзом и прокси-агентами.</summary>
		// Token: 0x04001AB9 RID: 6841
		Via,
		/// <summary>Заголовок Warning, указывающий дополнительные сведения о состоянии или преобразовании сообщения, которые не могут быть отражены в сообщении.</summary>
		// Token: 0x04001ABA RID: 6842
		Warning,
		/// <summary>Заголовок Allow, указывающий набор поддерживаемых методов HTTP.</summary>
		// Token: 0x04001ABB RID: 6843
		Allow,
		/// <summary>Заголовок Content-Length, указывающий длину (в байтах) сопроводительных данных основного текста.</summary>
		// Token: 0x04001ABC RID: 6844
		ContentLength,
		/// <summary>Заголовок Content-Type, указывающий тип MIME сопроводительных данных основного текста.</summary>
		// Token: 0x04001ABD RID: 6845
		ContentType,
		/// <summary>Заголовок Content-Encoding, указывающий кодировки, которые были применены к сопроводительным данным основного текста.</summary>
		// Token: 0x04001ABE RID: 6846
		ContentEncoding,
		/// <summary>Заголовок Content-Langauge , указывающий собственный язык (или языки) сопроводительных данных основного текста.</summary>
		// Token: 0x04001ABF RID: 6847
		ContentLanguage,
		/// <summary>Заголовок Content-Location, указывающий URI, из которого можно получить эти сопроводительные данные основного текста.</summary>
		// Token: 0x04001AC0 RID: 6848
		ContentLocation,
		/// <summary>Заголовок Content-MD5, указывающий дайджест MD5 сопроводительных данных основного текста с целью предоставления сквозной проверки целостности сообщения.</summary>
		// Token: 0x04001AC1 RID: 6849
		ContentMd5,
		/// <summary>Заголовок Content-Range, указывающий, в каком месте полного основного текста должна применяться сопроводительная часть данных основного текста.</summary>
		// Token: 0x04001AC2 RID: 6850
		ContentRange,
		/// <summary>Заголовок Expires, указывающий дату и время, после которого сопроводительные данные основного текста должны считаться устаревшими.</summary>
		// Token: 0x04001AC3 RID: 6851
		Expires,
		/// <summary>Заголовок Last-Modified, указывающий дату и время последнего изменения сопроводительных данных основного текста.</summary>
		// Token: 0x04001AC4 RID: 6852
		LastModified,
		/// <summary>Заголовок Accept, указывающий типы MIME, допустимые для ответа.</summary>
		// Token: 0x04001AC5 RID: 6853
		Accept,
		/// <summary>Заголовок Accept-Charset, указывающий наборы символов, допустимые для ответа.</summary>
		// Token: 0x04001AC6 RID: 6854
		AcceptCharset,
		/// <summary>Заголовок Accept-Encoding, указывающий кодировки содержимого, допустимые для ответа.</summary>
		// Token: 0x04001AC7 RID: 6855
		AcceptEncoding,
		/// <summary>Заголовок Accept-Language, указывающий естественные языки, предпочтительные для ответа.</summary>
		// Token: 0x04001AC8 RID: 6856
		AcceptLanguage,
		/// <summary>Заголовок Authorization, указывающий учетные данные, которые предоставляются клиентом для прохождения проверки подлинности на сервере.</summary>
		// Token: 0x04001AC9 RID: 6857
		Authorization,
		/// <summary>Заголовок Cookie, указывающий данные файла cookie, представленные на сервер.</summary>
		// Token: 0x04001ACA RID: 6858
		Cookie,
		/// <summary>Заголовок Expect, указывающий определенное поведение сервера, требуемое клиентом.</summary>
		// Token: 0x04001ACB RID: 6859
		Expect,
		/// <summary>Заголовок From, указывающий адрес электронной почты в Интернете для пользователя, управляющего запрашивающим агентом пользователя.</summary>
		// Token: 0x04001ACC RID: 6860
		From,
		/// <summary>Заголовок Host, указывающий имя узла и номер порта запрашиваемого ресурса.</summary>
		// Token: 0x04001ACD RID: 6861
		Host,
		/// <summary>Заголовок If-Match, указывающий, что затребованная операция должна выполняться только в том случае, если копия указанного ресурса в кэше клиента является текущей.</summary>
		// Token: 0x04001ACE RID: 6862
		IfMatch,
		/// <summary>Заголовок If-Modified-Since, указывающий, что затребованная операция должна выполняться только в том случае, если запрошенный ресурс был изменен после указанной даты и времени.</summary>
		// Token: 0x04001ACF RID: 6863
		IfModifiedSince,
		/// <summary>Заголовок If-None-Match, указывающий, что затребованная операция должна выполняться только в том случае, если ни одна из копий указанных ресурсов в кэше клиента не является текущей.</summary>
		// Token: 0x04001AD0 RID: 6864
		IfNoneMatch,
		/// <summary>Заголовок If-Range, указывающий, что если копия в кэше клиента является текущей, то отправляться должен только указанный диапазон запрошенного ресурса.</summary>
		// Token: 0x04001AD1 RID: 6865
		IfRange,
		/// <summary>Заголовок If-Unmodified-Since, указывающий, что затребованная операция должна выполняться только в том случае, если запрошенный ресурс не изменялся после указанной даты и времени.</summary>
		// Token: 0x04001AD2 RID: 6866
		IfUnmodifiedSince,
		/// <summary>Заголовок Max-Forwards, содержащий целое число, которое указывает, сколько еще раз этот запрос может быть переадресован.</summary>
		// Token: 0x04001AD3 RID: 6867
		MaxForwards,
		/// <summary>Заголовок Proxy-Authorization, указывающий учетные данные, которые предоставляются клиентом для прохождения проверки подлинности на прокси-сервере.</summary>
		// Token: 0x04001AD4 RID: 6868
		ProxyAuthorization,
		/// <summary>Заголовок Referer, указывающий URI ресурса, из которого был получен URI запроса.</summary>
		// Token: 0x04001AD5 RID: 6869
		Referer,
		/// <summary>Заголовок Range, указывающий поддиапазон (или поддиапазоны) ответа, запрошенного клиентом, которые будут возвращены вместо полного ответа.</summary>
		// Token: 0x04001AD6 RID: 6870
		Range,
		/// <summary>Заголовок TE, указывающий кодировки при передаче, допустимые для ответа.</summary>
		// Token: 0x04001AD7 RID: 6871
		Te,
		/// <summary>Заголовок Translate, расширение Microsoft спецификации HTTP, используемое в сочетании с функциональными возможностями WebDAV.</summary>
		// Token: 0x04001AD8 RID: 6872
		Translate,
		/// <summary>Заголовок User-Agent, указывающий сведения об агенте клиента.</summary>
		// Token: 0x04001AD9 RID: 6873
		UserAgent
	}
}
