using System;

namespace System.Net
{
	/// <summary>Заголовки HTTP, которые могут быть указаны в ответе сервера.</summary>
	// Token: 0x020005D3 RID: 1491
	public enum HttpResponseHeader
	{
		/// <summary>Заголовок Cache-Control, который указывает директивы кэширования, которые должны выполняться всеми механизмами кэширования по всей цепи запросов и ответов.</summary>
		// Token: 0x04001ADB RID: 6875
		CacheControl,
		/// <summary>Заголовок Connection, указывающий параметры, необходимые для конкретного подключения.</summary>
		// Token: 0x04001ADC RID: 6876
		Connection,
		/// <summary>Заголовок Date, который указывает дату и время создания ответа.</summary>
		// Token: 0x04001ADD RID: 6877
		Date,
		/// <summary>Заголовок Keep-Alive, который указывает параметр, используемый для поддержки постоянного подключения.</summary>
		// Token: 0x04001ADE RID: 6878
		KeepAlive,
		/// <summary>Заголовок Pragma, указывающий директивы реализации, которые могут применяться к любому агенту про всей цепочке запросов и ответов.</summary>
		// Token: 0x04001ADF RID: 6879
		Pragma,
		/// <summary>Заголовок Trailer, который определяет, что указанные поля заголовка предоставляются в анонсе сообщения, закодированном с помощью поблочного кодирования.</summary>
		// Token: 0x04001AE0 RID: 6880
		Trailer,
		/// <summary>Заголовок Transfer-Encoding, который указывает, какой тип преобразования был применен к основному тексту (если применимо).</summary>
		// Token: 0x04001AE1 RID: 6881
		TransferEncoding,
		/// <summary>Заголовок Upgrade, указывающий дополнительные протоколы связи, поддерживаемые клиентом.</summary>
		// Token: 0x04001AE2 RID: 6882
		Upgrade,
		/// <summary>Заголовок Via, указывающий промежуточные протоколы для использования шлюзом и прокси-агентами.</summary>
		// Token: 0x04001AE3 RID: 6883
		Via,
		/// <summary>Заголовок Warning, указывающий дополнительные сведения о состоянии или преобразовании сообщения, которые не могут быть отражены в сообщении.</summary>
		// Token: 0x04001AE4 RID: 6884
		Warning,
		/// <summary>Заголовок Allow, который указывает набор поддерживаемых методов HTTP.</summary>
		// Token: 0x04001AE5 RID: 6885
		Allow,
		/// <summary>Заголовок Content-Length, указывающий длину (в байтах) сопроводительных данных основного текста.</summary>
		// Token: 0x04001AE6 RID: 6886
		ContentLength,
		/// <summary>Заголовок Content-Type, указывающий тип MIME сопроводительных данных основного текста.</summary>
		// Token: 0x04001AE7 RID: 6887
		ContentType,
		/// <summary>Заголовок Content-Encoding, указывающий кодировки, которые были применены к сопроводительным данным основного текста.</summary>
		// Token: 0x04001AE8 RID: 6888
		ContentEncoding,
		/// <summary>Заголовок Content-Language, который указывает естественный язык или языки данных в основном тексте.</summary>
		// Token: 0x04001AE9 RID: 6889
		ContentLanguage,
		/// <summary>Заголовок Content-Location, который указывает URI, с которого можно получить основной текст.</summary>
		// Token: 0x04001AEA RID: 6890
		ContentLocation,
		/// <summary>Заголовок Content-MD5, указывающий дайджест MD5 сопроводительных данных основного текста с целью предоставления сквозной проверки целостности сообщения.</summary>
		// Token: 0x04001AEB RID: 6891
		ContentMd5,
		/// <summary>Заголовок Range, который указывает дополнительный диапазон или диапазоны ответа, которые будут возвращены в ответ на клиентские запросы вместо полного ответа.</summary>
		// Token: 0x04001AEC RID: 6892
		ContentRange,
		/// <summary>Заголовок Expires, указывающий дату и время, после которого сопроводительные данные основного текста должны считаться устаревшими.</summary>
		// Token: 0x04001AED RID: 6893
		Expires,
		/// <summary>Заголовок Last-Modified, указывающий дату и время последнего изменения сопроводительных данных основного текста.</summary>
		// Token: 0x04001AEE RID: 6894
		LastModified,
		/// <summary>Заголовок Accept-Ranges, который указывает диапазон, принимаемый сервером.</summary>
		// Token: 0x04001AEF RID: 6895
		AcceptRanges,
		/// <summary>Заголовок Age, который указывает время (в секундах), прошедшее с момента создания ответа сервером.</summary>
		// Token: 0x04001AF0 RID: 6896
		Age,
		/// <summary>Заголовок Etag, который указывает текущее значение запрошенного варианта.</summary>
		// Token: 0x04001AF1 RID: 6897
		ETag,
		/// <summary>Заголовок Location, указывающий URI, на который перенаправляется клиент для получения запрашиваемого ресурса.</summary>
		// Token: 0x04001AF2 RID: 6898
		Location,
		/// <summary>Заголовок Proxy-Authenticate, который указывает, что клиент должен пройти проверку подлинности на прокси-сервере.</summary>
		// Token: 0x04001AF3 RID: 6899
		ProxyAuthenticate,
		/// <summary>Заголовок Retry-After, который указывает время (в секундах) или дату и время, после которых клиент может повторно отправить запрос.</summary>
		// Token: 0x04001AF4 RID: 6900
		RetryAfter,
		/// <summary>Заголовок Server, который указывает сведения об исходном агенте сервера.</summary>
		// Token: 0x04001AF5 RID: 6901
		Server,
		/// <summary>Заголовок Set-Cookie, который указывает данные файла cookie, предоставляемого клиенту.</summary>
		// Token: 0x04001AF6 RID: 6902
		SetCookie,
		/// <summary>Заголовок Vary, который указывает заголовки запроса, используемые для определения актуальности кэшированного ответа.</summary>
		// Token: 0x04001AF7 RID: 6903
		Vary,
		/// <summary>Заголовок WWW-Authenticate, который указывает, что клиент должен пройти проверку подлинности на сервере.</summary>
		// Token: 0x04001AF8 RID: 6904
		WwwAuthenticate
	}
}
