using System;

namespace System.Net
{
	/// <summary>Задает разрешения доступа к сети.</summary>
	// Token: 0x020005FE RID: 1534
	[Flags]
	public enum NetworkAccess
	{
		/// <summary>Указывает, что приложение наделено правом разрешать подключения к локальному ресурсу из Интернета. Обратите внимание, что это защита локального узла, использующего класс Accept для предоставления доступа к локальному ресурсу (адрес и порт). В тот момент, когда сокет пытается осуществить привязку к данному локальному ресурсу, выполняется проверка разрешения с целью узнать, существует ли объект Accept для этого ресурса.</summary>
		// Token: 0x04001C2C RID: 7212
		Accept = 128,
		/// <summary>Показывает, что приложению разрешено подключаться к определенным интернет-ресурсам. Обратите внимание, что при существовании ресурса на удаленном узле проверка наличия разрешения Connect не выполняется. Это объясняется тем, что порт подключающегося удаленного узла неизвестен и невозможно заранее создать подходящие права. Проверка прав удаленного узла, пытающегося подключиться к опрашивающему сокету, возлагается на приложение.</summary>
		// Token: 0x04001C2D RID: 7213
		Connect = 64
	}
}
