using System;

namespace System.Net
{
	/// <summary>Указывает протоколы безопасности, которые поддерживаются пакетом безопасности безопасного канала.</summary>
	// Token: 0x02000596 RID: 1430
	[Flags]
	public enum SecurityProtocolType
	{
		/// <summary>Позволяет операционной системе выбрать наилучший протокол для использования и блокирования протоколов, которые не являются безопасными. Если к приложению не предъявляется особых требований, следует использовать это значение.</summary>
		// Token: 0x040019A7 RID: 6567
		SystemDefault = 0,
		/// <summary>Указывает протокол безопасности SSL 3.0. Протокол SSL 3.0 был заменен протоколом TLS и предоставляется только в целях обратной совместимости.</summary>
		// Token: 0x040019A8 RID: 6568
		Ssl3 = 48,
		/// <summary>Указывает протокол безопасности TLS 1.0. Протокол TLS 1.0 определяется в документе IETF RFC 2246.</summary>
		// Token: 0x040019A9 RID: 6569
		Tls = 192,
		/// <summary>Указывает протокол безопасности TLS 1.1. Протокол TLS 1.1 определяется в документе IETF RFC 4346. В операционных системах Windows это значение поддерживается, начиная с Windows 7.</summary>
		// Token: 0x040019AA RID: 6570
		Tls11 = 768,
		/// <summary>Указывает протокол безопасности TLS 1.2. Протокол TLS 1.2 определяется в документе IETF RFC 5246. В операционных системах Windows это значение поддерживается, начиная с Windows 7.</summary>
		// Token: 0x040019AB RID: 6571
		Tls12 = 3072,
		/// <summary>Задается протокол обеспечения безопасности TLS 1.3. Протокол TLS определяется в документе IETF RFC 8446.</summary>
		// Token: 0x040019AC RID: 6572
		Tls13 = 12288
	}
}
