using System;

namespace System.Linq.Expressions
{
	/// <summary>
	///         Предоставляет внутренний интерфейс для доступа к аргументам нескольких узлов дерева (DynamicExpression, ElementInit, MethodCallExpression, InvocationExpression, NewExpression и InexExpression).
	///           Не следует использовать этот API.
	///           Он является открытым только из-за рефакторинга DLL и существует только для внутренней оптимизации производительности.
	///
	///         Благодаря этому доступны два способа оптимизации, которые уменьшают размер деревьев выражений.
	///           Первый способ позволяет узлам дерева удерживаться в IList&lt;T&gt; вместо ReadOnlyCollection.
	///           IList&lt;T&gt; экономит выделение ReadOnlyCollection для каждого узла.
	///           Второй способ включает создание специализированных подклассов, которые могут захватывать определенное число аргументов (например, Block2, Block3, Block4).
	///           Таким образом, для этих узлов не требуется выделять ReadOnlyCollection и массив для хранения их элементов, что экономит по 32 байта на каждый узел.
	///
	///         Узлы дерева выражения по-прежнему предоставляют исходные свойства ReadOnlyCollections LINQ.
	///           Это достигается повторным использованием поля для хранения массива или элемента, который обычно хранятся в массиве.
	///
	///         В случае массива коллекции типизируется в IList&lt;T&gt; вместо ReadOnlyCollection&lt;T&gt;.
	///           Когда узел изначально создается, он является массивом.
	///           Компилятор при доступе к членам использует этот интерфейс.
	///           Доступ к элементам массива повышает уровень массива до ReadOnlyCollection.
	///
	///         В случае объекта первый аргумент хранится в поле, типизированном в объект.
	///           Когда узел изначально создается, это поле содержит выражение.
	///           Компилятор обращается к аргументам через этот интерфейс, и метод доступа для первого аргумента использует Expression.ReturnObject для возврата объекта, который обрабатывает случай выражения (Expression) или ReadOnlyCollection.
	///           Когда пользователь обращается к ReadOnlyCollection, поле объекта обновляется для хранения непосредственно в ReadOnlyCollection.
	///
	///         Важно, что выражения всегда возвращают один и тот же объект ReadOnlyCollection.
	///           В противном случае обход дерева перезаписи будет нарушен.
	///           Это критическое изменение LINQ v1 для возврата разных ReadOnlyCollection из того же узла Expression.
	///           В настоящее время пользователи могут использовать удостоверение объекта, чтобы сообщать, изменился ли узел.
	///           Хранение ReadOnlyCollection в перегруженном поле позволяет сократить использование памяти и обеспечивает совместимость для открытого API-интерфейса.
	///       </summary>
	// Token: 0x0200025D RID: 605
	public interface IArgumentProvider
	{
		/// <summary>
		///         Возвращает аргумент в индексе, создавая исключение, если индекс вне допустимых границ.
		///           Не следует использовать этот тип.
		///           Он является открытым только из-за рефакторинга сборки и используется внутренне для оптимизации производительности.
		///       </summary>
		/// <param name="index">
		///           Индекс аргумента.
		///         </param>
		/// <returns>
		///         Аргумент в индексе, вызываемый, если индекс вне допустимых границ, как <see cref="T:System.Linq.Expressions.Expression" />.
		///       </returns>
		// Token: 0x060011B8 RID: 4536
		Expression GetArgument(int index);

		/// <summary>
		///         Возвращает число аргументов для узла дерева выражения.
		///           Не следует использовать этот тип.
		///           Он является открытым только из-за рефакторинга сборки и используется внутренне для оптимизации производительности.
		///       </summary>
		/// <returns>
		///         Число аргументов для узла дерева выражения в виде <see cref="T:System.Int32" />.
		///       </returns>
		// Token: 0x170002CA RID: 714
		// (get) Token: 0x060011B9 RID: 4537
		int ArgumentCount { get; }
	}
}
