using System;

namespace System.Linq.Expressions
{
	/// <summary>
	///         Предоставляет внутренний интерфейс для доступа к аргументам узлов дерева DynamicExpression, а также к функциональным возможностям CallSite и Rewriting.
	///           Не следует использовать этот API.
	///           Он является открытым только из-за рефакторинга DLL и существует только для внутренней оптимизации производительности.
	///       </summary>
	// Token: 0x0200025E RID: 606
	public interface IDynamicExpression : IArgumentProvider
	{
		/// <summary>
		///         Получает тип делегата, используемого CallSite, который является типом правил, используемых в полиморфном встроенном кэше динамического выражения.
		///       </summary>
		/// <returns>
		///         Тип делегата, используемый CallSite.
		///       </returns>
		// Token: 0x170002CB RID: 715
		// (get) Token: 0x060011BA RID: 4538
		Type DelegateType { get; }

		/// <summary>
		///         Переопределяет этот узел, заменяя аргументы динамического выражения предоставленными значениями.
		///           Количество args должно совпадать с количеством аргументов в текущем выражении.
		///           Не следует использовать этот тип.
		///           Он является открытым только из-за рефакторинга сборки и используется внутренне для оптимизации производительности.
		///           Этот вспомогательный метод позволяет переопределять узлы независимо от конкретной реализации класса, производного от DynamicExpression, который используется на сайте вызова.
		///       </summary>
		/// <param name="args">
		///           Аргументы, используемые для замены этого узла.
		///         </param>
		/// <returns>
		///         Переопределенный узел, но если никакие изменения не вносились, то возвращается тот же узел.
		///       </returns>
		// Token: 0x060011BB RID: 4539
		Expression Rewrite(Expression[] args);

		/// <summary>
		///         При необходимости создает CallSite и возвращает этот CallSite для полиморфного встроенного кэша DynamicExpression.
		///           Не следует использовать этот тип.
		///           Он является открытым только из-за рефакторинга сборки и используется внутренне для оптимизации производительности.
		///       </summary>
		/// <returns>
		///         CallSite для полиморфного встроенного кэша DynamicExpression.
		///       </returns>
		// Token: 0x060011BC RID: 4540
		object CreateCallSite();
	}
}
