using System;

namespace System.Web
{
	/// <summary>Указывает уровень доверия, предоставляемый веб-приложению ASP.NET.</summary>
	// Token: 0x020001E3 RID: 483
	[Serializable]
	public enum AspNetHostingPermissionLevel
	{
		/// <summary>Указывает, что разрешения не предоставлены. Любые запросы на разрешение <see cref="T:System.Web.AspNetHostingPermission" /> завершатся ошибкой.</summary>
		// Token: 0x040007C4 RID: 1988
		None = 100,
		/// <summary>Указывает, что будут успешно выполнены защищенные функции, запрашивающие уровень <see cref="F:System.Web.AspNetHostingPermissionLevel.Minimal" />. Этот уровень позволяет выполнять код, но не позволяет взаимодействовать с ресурсами в системе. Для предоставления этого уровня следует в разделе trust файла конфигурации настроить по крайней мере уровень доверия <see cref="F:System.Web.AspNetHostingPermissionLevel.Minimal" />.</summary>
		// Token: 0x040007C5 RID: 1989
		Minimal = 200,
		/// <summary>Указывает, что будут успешно выполнены защищенные функции, запрашивающие уровень <see cref="F:System.Web.AspNetHostingPermissionLevel.Low" /> или ниже. Этот уровень позволяет предоставлять доступ только для чтения к некоторым ресурсам в ограниченной среде. Для предоставления этого уровня следует в разделе trust файла конфигурации настроить уровень доверия <see cref="F:System.Web.AspNetHostingPermissionLevel.Low" />.</summary>
		// Token: 0x040007C6 RID: 1990
		Low = 300,
		/// <summary>Указывает, что будут успешно выполнены защищенные функции, запрашивающие уровень <see cref="F:System.Web.AspNetHostingPermissionLevel.Medium" /> или ниже. Для предоставления этого уровня следует в разделе trust файла конфигурации настроить по крайней мере уровень доверия <see cref="F:System.Web.AspNetHostingPermissionLevel.Medium" />.</summary>
		// Token: 0x040007C7 RID: 1991
		Medium = 400,
		/// <summary>Указывает, что будут успешно выполнены защищенные функции, запрашивающие уровень доверия <see langword="High" /> или ниже. Этот уровень предназначен для высоконадежных приложений с управляемым кодом, которым нужно использовать много управляемых разрешений, поддерживающих доступ с частичным доверием. Он не предоставляет некоторые из разрешений максимального уровня (например, возможность обращаться к машинному коду), но позволяет запускать надежные приложения с минимально необходимыми привилегиями или устанавливать некоторые ограничения для высоконадежных приложений. Для предоставления этого уровня следует в разделе trust файла конфигурации настроить по крайней мере уровень доверия <see cref="F:System.Web.AspNetHostingPermissionLevel.High" />.</summary>
		// Token: 0x040007C8 RID: 1992
		High = 500,
		/// <summary>Указывает, что будут выполнены все запросы на разрешения для всех возможностей приложения. Это эквивалентно предоставлению уровня доверия <see langword="Full" /> в разделе trust файла конфигурации.</summary>
		// Token: 0x040007C9 RID: 1993
		Unrestricted = 600
	}
}
