using System;

namespace System.EnterpriseServices
{
	/// <summary>Определяет доступный уровень олицетворения при вызове задач серверного приложения.</summary>
	// Token: 0x0200002E RID: 46
	[Serializable]
	public enum ImpersonationLevelOption
	{
		/// <summary>Клиент анонимен для сервера. Серверный процесс может олицетворять клиента, но маркер олицетворения не содержит никакой информации о клиенте.</summary>
		// Token: 0x04000057 RID: 87
		Anonymous = 1,
		/// <summary>Использует заданный по умолчанию уровень олицетворения для указанной службы проверки подлинности. В COM+ этот параметр обеспечивается свойством <see langword="DefaultImpersonationLevel" /> в коллекции <see langword="LocalComputer" />.</summary>
		// Token: 0x04000058 RID: 88
		Default = 0,
		/// <summary>Самый высокий уровень олицетворения. Когда выбран этот уровень, сервер (локальный или удаленный) может олицетворять контекст безопасности клиента, пока действует от его лица.</summary>
		// Token: 0x04000059 RID: 89
		Delegate = 4,
		/// <summary>Уровень, установленный в системе по умолчанию. Сервер может получать удостоверение клиента и олицетворять клиента, чтобы производить проверки списка управления доступом (ACL).</summary>
		// Token: 0x0400005A RID: 90
		Identify = 2,
		/// <summary>Сервер может олицетворять контекст безопасности клиента, пока действует от его лица. Сервер может получать доступ к локальным ресурсам в качестве клиента.</summary>
		// Token: 0x0400005B RID: 91
		Impersonate
	}
}
