using System;

namespace System.EnterpriseServices
{
	/// <summary>Указывает тип автоматической синхронизации, запрошенной компонентом.</summary>
	// Token: 0x0200004F RID: 79
	[Serializable]
	public enum SynchronizationOption
	{
		/// <summary>COM+ игнорирует требования синхронизации компонента при определении контекста для объекта.</summary>
		// Token: 0x0400008E RID: 142
		Disabled,
		/// <summary>Объект с этим значением никогда не участвует в синхронизации, независимо от состояния своего вызывающего объекта. Этот параметр доступен только для компонентов, которые не являются транзактными и не используют активацию по требованию (JIT).</summary>
		// Token: 0x0400008F RID: 143
		NotSupported,
		/// <summary>Обеспечивает синхронизацию всех объектов, созданных из компонента.</summary>
		// Token: 0x04000090 RID: 144
		Required = 3,
		/// <summary>Объект с этим значением должен участвовать в новой синхронизации, где COM+ управляет контекстами и апартаментами от имени всех компонентов, вовлеченных в запрос.</summary>
		// Token: 0x04000091 RID: 145
		RequiresNew,
		/// <summary>Объект с этим значением участвует в синхронизации (если он существует).</summary>
		// Token: 0x04000092 RID: 146
		Supported = 2
	}
}
