using System;

namespace System.Linq
{
	/// <summary>
	///         Указывает предпочитаемый тип слияния вывода для использования в запросе.
	///          Другими словами, указывает, каким образом PLINQ должен объединять результаты из различных разделов в одну итоговую последовательность.
	///          Это только рекомендация, которую система может не соблюдать при параллелизации всех запросов.
	///       </summary>
	// Token: 0x0200008A RID: 138
	public enum ParallelMergeOptions
	{
		/// <summary>
		///         Используйте тип слияния по умолчанию, то есть AutoBuffered.
		///       </summary>
		// Token: 0x040003C6 RID: 966
		Default,
		/// <summary>
		///         Используется режим слияния без буферов вывода.
		///          Как только после вычисления результирующих элементов доступность этого элемента потребителю запроса.
		///       </summary>
		// Token: 0x040003C7 RID: 967
		NotBuffered,
		/// <summary>
		///         Для слияния используются буферы вывода, размер определяется системой.
		///          Результаты накапливаются в буфере вывода, прежде чем они станут доступными потребителю запроса.
		///       </summary>
		// Token: 0x040003C8 RID: 968
		AutoBuffered,
		/// <summary>
		///         Используется режим слияния с полными буферами вывода.
		///          Система будет накапливать все результаты перед выполнением любой из них потребителю запроса.
		///       </summary>
		// Token: 0x040003C9 RID: 969
		FullyBuffered
	}
}
