using System;

namespace System.Linq
{
	/// <summary>
	///         Режим выполнения запросов представляет собой рекомендацию, сообщающую системе, каким образом  следует обрабатывать компромиссы производительности при параллелизации запросов.
	///       </summary>
	// Token: 0x02000089 RID: 137
	public enum ParallelExecutionMode
	{
		/// <summary>
		///         Этот флажок установлен по умолчанию.
		///          Рассмотрим структуру запроса PLINQ и только параллельного выполнения запроса Если будет может привести к ускорения вычислений.
		///          Если структура запроса указывает, ускорение скорее всего не удастся получить, PLINQ выполнит запрос как обычный запрос LINQ to Objects.
		///       </summary>
		// Token: 0x040003C3 RID: 963
		Default,
		/// <summary>
		///         Параллелизации всего запроса, даже если это означает, что с помощью алгоритмов высокими издержками.
		///          Этот флаг используется в случаях, когда вы знаете, параллельное выполнение запроса приведет к ускорению, что PLINQ в режиме по умолчанию будет выполнен как последовательный.
		///       </summary>
		// Token: 0x040003C4 RID: 964
		ForceParallelism
	}
}
