using System;

namespace System.Xml.XPath
{
	/// <summary>
	///         Указывает порядок сортировки.
	///       </summary>
	// Token: 0x02000252 RID: 594
	public enum XmlSortOrder
	{
		/// <summary>
		///         Узлы сортируются в порядке возрастания.
		///          Например если номера 1,2,3 и 4 сортируются в порядке возрастания, они отображаются как 1,2,3,4.
		///       </summary>
		// Token: 0x040017EC RID: 6124
		Ascending = 1,
		/// <summary>
		///         Узлы сортируются в порядке убывания.
		///          Например, если номера 1,2,3 и 4 сортируются в нисходящем порядке, они отображаются в виде 4,3,2,1.
		///       </summary>
		// Token: 0x040017ED RID: 6125
		Descending
	}
}
