using System;

namespace System.Xml.XPath
{
	/// <summary>
	///         Определяет область пространства имен.
	///       </summary>
	// Token: 0x02000258 RID: 600
	public enum XPathNamespaceScope
	{
		/// <summary>
		///         Возвращает все пространства имен, определенные в области текущего узла.
		///          Сюда входят xmlns:xml пространство имен, которое всегда объявляется неявно.
		///          Порядок возвращаемых пространств имен не определен.
		///       </summary>
		// Token: 0x040017FE RID: 6142
		All,
		/// <summary>
		///         Возвращает все пространства имен, определенные в области текущего узла, исключая xmlns:xml пространства имен.
		///         xmlns:xml Пространства имен всегда неявно объявляется.
		///          Порядок возвращаемых пространств имен не определен.
		///       </summary>
		// Token: 0x040017FF RID: 6143
		ExcludeXml,
		/// <summary>
		///         Возвращает все пространства имен, определенные локально в текущем узле.
		///       </summary>
		// Token: 0x04001800 RID: 6144
		Local
	}
}
