using System;

namespace System.Reflection.Emit
{
	/// <summary>Описывает, как значения передаются в стек или выводятся из стека.</summary>
	// Token: 0x0200090A RID: 2314
	public enum StackBehaviour
	{
		/// <summary>Значения из стека не выводятся.</summary>
		// Token: 0x040030A8 RID: 12456
		Pop0,
		/// <summary>Выводит из стека одно значение.</summary>
		// Token: 0x040030A9 RID: 12457
		Pop1,
		/// <summary>Выводит 1 значение из стека для первого операнда и 1 значение из стека для второго операнда.</summary>
		// Token: 0x040030AA RID: 12458
		Pop1_pop1,
		/// <summary>Выводит из стека 32-битовое целое число.</summary>
		// Token: 0x040030AB RID: 12459
		Popi,
		/// <summary>Выводит 32-битовое целое число из стека для первого операнда и значение из стека для второго операнда.</summary>
		// Token: 0x040030AC RID: 12460
		Popi_pop1,
		/// <summary>Выводит 32-битовое целое число из стека для первого операнда и 32-битовое целое число из стека для второго операнда.</summary>
		// Token: 0x040030AD RID: 12461
		Popi_popi,
		/// <summary>Извлекает 32-битовое целое число из стека для первого операнда и 64-битовое целое число из стека для второго операнда.</summary>
		// Token: 0x040030AE RID: 12462
		Popi_popi8,
		/// <summary>Выводит 32-битовое целое число из стека для первого операнда, 32-битовое целое число из стека для второго операнда и 32-битовое целое число из стека для третьего операнда.</summary>
		// Token: 0x040030AF RID: 12463
		Popi_popi_popi,
		/// <summary>Выводит 32-битовое целое число из стека для первого операнда и 32-битовое число с плавающей запятой для второго операнда.</summary>
		// Token: 0x040030B0 RID: 12464
		Popi_popr4,
		/// <summary>Извлекает 32-битовое целое число из стека для первого операнда и 64-битовое число с плавающей запятой для второго операнда.</summary>
		// Token: 0x040030B1 RID: 12465
		Popi_popr8,
		/// <summary>Выводит из стека ссылку.</summary>
		// Token: 0x040030B2 RID: 12466
		Popref,
		/// <summary>Выводит ссылку из стека для первого операнда и значение из стека для второго операнда.</summary>
		// Token: 0x040030B3 RID: 12467
		Popref_pop1,
		/// <summary>Выводит ссылку из стека для первого операнда и 32-битовое целое число из стека для второго операнда.</summary>
		// Token: 0x040030B4 RID: 12468
		Popref_popi,
		/// <summary>Выводит ссылку из стека для первого операнда, значение из стека для второго операнда и значение из стека для третьего операнда.</summary>
		// Token: 0x040030B5 RID: 12469
		Popref_popi_popi,
		/// <summary>Извлекает ссылку из стека для первого операнда, значение из стека для второго операнда и 64-битовое целое число из стека для третьего операнда.</summary>
		// Token: 0x040030B6 RID: 12470
		Popref_popi_popi8,
		/// <summary>Выводит ссылку из стека для первого операнда, значение из стека для второго операнда и 32-битовое целое число из стека для третьего операнда.</summary>
		// Token: 0x040030B7 RID: 12471
		Popref_popi_popr4,
		/// <summary>Выводит ссылку из стека для первого операнда, значение из стека для второго операнда и 64-битовое число с плавающей запятой из стека для третьего операнда.</summary>
		// Token: 0x040030B8 RID: 12472
		Popref_popi_popr8,
		/// <summary>Выводит ссылку из стека для первого операнда, значение из стека для второго операнда и ссылку из стека для третьего операнда.</summary>
		// Token: 0x040030B9 RID: 12473
		Popref_popi_popref,
		/// <summary>Значения в стек не помещаются.</summary>
		// Token: 0x040030BA RID: 12474
		Push0,
		/// <summary>Помещает в стек одно значение.</summary>
		// Token: 0x040030BB RID: 12475
		Push1,
		/// <summary>Помещает 1 значение в стек для первого операнда и 1 значение в стек для второго операнда.</summary>
		// Token: 0x040030BC RID: 12476
		Push1_push1,
		/// <summary>Помещает в стек 32-битовое целое число.</summary>
		// Token: 0x040030BD RID: 12477
		Pushi,
		/// <summary>Помещает в стек 64-битовое целое число.</summary>
		// Token: 0x040030BE RID: 12478
		Pushi8,
		/// <summary>Помещает в стек 32-битовое число с плавающей запятой.</summary>
		// Token: 0x040030BF RID: 12479
		Pushr4,
		/// <summary>Помещает в стек 64-битовое число с плавающей запятой.</summary>
		// Token: 0x040030C0 RID: 12480
		Pushr8,
		/// <summary>Помещает в стек ссылку.</summary>
		// Token: 0x040030C1 RID: 12481
		Pushref,
		/// <summary>Выводит из стека переменную.</summary>
		// Token: 0x040030C2 RID: 12482
		Varpop,
		/// <summary>Помещает в стек переменную.</summary>
		// Token: 0x040030C3 RID: 12483
		Varpush,
		/// <summary>Выводит ссылку из стека для первого операнда, значение из стека для второго операнда и 32-битовое целое число из стека для третьего операнда.</summary>
		// Token: 0x040030C4 RID: 12484
		Popref_popi_pop1
	}
}
