using System;

namespace System.Data.Common
{
	/// <summary>Указывает позицию имени каталога в полном имени таблицы в составе текстовой команды.</summary>
	// Token: 0x02000372 RID: 882
	public enum CatalogLocation
	{
		/// <summary>Указывает, что местоположение имени каталога находится перед частью, отведенной для схемы, в полном имени таблицы в текстовой команде.</summary>
		// Token: 0x04001A63 RID: 6755
		Start = 1,
		/// <summary>Указывает, что местоположение имени каталога находится после части, отведенной для схемы, в полном имени таблицы в текстовой команде.</summary>
		// Token: 0x04001A64 RID: 6756
		End
	}
}
