using System;

namespace System.Data.Common
{
	/// <summary>Указывает, каким образом идентификаторы воспринимаются источником данных при выполнении поиска в системном каталоге.</summary>
	// Token: 0x020003C5 RID: 965
	public enum IdentifierCase
	{
		/// <summary>Источником данных используются неоднозначные правила, касающиеся учета регистра идентификатора, и поэтому эти сведения распознать не удается.</summary>
		// Token: 0x04001BF1 RID: 7153
		Unknown,
		/// <summary>Источник данных не учитывает регистр идентификатора при выполнении поиска в системном каталоге. Идентификаторы "ab" и "AB" будут совпадать.</summary>
		// Token: 0x04001BF2 RID: 7154
		Insensitive,
		/// <summary>Источник данных учитывает регистр идентификатора при выполнении поиска в системном каталоге. Идентификаторы "ab" и "AB" не будут совпадать.</summary>
		// Token: 0x04001BF3 RID: 7155
		Sensitive
	}
}
