using System;

namespace System
{
	/// <summary>Определяет обобщенный метод сравнения, тип значения или класс, который используется для создания метода сравнения с целью упорядочения или сортировки экземпляров.</summary>
	/// <typeparam name="T">Тип объекта для сравнения.</typeparam>
	// Token: 0x0200013A RID: 314
	public interface IComparable<in T>
	{
		/// <summary>Сравнивает текущий экземпляр с другим объектом того же типа и возвращает целое число, которое показывает, расположен ли текущий экземпляр перед, после или на той же позиции в порядке сортировки, что и другой объект.</summary>
		/// <param name="other">Объект для сравнения с данным экземпляром.</param>
		/// <returns>Значение, указывающее, каков относительный порядок сравниваемых объектов. Возвращаемые значения представляют следующие результаты сравнения. 
		///   Значение  Описание  Меньше нуля  Этот экземпляр стоит перед <paramref name="other" /> в порядке сортировки.   Ноль   Данный экземпляр занимает ту же позицию в порядке сортировки, что и объект <paramref name="other" />.   Больше нуля   Данный экземпляр следует за <paramref name="other" /> в порядке сортировки.</returns>
		// Token: 0x06000BEA RID: 3050
		int CompareTo(T other);
	}
}
