using System;

namespace System
{
	/// <summary>Определяет обобщенный метод сравнения, который реализуется типом значения или классом для упорядочения или сортировки экземпляров.</summary>
	// Token: 0x02000139 RID: 313
	public interface IComparable
	{
		/// <summary>Сравнивает текущий экземпляр с другим объектом того же типа и возвращает целое число, которое показывает, расположен ли текущий экземпляр перед, после или на той же позиции в порядке сортировки, что и другой объект.</summary>
		/// <param name="obj">Объект для сравнения с данным экземпляром.</param>
		/// <returns>Значение, указывающее, каков относительный порядок сравниваемых объектов. Возвращаемые значения представляют следующие результаты сравнения. 
		///   Значение 
		///   Значение 
		///   Меньше нуля 
		///   Данный экземпляр предшествует параметру <paramref name="obj" /> в порядке сортировки.  
		///   Нуль 
		///   Данный экземпляр занимает ту же позицию в порядке сортировки, что и параметр <paramref name="obj" />.  
		///   Больше нуля 
		///   Данный экземпляр следует за параметром <paramref name="obj" /> в порядке сортировки.</returns>
		/// <exception cref="T:System.ArgumentException">Тип значения параметра <paramref name="obj" /> отличается от типа данного экземпляра.</exception>
		// Token: 0x06000BE9 RID: 3049
		int CompareTo(object obj);
	}
}
