using System;

namespace System
{
	/// <summary>Определяет методы, которые преобразуют значение реализующей ссылки или типа значения в тип среды CLR с эквивалентным значением.</summary>
	// Token: 0x0200013B RID: 315
	[CLSCompliant(false)]
	public interface IConvertible
	{
		/// <summary>Возвращает <see cref="T:System.TypeCode" /> для этого экземпляра.</summary>
		/// <returns>Перечислимая константа, которая является <see cref="T:System.TypeCode" /> данного класса или типа значения, реализующего этот интерфейс.</returns>
		// Token: 0x06000BEB RID: 3051
		TypeCode GetTypeCode();

		/// <summary>Преобразует значение этого экземпляра в эквивалентное ему логическое значение с использованием указанных сведений об особенностях форматирования, связанных с языком и региональными параметрами.</summary>
		/// <param name="provider">Реализация интерфейса <see cref="T:System.IFormatProvider" />, предоставляющая сведения об особенностях форматирования, связанных с языком и региональными параметрами.</param>
		/// <returns>Логическое значение, эквивалентное значению данного экземпляра.</returns>
		// Token: 0x06000BEC RID: 3052
		bool ToBoolean(IFormatProvider provider);

		/// <summary>Преобразует значение этого экземпляра в эквивалентный символ Юникода с использованием указанных сведений об особенностях форматирования, связанных с языком и региональными параметрами.</summary>
		/// <param name="provider">Реализация интерфейса <see cref="T:System.IFormatProvider" />, предоставляющая сведения об особенностях форматирования, связанных с языком и региональными параметрами.</param>
		/// <returns>Символ Юникода, эквивалентный значению данного экземпляра.</returns>
		// Token: 0x06000BED RID: 3053
		char ToChar(IFormatProvider provider);

		/// <summary>Преобразует значение этого экземпляра в эквивалентное ему 8-битовое целое число со знаком с использованием указанных сведений об особенностях форматирования, связанных с языком и региональными параметрами.</summary>
		/// <param name="provider">Реализация интерфейса <see cref="T:System.IFormatProvider" />, предоставляющая сведения об особенностях форматирования, связанных с языком и региональными параметрами.</param>
		/// <returns>8-битовое целое число со знаком, эквивалентное значению данного экземпляра.</returns>
		// Token: 0x06000BEE RID: 3054
		sbyte ToSByte(IFormatProvider provider);

		/// <summary>Преобразует значение этого экземпляра в эквивалентное ему 8-битовое целое число без знака с использованием указанных сведений об особенностях форматирования, связанных с языком и региональными параметрами.</summary>
		/// <param name="provider">Реализация интерфейса <see cref="T:System.IFormatProvider" />, предоставляющая сведения об особенностях форматирования, связанных с языком и региональными параметрами.</param>
		/// <returns>8-битовое целое число без знака, эквивалентное значению данного экземпляра.</returns>
		// Token: 0x06000BEF RID: 3055
		byte ToByte(IFormatProvider provider);

		/// <summary>Преобразует значение этого экземпляра в эквивалентное ему 16-битовое целое число со знаком с использованием указанных сведений об особенностях форматирования, связанных с языком и региональными параметрами.</summary>
		/// <param name="provider">Реализация интерфейса <see cref="T:System.IFormatProvider" />, предоставляющая сведения об особенностях форматирования, связанных с языком и региональными параметрами.</param>
		/// <returns>16-битовое целое число со знаком, эквивалентное значению данного экземпляра.</returns>
		// Token: 0x06000BF0 RID: 3056
		short ToInt16(IFormatProvider provider);

		/// <summary>Преобразует значение этого экземпляра в эквивалентное ему 16-битовое целое число без знака с использованием указанных сведений об особенностях форматирования, связанных с языком и региональными параметрами.</summary>
		/// <param name="provider">Реализация интерфейса <see cref="T:System.IFormatProvider" />, предоставляющая сведения об особенностях форматирования, связанных с языком и региональными параметрами.</param>
		/// <returns>16-битовое целое число без знака, эквивалентное значению данного экземпляра.</returns>
		// Token: 0x06000BF1 RID: 3057
		ushort ToUInt16(IFormatProvider provider);

		/// <summary>Преобразует значение этого экземпляра в эквивалентное ему 32-битовое целое число со знаком с использованием указанных сведений об особенностях форматирования, связанных с языком и региональными параметрами.</summary>
		/// <param name="provider">Реализация интерфейса <see cref="T:System.IFormatProvider" />, предоставляющая сведения об особенностях форматирования, связанных с языком и региональными параметрами.</param>
		/// <returns>32-битовое целое число со знаком, эквивалентное значению данного экземпляра.</returns>
		// Token: 0x06000BF2 RID: 3058
		int ToInt32(IFormatProvider provider);

		/// <summary>Преобразует значение этого экземпляра в эквивалентное ему 32-битовое целое число без знака с использованием указанных сведений об особенностях форматирования, связанных с языком и региональными параметрами.</summary>
		/// <param name="provider">Реализация интерфейса <see cref="T:System.IFormatProvider" />, предоставляющая сведения об особенностях форматирования, связанных с языком и региональными параметрами.</param>
		/// <returns>32-битовое целое число без знака, эквивалентное значению данного экземпляра.</returns>
		// Token: 0x06000BF3 RID: 3059
		uint ToUInt32(IFormatProvider provider);

		/// <summary>Преобразует значение этого экземпляра в эквивалентное ему 64-битовое целое число со знаком с использованием указанных сведений об особенностях форматирования, связанных с языком и региональными параметрами.</summary>
		/// <param name="provider">Реализация интерфейса <see cref="T:System.IFormatProvider" />, предоставляющая сведения об особенностях форматирования, связанных с языком и региональными параметрами.</param>
		/// <returns>64-битовое целое число со знаком, эквивалентное значению данного экземпляра.</returns>
		// Token: 0x06000BF4 RID: 3060
		long ToInt64(IFormatProvider provider);

		/// <summary>Преобразует значение этого экземпляра в эквивалентное ему 64-битовое целое число без знака с использованием указанных сведений об особенностях форматирования, связанных с языком и региональными параметрами.</summary>
		/// <param name="provider">Реализация интерфейса <see cref="T:System.IFormatProvider" />, предоставляющая сведения об особенностях форматирования, связанных с языком и региональными параметрами.</param>
		/// <returns>64-битовое целое число без знака, эквивалентное значению данного экземпляра.</returns>
		// Token: 0x06000BF5 RID: 3061
		ulong ToUInt64(IFormatProvider provider);

		/// <summary>Преобразует значение этого экземпляра в эквивалентное число одинарной точности с плавающей запятой с использованием указанных сведений об особенностях форматирования, связанных с языком и региональными параметрами.</summary>
		/// <param name="provider">Реализация интерфейса <see cref="T:System.IFormatProvider" />, предоставляющая сведения об особенностях форматирования, связанных с языком и региональными параметрами.</param>
		/// <returns>Число одинарной точности с плавающей запятой, эквивалентное значению данного экземпляра.</returns>
		// Token: 0x06000BF6 RID: 3062
		float ToSingle(IFormatProvider provider);

		/// <summary>Преобразует значение этого экземпляра в эквивалентное число двойной точности с плавающей запятой с использованием указанных сведений об особенностях форматирования, связанных с языком и региональными параметрами.</summary>
		/// <param name="provider">Реализация интерфейса <see cref="T:System.IFormatProvider" />, предоставляющая сведения об особенностях форматирования, связанных с языком и региональными параметрами.</param>
		/// <returns>Число двойной точности с плавающей запятой, эквивалентное значению данного экземпляра.</returns>
		// Token: 0x06000BF7 RID: 3063
		double ToDouble(IFormatProvider provider);

		/// <summary>Преобразует значение этого экземпляра в эквивалентное число типа <see cref="T:System.Decimal" /> с использованием указанных сведений об особенностях форматирования, связанных с языком и региональными параметрами.</summary>
		/// <param name="provider">Реализация интерфейса <see cref="T:System.IFormatProvider" />, предоставляющая сведения об особенностях форматирования, связанных с языком и региональными параметрами.</param>
		/// <returns>Число типа <see cref="T:System.Decimal" />, эквивалентное значению данного экземпляра.</returns>
		// Token: 0x06000BF8 RID: 3064
		decimal ToDecimal(IFormatProvider provider);

		/// <summary>Преобразует значение этого экземпляра в эквивалентную строку <see cref="T:System.DateTime" /> с использованием указанных сведений об особенностях форматирования, связанных с языком и региональными параметрами.</summary>
		/// <param name="provider">Реализация интерфейса <see cref="T:System.IFormatProvider" />, предоставляющая сведения об особенностях форматирования, связанных с языком и региональными параметрами.</param>
		/// <returns>Экземпляр <see cref="T:System.DateTime" />, эквивалентный значению данного экземпляра.</returns>
		// Token: 0x06000BF9 RID: 3065
		DateTime ToDateTime(IFormatProvider provider);

		/// <summary>Преобразует значение этого экземпляра в эквивалентную строку <see cref="T:System.String" /> с использованием указанных сведений об особенностях форматирования, связанных с языком и региональными параметрами.</summary>
		/// <param name="provider">Реализация интерфейса <see cref="T:System.IFormatProvider" />, предоставляющая сведения об особенностях форматирования, связанных с языком и региональными параметрами.</param>
		/// <returns>Экземпляр <see cref="T:System.String" />, эквивалентный значению данного экземпляра.</returns>
		// Token: 0x06000BFA RID: 3066
		string ToString(IFormatProvider provider);

		/// <summary>Преобразует значение этого экземпляра в объект <see cref="T:System.Object" /> указанного типа <see cref="T:System.Type" />, имеющий эквивалентное значение, с использованием указанных сведений об особенностях форматирования, связанных с языком и региональными параметрами.</summary>
		/// <param name="conversionType">
		///   <see cref="T:System.Type" />, в который преобразуется значение данного экземпляра.</param>
		/// <param name="provider">Реализация интерфейса <see cref="T:System.IFormatProvider" />, предоставляющая сведения об особенностях форматирования, связанных с языком и региональными параметрами.</param>
		/// <returns>Экземпляр <see cref="T:System.Object" /> типа <paramref name="conversionType" />, значение которого эквивалентно значению данного экземпляра.</returns>
		// Token: 0x06000BFB RID: 3067
		object ToType(Type conversionType, IFormatProvider provider);
	}
}
