using System;

namespace System
{
	/// <summary>Задает способ обработки чисел, которые равноудалены от двух соседних чисел, в математических методах округления.</summary>
	// Token: 0x0200015B RID: 347
	public enum MidpointRounding
	{
		/// <summary>Когда число находится посредине между двумя другими числами, оно округляется до ближайшего четного числа.</summary>
		// Token: 0x04001282 RID: 4738
		ToEven,
		/// <summary>Когда число находится посредине между двумя другими числами, оно округляется до ближайшего числа дальше от нуля.</summary>
		// Token: 0x04001283 RID: 4739
		AwayFromZero
	}
}
