using System;

namespace System
{
	/// <summary>Указывает, какой язык, региональные параметры, регистр и правила сортировки должны использовать определенные перегрузки методов <see cref="M:System.String.Compare(System.String,System.String)" /> и <see cref="M:System.String.Equals(System.Object)" />.</summary>
	// Token: 0x0200018C RID: 396
	public enum StringComparison
	{
		/// <summary>Сравнивать строки, используя правила сортировки с учетом языка и региональных параметров и текущий язык и региональные параметры.</summary>
		// Token: 0x040012F7 RID: 4855
		CurrentCulture,
		/// <summary>Сравнивать строки, используя правила сортировки с учетом языка и региональных параметров и текущий язык и региональные параметры без учета регистра сравниваемых строк.</summary>
		// Token: 0x040012F8 RID: 4856
		CurrentCultureIgnoreCase,
		/// <summary>Сравнивать строки, используя правила сортировки с учетом языка и региональных параметров и инвариантный язык и региональные параметры.</summary>
		// Token: 0x040012F9 RID: 4857
		InvariantCulture,
		/// <summary>Сравнивать строки, используя правила сортировки с учетом языка и региональных параметров и инвариантный язык и региональные параметры без учета регистра сравниваемых строк.</summary>
		// Token: 0x040012FA RID: 4858
		InvariantCultureIgnoreCase,
		/// <summary>Сравнивать строки, используя правила обычной (двоичной) сортировки.</summary>
		// Token: 0x040012FB RID: 4859
		Ordinal,
		/// <summary>Сравнивать строки, используя правила обычной (двоичной) сортировки без учета регистра сравниваемых строк.</summary>
		// Token: 0x040012FC RID: 4860
		OrdinalIgnoreCase
	}
}
