using System;

namespace System
{
	/// <summary>Задает тип объекта.</summary>
	// Token: 0x020001A3 RID: 419
	public enum TypeCode
	{
		/// <summary>Пустая ссылка.</summary>
		// Token: 0x04001348 RID: 4936
		Empty,
		/// <summary>Универсальный тип для представления любых типов значений и ссылочных типов, которые не могут быть представлены никаким другим значением <see langword="TypeCode" />.</summary>
		// Token: 0x04001349 RID: 4937
		Object,
		/// <summary>Значение null (столбца) базы данных.</summary>
		// Token: 0x0400134A RID: 4938
		DBNull,
		/// <summary>Простой тип для представления логических значений <see langword="true" /> и <see langword="false" />.</summary>
		// Token: 0x0400134B RID: 4939
		Boolean,
		/// <summary>Целочисленный тип для представления 16-разрядных целых чисел без знака в диапазоне от 0 до 65535. Набор возможных значений типа <see cref="F:System.TypeCode.Char" /> соответствует набору знаков Юникода.</summary>
		// Token: 0x0400134C RID: 4940
		Char,
		/// <summary>Целочисленный тип для представления 8-разрядных целых чисел со знаком в диапазоне от -128 до 127.</summary>
		// Token: 0x0400134D RID: 4941
		SByte,
		/// <summary>Целочисленный тип для представления 8-битовых целых чисел без знака в диапазоне от 0 до 255.</summary>
		// Token: 0x0400134E RID: 4942
		Byte,
		/// <summary>Целочисленный тип для представления 16-разрядных целых чисел со знаком в диапазоне от -32768 до 32767.</summary>
		// Token: 0x0400134F RID: 4943
		Int16,
		/// <summary>Целочисленный тип для представления 16-разрядных целых чисел без знака в диапазоне от 0 до 65535.</summary>
		// Token: 0x04001350 RID: 4944
		UInt16,
		/// <summary>Целочисленный тип для представления 32-разрядных целых чисел со знаком в диапазоне от -2147483648 до 2147483647.</summary>
		// Token: 0x04001351 RID: 4945
		Int32,
		/// <summary>Целочисленный тип для представления 32-разрядных целых чисел со значениями от 0 до 4294967295.</summary>
		// Token: 0x04001352 RID: 4946
		UInt32,
		/// <summary>Целочисленный тип для представления 64-разрядных целых чисел со знаком в диапазоне от -9223372036854775808 до 9223372036854775807.</summary>
		// Token: 0x04001353 RID: 4947
		Int64,
		/// <summary>Целочисленный тип для представления 64-разрядных целых чисел со значениями от 0 до 18446744073709551615.</summary>
		// Token: 0x04001354 RID: 4948
		UInt64,
		/// <summary>Тип для представления значений с плавающей запятой в диапазоне от 1,5 x 10 -45 до приблизительно 3,4 x 10 38 с точностью до 7знаков.</summary>
		// Token: 0x04001355 RID: 4949
		Single,
		/// <summary>Тип для представления значений с плавающей запятой в диапазоне от 5,0 x 10 -324 до приблизительно 1,7 x 10 308 с точностью до 15–16 знаков.</summary>
		// Token: 0x04001356 RID: 4950
		Double,
		/// <summary>Простой тип для представления значений в диапазоне от 1,0 x 10 -28 до приблизительно 7,9 x 10 28 с 28–29 значимыми цифрами.</summary>
		// Token: 0x04001357 RID: 4951
		Decimal,
		/// <summary>Тип, представляющий значение даты и времени.</summary>
		// Token: 0x04001358 RID: 4952
		DateTime,
		/// <summary>Тип запечатанного класса для представления строк знаков Юникода.</summary>
		// Token: 0x04001359 RID: 4953
		String = 18
	}
}
