using System;

namespace Microsoft.Win32
{
	/// <summary>Определяет типы данных, используемые для хранения значений в реестре, или задает тип данных значения в реестре.</summary>
	// Token: 0x020000A7 RID: 167
	public enum RegistryValueKind
	{
		/// <summary>Строка, заканчивающаяся нулем. Это значение эквивалентно типу данных реестра REG_SZ интерфейса Win32 API.</summary>
		// Token: 0x04000F72 RID: 3954
		String = 1,
		/// <summary>Заканчивающаяся нулем строка, содержащая нерасширенные ссылки на переменные среды, такие как %PATH%, которые расширяются при получении значения. Это значение эквивалентно типу данных реестра REG_EXPAND_SZ интерфейса Win32 API.</summary>
		// Token: 0x04000F73 RID: 3955
		ExpandString,
		/// <summary>Двоичные данные в любой форме. Это значение эквивалентно типу данных реестра REG_BINARY интерфейса Win32 API.</summary>
		// Token: 0x04000F74 RID: 3956
		Binary,
		/// <summary>32-разрядное двоичное число. Это значение эквивалентно типу данных реестра REG_DWORD интерфейса Win32 API.</summary>
		// Token: 0x04000F75 RID: 3957
		DWord,
		/// <summary>Массив заканчивающихся нулем строк, завершаемый двумя символами NULL. Это значение эквивалентно типу данных реестра REG_MULTI_SZ интерфейса Win32 API.</summary>
		// Token: 0x04000F76 RID: 3958
		MultiString = 7,
		/// <summary>64-разрядное двоичное число. Это значение эквивалентно типу данных реестра REG_QWORD интерфейса Win32 API.</summary>
		// Token: 0x04000F77 RID: 3959
		QWord = 11,
		/// <summary>Неподдерживаемый тип данных реестра. Например, неподдерживаемым является тип данных REG_RESOURCE_LIST интерфейса Win32 API. Это значение позволяет определить, что при сохранении пары "имя-значение" метод <see cref="M:Microsoft.Win32.RegistryKey.SetValue(System.String,System.Object)" /> должен определять соответствующий тип данных реестра.</summary>
		// Token: 0x04000F78 RID: 3960
		Unknown = 0,
		/// <summary>Нет типа данных.</summary>
		// Token: 0x04000F79 RID: 3961
		None = -1
	}
}
