using System;

namespace System.Runtime.InteropServices
{
	/// <summary>Предоставляет типы дескрипторов, которые могут быть выделены классом <see cref="T:System.Runtime.InteropServices.GCHandle" />.</summary>
	// Token: 0x020006CE RID: 1742
	public enum GCHandleType
	{
		/// <summary>Этот тип дескриптора используется для отслеживания объекта, но позволяет выполнять его сбор. При сборе объекта содержимое объекта <see cref="T:System.Runtime.InteropServices.GCHandle" /> обнуляется. Перед запуском метода завершения ссылки <see langword="Weak" /> обнуляются, поэтому даже если метод завершения восстановит объект, ссылка <see langword="Weak" /> остается обнуленной.</summary>
		// Token: 0x04002A0F RID: 10767
		Weak,
		/// <summary>Этот тип дескриптора аналогичен <see cref="F:System.Runtime.InteropServices.GCHandleType.Weak" />, но дескриптор не обнуляется при восстановлении объекта в процессе завершения.</summary>
		// Token: 0x04002A10 RID: 10768
		WeakTrackResurrection,
		/// <summary>Этот тип дескриптора предоставляет непрозрачный дескриптор, то есть адрес закрепленного объекта, используемый дескриптором, нельзя разрешить с помощью дескриптора. Этот тип можно использовать для отслеживания объекта и предотвращения его уничтожения сборщиком мусора. Этот член перечисления используется, когда неуправляемый клиент содержит только одну ссылку на управляемый объект, которую не может обнаружить сборщик мусора.</summary>
		// Token: 0x04002A11 RID: 10769
		Normal,
		/// <summary>Этот тип дескриптора аналогичен <see cref="F:System.Runtime.InteropServices.GCHandleType.Normal" />, но он позволяет работать с адресом закрепленного объекта. Это не позволяет сборщику мусора перемещать объект. В результате эффективность сборщика мусора снижается. Для максимально быстрого освобождения выделенного дескриптора следует использовать метод <see cref="M:System.Runtime.InteropServices.GCHandle.Free" />.</summary>
		// Token: 0x04002A12 RID: 10770
		Pinned
	}
}
