using System;

namespace System.Security.Cryptography.X509Certificates
{
	/// <summary>Определяет, куда и как импортируется закрытый ключ сертификата X.509.</summary>
	// Token: 0x020004D8 RID: 1240
	[Flags]
	public enum X509KeyStorageFlags
	{
		/// <summary>Используемый по умолчанию набор ключей.  Как правило, по умолчанию используется пользовательский набор ключей.</summary>
		// Token: 0x04002291 RID: 8849
		DefaultKeySet = 0,
		/// <summary>Закрытые ключи хранятся в хранилище текущего пользователя, а не в хранилище локального компьютера. Это происходит даже в том случае, если в сертификате указывается, что ключи должны размещаться в хранилище локального компьютера.</summary>
		// Token: 0x04002292 RID: 8850
		UserKeySet = 1,
		/// <summary>Закрытые ключи хранятся в хранилище локального компьютера, а не в хранилище текущего пользователя.</summary>
		// Token: 0x04002293 RID: 8851
		MachineKeySet = 2,
		/// <summary>Импортированные ключи помечаются как доступные для экспорта.</summary>
		// Token: 0x04002294 RID: 8852
		Exportable = 4,
		/// <summary>Следует уведомить пользователя с помощью диалогового окна или другого способа о том, что был осуществлен доступ к ключу.  Точное поведение определяется поставщиком служб шифрования (CSP).</summary>
		// Token: 0x04002295 RID: 8853
		UserProtected = 8,
		/// <summary>Ключ, связанный с PFX-файлом, сохраняется при импорте сертификата.</summary>
		// Token: 0x04002296 RID: 8854
		PersistKeySet = 16,
		/// <summary>Ключ, связанный с PFX-файлом, создается в памяти и не сохраняется на диске при импорте сертификата.</summary>
		// Token: 0x04002297 RID: 8855
		EphemeralKeySet = 32
	}
}
