using System;

namespace System.Security
{
	/// <summary>Определяет целые значения, соответствующие зонам безопасности, которые используются политикой безопасности.</summary>
	// Token: 0x020003CB RID: 971
	public enum SecurityZone
	{
		/// <summary>Зона Интернета объединяет веб-узлы в Интернете, не относящиеся к другим зонам.</summary>
		// Token: 0x04001E94 RID: 7828
		Internet = 3,
		/// <summary>Зона местной интрасети служит для содержимого, расположенного в интрасети компании. Поскольку серверы и информация находятся по внутреннюю сторону межсетевого экрана компании, пользователь или компания могут присвоить содержимому интрасети более высокий уровень доверия.</summary>
		// Token: 0x04001E95 RID: 7829
		Intranet = 1,
		/// <summary>Зона локального компьютера — это неявная зона, к которой относится содержимое, расположенное на компьютере пользователя.</summary>
		// Token: 0x04001E96 RID: 7830
		MyComputer = 0,
		/// <summary>Зона не указана.</summary>
		// Token: 0x04001E97 RID: 7831
		NoZone = -1,
		/// <summary>Зона надежных узелов служит для содержимого, расположенного на веб-узлах, которые считаются более надежными или заслуживающими доверия по сравнению с остальными узлами в Интернете. С помощью этой зоны пользователи могут присвоить подобным узлам более высокий уровень доверия и тем самым свести к минимуму число запросов на проверку подлинности. URL-адреса этих надежных веб-узелов должны быть добавлены в эту зону пользователем.</summary>
		// Token: 0x04001E98 RID: 7832
		Trusted = 2,
		/// <summary>Зона ограниченных узелов служит для веб-узелов, загрузка содержимого которых может привести или уже приводила к проблемам. URL-адреса этих ненадежных веб-узелов должны быть добавлены в эту зону пользователем.</summary>
		// Token: 0x04001E99 RID: 7833
		Untrusted = 4
	}
}
