using System;

namespace System.Diagnostics.Eventing.Reader
{
	/// <summary>
	///         Определяет права доступа по умолчанию для журнала событий.
	///          Приложения и системы значения указывают, что журнал совместно список управления доступом (ACL) соответствующий журнал Windows (приложения или системы, журналы событий) и общей папки с журналами, другие же изоляции сеанса трассировки событий для Windows (ETW).
	///          Все каналы с пользовательской изоляцией используют закрытый сеанс ETW.
	///       </summary>
	// Token: 0x0200039F RID: 927
	public enum EventLogIsolation
	{
		/// <summary>
		///         В журнале совместно использует список управления доступом с журналом событий приложения и использует сеанс ETW с другие журналы, имеющие изоляции приложений.
		///       </summary>
		// Token: 0x04000D4B RID: 3403
		Application,
		/// <summary>
		///         Журнал событий — имя пользовательского журнала событий, который использует свой собственный закрытый сеанс ETW.
		///       </summary>
		// Token: 0x04000D4C RID: 3404
		Custom = 2,
		/// <summary>
		///         Журнал совместно использует список управления доступом с журналом событий системы и использует сеанс ETW совместно с другими журналы системы.
		///       </summary>
		// Token: 0x04000D4D RID: 3405
		System = 1
	}
}
