using System;

namespace System.Diagnostics.Eventing.Reader
{
	/// <summary>
	///         Определяет тип события, записываемые в журнал событий.
	///          Каждый журнал может содержать только один тип события.
	///       </summary>
	// Token: 0x020003A1 RID: 929
	public enum EventLogType
	{
		/// <summary>
		///         Эти события являются в основном для конечных пользователей, администраторов и поддержки.
		///          События, обнаруженные в журналах административного типа указывают на проблемы и четко определенных решений, администратор может выполнять.
		///          Примером административных событий является событие, которое происходит, когда приложение не сможет подключиться к принтеру.
		///       </summary>
		// Token: 0x04000D53 RID: 3411
		Administrative,
		/// <summary>
		///         События в журнале аналитических событий публикуются в больших объемах.
		///          Они описывают функционирование программы и указывают на проблемы, которые не могут быть обработаны вмешательства пользователя.
		///       </summary>
		// Token: 0x04000D54 RID: 3412
		Analytical = 2,
		/// <summary>
		///         События в журнале событий отладочного типа используются только разработчиками для диагностики проблемы при отладке.
		///       </summary>
		// Token: 0x04000D55 RID: 3413
		Debug,
		/// <summary>
		///         События в журнале событий операционного типа используются для анализа и диагностики проблем или событий.
		///          Они могут использоваться для запуска средств или задач, исходя из проблемы или происхождения события.
		///          Примером события операционного является событие, возникающее, когда принтер добавляется или удаляется из системы.
		///       </summary>
		// Token: 0x04000D56 RID: 3414
		Operational = 1
	}
}
