using System;

namespace System.Diagnostics.Eventing.Reader
{
	/// <summary>
	///         Определяет поведение для службы журнала событий обрабатывает журнал событий, когда файл журнала достигает максимального размера (при заполнении журнала событий).
	///       </summary>
	// Token: 0x020003A0 RID: 928
	public enum EventLogMode
	{
		/// <summary>
		///         Архивировать журнал при заполнении, не перезаписывать события.
		///          Журнал автоматически архивируется при необходимости.
		///          Событий не перезаписываются.
		///       </summary>
		// Token: 0x04000D4F RID: 3407
		AutoBackup = 1,
		/// <summary>
		///         Новые записи продолжают храниться, когда файл журнала заполнен.
		///          Каждое новое событие заменяет старые события в журнале.
		///       </summary>
		// Token: 0x04000D50 RID: 3408
		Circular = 0,
		/// <summary>
		///         Не перезаписывать события.
		///          Очистка журнала только вручную.
		///       </summary>
		// Token: 0x04000D51 RID: 3409
		Retain = 2
	}
}
