using System;

namespace System.Diagnostics.Eventing.Reader
{
	/// <summary>
	///         Определяет стандартные ключевые слова, которые прикреплены к событиям поставщиком событий.
	///          Дополнительные сведения о ключевых словах см. в разделе <see cref="T:System.Diagnostics.Eventing.Reader.EventKeyword" />.
	///       </summary>
	// Token: 0x020003B5 RID: 949
	[Flags]
	public enum StandardEventKeywords : long
	{
		/// <summary>
		///         Вкладывается во все неудавшиеся события аудита безопасности.
		///          Это ключевое слово следует использовать только для событий в журнале безопасности.
		///       </summary>
		// Token: 0x04000D58 RID: 3416
		AuditFailure = 4503599627370496L,
		/// <summary>
		///         Вкладывается во все успешные события аудита безопасности.
		///          Это ключевое слово следует использовать только для событий в журнале безопасности.
		///       </summary>
		// Token: 0x04000D59 RID: 3417
		AuditSuccess = 9007199254740992L,
		/// <summary>
		///         Присоединенные события перемещения, в которых идентификатор действия (Корреляционный идентификатор) является вычисленным значением и не обязательно быть уникальным (не является действительным GUID).
		///       </summary>
		// Token: 0x04000D5A RID: 3418
		[Obsolete("Incorrect value: use CorrelationHint2 instead", false)]
		CorrelationHint = 4503599627370496L,
		/// <summary>
		///         Присоединенные события перемещения, в которых идентификатор действия (Корреляционный идентификатор) является вычисленным значением и не обязательно быть уникальным (не является действительным GUID).
		///       </summary>
		// Token: 0x04000D5B RID: 3419
		CorrelationHint2 = 18014398509481984L,
		/// <summary>
		///         Назначенные события, вызываемые с помощью функции RaiseEvent.
		///       </summary>
		// Token: 0x04000D5C RID: 3420
		EventLogClassic = 36028797018963968L,
		/// <summary>
		///         Это значение указывает, что фильтрация по ключевому слову не выполняется при публикации события.
		///       </summary>
		// Token: 0x04000D5D RID: 3421
		None = 0L,
		/// <summary>
		///         Вкладывается во все события времени ответа.
		///       </summary>
		// Token: 0x04000D5E RID: 3422
		ResponseTime = 281474976710656L,
		/// <summary>
		///         Вкладывается во все события механизма качества служб (SQM).
		///       </summary>
		// Token: 0x04000D5F RID: 3423
		Sqm = 2251799813685248L,
		/// <summary>
		///         Вкладывается во все контекстные события инфраструктуры диагностики Windows (WDI).
		///       </summary>
		// Token: 0x04000D60 RID: 3424
		WdiContext = 562949953421312L,
		/// <summary>
		///         Вкладывается во все диагностические события инфраструктуры диагностики Windows (WDI).
		///       </summary>
		// Token: 0x04000D61 RID: 3425
		WdiDiagnostic = 1125899906842624L
	}
}
