using System;

namespace System.Diagnostics.Eventing.Reader
{
	/// <summary>
	///         Определяет стандартные коды операций, связанных с поставщиком событий.
	///          Дополнительные сведения о кодах операций см. в разделе <see cref="T:System.Diagnostics.Eventing.Reader.EventOpcode" />.
	///       </summary>
	// Token: 0x020003B7 RID: 951
	public enum StandardEventOpcode
	{
		/// <summary>
		///         Событие с данным кодом операций является событием запуска коллекции трассировки.
		///       </summary>
		// Token: 0x04000D6A RID: 3434
		DataCollectionStart = 3,
		/// <summary>
		///         Событие с данным кодом операций является событием остановки коллекции трассировки.
		///       </summary>
		// Token: 0x04000D6B RID: 3435
		DataCollectionStop,
		/// <summary>
		///         Событие с данным кодом операций является событием расширения.
		///       </summary>
		// Token: 0x04000D6C RID: 3436
		Extension,
		/// <summary>
		///         Событие с данным кодом операций является информационное событие.
		///       </summary>
		// Token: 0x04000D6D RID: 3437
		Info = 0,
		/// <summary>
		///         Событие с данным кодом операций публикуется, когда одно действие в приложение получает данные.
		///       </summary>
		// Token: 0x04000D6E RID: 3438
		Receive = 240,
		/// <summary>
		///         Событие с данным кодом операций публикуется после ответа действия в приложении на событие.
		///       </summary>
		// Token: 0x04000D6F RID: 3439
		Reply = 6,
		/// <summary>
		///         Событие с данным кодом операций публикуется после выхода действия в приложении из приостановленного состояния.
		///          Это событие должно следовать событие с кодом операций Suspend.
		///       </summary>
		// Token: 0x04000D70 RID: 3440
		Resume,
		/// <summary>
		///         Событие с данным кодом операций публикуется при передаче одного действия в приложении данных или системных ресурсов другому действию.
		///       </summary>
		// Token: 0x04000D71 RID: 3441
		Send = 9,
		/// <summary>
		///         Событие с данным кодом операций публикуется при запуске приложения в новой транзакции или действия.
		///          Это могут быть внедрены в другую транзакцию или действие, если несколько событий с кодом операций Start друг за другом без кода операций Stop событие.
		///       </summary>
		// Token: 0x04000D72 RID: 3442
		Start = 1,
		/// <summary>
		///         Событие с данным кодом операций публикуется при завершении действия или транзакции в приложении.
		///          Событие соответствует последнему непарному событию с кодом операций Start.
		///       </summary>
		// Token: 0x04000D73 RID: 3443
		Stop,
		/// <summary>
		///         Событие с данным кодом операций публикуется при приостановке действия в приложении.
		///       </summary>
		// Token: 0x04000D74 RID: 3444
		Suspend = 8
	}
}
