using System;

namespace System.Diagnostics.Eventing.Reader
{
	/// <summary>
	///         Определяет стандартные уровни событий, используемые в службе журнала событий.
	///          Уровень определяет серьезность события.
	///          Пользовательские уровни события могут быть определены за пределами этих стандартных уровнях.
	///          Дополнительные сведения об уровнях см. в разделе <see cref="T:System.Diagnostics.Eventing.Reader.EventLevel" />.
	///       </summary>
	// Token: 0x020003B6 RID: 950
	public enum StandardEventLevel
	{
		/// <summary>
		///         Данный уровень соответствует критических ошибок, который является серьезной ошибкой, которая вызвала серьезный сбой.
		///       </summary>
		// Token: 0x04000D63 RID: 3427
		Critical = 1,
		/// <summary>
		///         Данный уровень соответствует обычным сообщениям об ошибке, указывающим на наличие проблемы.
		///       </summary>
		// Token: 0x04000D64 RID: 3428
		Error,
		/// <summary>
		///         Данный уровень соответствует информационные события и сообщения, которые не являются ошибками.
		///          Эти события могут помочь ход трассировки или состоянии приложения.
		///       </summary>
		// Token: 0x04000D65 RID: 3429
		Informational = 4,
		/// <summary>
		///         Это значение указывает, что не фильтрация на уровне выполняется во время публикации событий.
		///       </summary>
		// Token: 0x04000D66 RID: 3430
		LogAlways = 0,
		/// <summary>
		///         Данный уровень соответствует длительным событиям или сообщениям.
		///       </summary>
		// Token: 0x04000D67 RID: 3431
		Verbose = 5,
		/// <summary>
		///         Данный уровень соответствует события предупреждения.
		///          Например событие, которое получает опубликован, поскольку диск почти полностью событие является предупреждением.
		///       </summary>
		// Token: 0x04000D68 RID: 3432
		Warning = 3
	}
}
