using System;

namespace System.Diagnostics.Tracing
{
	/// <summary>Определяет уровень события.</summary>
	// Token: 0x020009E7 RID: 2535
	public enum EventLevel
	{
		/// <summary>Никакой фильтрации уровня в событии не выполняется.</summary>
		// Token: 0x040037E9 RID: 14313
		LogAlways,
		/// <summary>Данный уровень соответствует критической ошибке, которая является серьезной ошибкой, вызвавшей серьезную неисправность.</summary>
		// Token: 0x040037EA RID: 14314
		Critical,
		/// <summary>Этот уровень добавляет стандартные ошибки, которые обозначают неполадки.</summary>
		// Token: 0x040037EB RID: 14315
		Error,
		/// <summary>Данный уровень добавляет события предупреждения (например, события, публикуемые при уровне заполнения пространства диска, близком к максимальному).</summary>
		// Token: 0x040037EC RID: 14316
		Warning,
		/// <summary>Данный уровень добавляет информационные события или сообщения, не являющиеся ошибками. Данные события будут полезны при трассировке состояния или хода выполнения приложения.</summary>
		// Token: 0x040037ED RID: 14317
		Informational,
		/// <summary>Данный уровень добавляет длительные события или сообщения. Это приводит к тому, что все события регистрируются.</summary>
		// Token: 0x040037EE RID: 14318
		Verbose
	}
}
