using System;

namespace System.Diagnostics.Tracing
{
	/// <summary>Определяет стандартные ключевые слова, которые применяются к событиям.</summary>
	// Token: 0x020009EB RID: 2539
	[Flags]
	public enum EventKeywords : long
	{
		/// <summary>При публикации события фильтрация по ключевым словам не выполняется.</summary>
		// Token: 0x04003804 RID: 14340
		None = 0L,
		/// <summary>Для всех битов задано значение 1, представляющее каждую возможную группу событий.</summary>
		// Token: 0x04003805 RID: 14341
		All = -1L,
		/// <summary>Вкладывается во все события телеметрии Майкрософт.</summary>
		// Token: 0x04003806 RID: 14342
		MicrosoftTelemetry = 562949953421312L,
		/// <summary>Вкладывается во все контекстные события инфраструктуры диагностики Windows (WDI).</summary>
		// Token: 0x04003807 RID: 14343
		WdiContext = 562949953421312L,
		/// <summary>Вкладывается во все диагностические события инфраструктуры диагностики Windows (WDI).</summary>
		// Token: 0x04003808 RID: 14344
		WdiDiagnostic = 1125899906842624L,
		/// <summary>Вкладывается во все события механизма качества служб (SQM).</summary>
		// Token: 0x04003809 RID: 14345
		Sqm = 2251799813685248L,
		/// <summary>Вкладывается во все неудавшиеся события аудита безопасности. Используйте это ключевое слово только для событий в журнале безопасности.</summary>
		// Token: 0x0400380A RID: 14346
		AuditFailure = 4503599627370496L,
		/// <summary>Вкладывается во все успешные события аудита безопасности. Используйте это ключевое слово только для событий в журнале безопасности.</summary>
		// Token: 0x0400380B RID: 14347
		AuditSuccess = 9007199254740992L,
		/// <summary>Вкладывается во все события перемещения, в которых идентификатор действия (корреляционный идентификатор) является вычисленным значением, и его уникальность не гарантируется (т. е. он не является действительным GUID).</summary>
		// Token: 0x0400380C RID: 14348
		CorrelationHint = 4503599627370496L,
		/// <summary>Вкладывается в события, вызываемые с использованием функции <see langword="RaiseEvent" />.</summary>
		// Token: 0x0400380D RID: 14349
		EventLogClassic = 36028797018963968L
	}
}
