using System;

namespace System.Diagnostics.Tracing
{
	/// <summary>Задает отслеживание событий запуска и остановки действия.</summary>
	// Token: 0x020009E3 RID: 2531
	[Flags]
	public enum EventActivityOptions
	{
		/// <summary>Для отслеживания запуска и остановки используйте поведение по умолчанию.</summary>
		// Token: 0x040037D7 RID: 14295
		None = 0,
		/// <summary>Отключите отслеживание запуска и остановки.</summary>
		// Token: 0x040037D8 RID: 14296
		Disable = 2,
		/// <summary>Разрешить запуски рекурсивных действий. По умолчанию действие не может быть рекурсивным. То есть последовательность "запуск A, запуск A, остановка A, остановка A" не допускается. Если приложение выполняется и остановка не достигнута до вызова другого запуска, могут произойти непреднамеренные рекурсивные действия.</summary>
		// Token: 0x040037D9 RID: 14297
		Recursive = 4,
		/// <summary>Разрешить перекрывающиеся действия. По умолчанию запуски и остановки действия должны иметь вложенные свойства. То есть последовательность "запуск A, запуск B, остановка A, остановка B" не допускается — B остановится в то же время, что и A.</summary>
		// Token: 0x040037DA RID: 14298
		Detachable = 8
	}
}
