using System;

namespace System.Xml
{
	/// <summary>
	///         Описывает порядок узла в документе в сравнении с другим узлом.
	///       </summary>
	// Token: 0x02000240 RID: 576
	public enum XmlNodeOrder
	{
		/// <summary>
		///         Текущий узел этого навигатора находится перед текущим узлом указанного навигатора.
		///       </summary>
		// Token: 0x040012EE RID: 4846
		Before,
		/// <summary>
		///         Текущий узел этого навигатора находится после текущего узла указанного навигатора.
		///       </summary>
		// Token: 0x040012EF RID: 4847
		After,
		/// <summary>
		///         Два навигатора расположены на одном узле.
		///       </summary>
		// Token: 0x040012F0 RID: 4848
		Same,
		/// <summary>
		///         Не удается определить положение узлов в порядке документа, относительно друг друга.
		///          Это может произойти, если два узла находятся в различных деревьях.
		///       </summary>
		// Token: 0x040012F1 RID: 4849
		Unknown
	}
}
