using System;

namespace System.Xml
{
	/// <summary>
	///         Определяет область пространства имен.
	///       </summary>
	// Token: 0x0200023D RID: 573
	public enum XmlNamespaceScope
	{
		/// <summary>
		///         Все пространства имен, определенные в области текущего узла.
		///          Это включает в себя пространство имен xmlns: XML, которое всегда объявляется неявно.
		///          Порядок возвращаемых пространств имен не определен.
		///       </summary>
		// Token: 0x040012DC RID: 4828
		All,
		/// <summary>
		///         Все пространства имен, определенные в области текущего узла, за исключением имен xmlns: XML, которое всегда объявляется неявно.
		///          Порядок возвращаемых пространств имен не определен.
		///       </summary>
		// Token: 0x040012DD RID: 4829
		ExcludeXml,
		/// <summary>
		///         Все пространства имен, определенные локально в текущем узле.
		///       </summary>
		// Token: 0x040012DE RID: 4830
		Local
	}
}
