using System;

namespace System.Configuration
{
	/// <summary>Определяет, какие свойства записываются в файл конфигурации.</summary>
	// Token: 0x0200002F RID: 47
	public enum ConfigurationSaveMode
	{
		/// <summary>Обуславливает запись в файл конфигурации только тех свойств, которые не являются унаследованными значениями.</summary>
		// Token: 0x040000B9 RID: 185
		Minimal = 1,
		/// <summary>Приводит к записи всех свойств в файл конфигурации. Это полезно при создании информационных файлов конфигурации или перемещении значений конфигурации с одного компьютера на другой.</summary>
		// Token: 0x040000BA RID: 186
		Full,
		/// <summary>Обуславливает запись в файл конфигурации только измененных свойств, даже когда значение совпадает с унаследованным.</summary>
		// Token: 0x040000BB RID: 187
		Modified = 0
	}
}
