using System;

namespace System.Configuration
{
	/// <summary>Устанавливает поведение переопределения элемента конфигурации для элементов конфигурации дочерних каталогов.</summary>
	// Token: 0x0200008B RID: 139
	public enum OverrideMode
	{
		/// <summary>Параметры конфигурации элемента или группы могут быть переопределены параметрами конфигурации, являющимися дочерними каталогами.</summary>
		// Token: 0x04000169 RID: 361
		Allow = 1,
		/// <summary>Параметры конфигурации элемента или группы не могут быть переопределены параметрами конфигурации, являющимися дочерними каталогами.</summary>
		// Token: 0x0400016A RID: 362
		Deny,
		/// <summary>Параметр конфигурации элемента или группы будет переопределен параметрами конфигурации, являющимися дочерними каталогами, если явно разрешен родительским элементом текущего элемента конфигурации или группы. Разрешение на переопределение указывается атрибутом <see langword="OverrideMode" />.</summary>
		// Token: 0x0400016B RID: 363
		Inherit = 0
	}
}
