using System;

namespace System.Drawing.Text
{
	/// <summary>Задает качество отрисовки текста.</summary>
	// Token: 0x020000B5 RID: 181
	public enum TextRenderingHint
	{
		/// <summary>Все знаки отображаются с помощью базовых знаков с системным хинтованием, используемым по умолчанию. Текст будет отображен с параметрами сглаживания шрифта, указанными для системы.</summary>
		// Token: 0x04000657 RID: 1623
		SystemDefault,
		/// <summary>Все знаки отображаются с помощью базовых знаков. Хинтование применяется для повышения качества отображения знаков на основных штрихах и изгибах.</summary>
		// Token: 0x04000658 RID: 1624
		SingleBitPerPixelGridFit,
		/// <summary>Все знаки отображаются с помощью базовых знаков. Хинтование отключено.</summary>
		// Token: 0x04000659 RID: 1625
		SingleBitPerPixel,
		/// <summary>Все знаки отображаются с помощью сглаженных базовых знаков с хинтованием. Качество существенно повышается благодаря сглаживанию, но за счет производительности.</summary>
		// Token: 0x0400065A RID: 1626
		AntiAliasGridFit,
		/// <summary>Все знаки отображаются с помощью сглаженных базовых знаков без хинтования. Сглаживание позволяет повысить качество. Поскольку функция хинтования отключена, может быть заметна разница в ширине основных штрихов.</summary>
		// Token: 0x0400065B RID: 1627
		AntiAlias,
		/// <summary>Все знаки отображаются с помощью базовых знаков ClearType с хинтованием. Наилучшее качество. Применяется для раскрытия преимуществ шрифтов ClearType.</summary>
		// Token: 0x0400065C RID: 1628
		ClearTypeGridFit
	}
}
