using System;

namespace System.Net.Cache
{
	/// <summary>Указывает поведение кэширования ресурсов, полученных по протоколу HTTP.</summary>
	// Token: 0x0200078A RID: 1930
	public enum HttpRequestCacheLevel
	{
		/// <summary>Выполняет запрос ресурса с помощью кэшированной копии ресурса или путем отправки запроса ресурса на сервер. Выполняемое действие определяется текущей политикой кэша и временем существования содержимого кэша. Это уровень кэша, который должен использоваться большинством приложений.</summary>
		// Token: 0x040023F4 RID: 9204
		Default,
		/// <summary>Выполняет запрос, используя сервер. Записи не берутся из кэшей, не добавляются в кэши и не удаляются из кэшей между клиентом и сервером. Записи не берутся из кэшей, не добавляются в кэши и не удаляются из кэшей между клиентом и сервером. Таким является поведение кэша по умолчанию, указанное в файле конфигурации компьютера, который поставляется с платформой .NET Framework.</summary>
		// Token: 0x040023F5 RID: 9205
		BypassCache,
		/// <summary>Выполняет запрос, используя ресурс из локального кэша, и не отправляет запрос элемента, которого нет в кэше. Если указан этот уровень политики кэша, в случае отсутствия элемента в клиентском кэше генерируется исключение <see cref="T:System.Net.WebException" />.</summary>
		// Token: 0x040023F6 RID: 9206
		CacheOnly,
		/// <summary>Выполняет запрос ресурса из кэша, если ресурс доступен, в противном случае отправляет запрос ресурса на сервер. Если запрошенный элемент доступен в каком-либо кэше между клиентом к сервером, запрос может быть выполнен промежуточным кэшем.</summary>
		// Token: 0x040023F7 RID: 9207
		CacheIfAvailable,
		/// <summary>Сравнивает копию ресурса в кэше с копией на сервере. Если копия на сервере более свежая, эта копия возвращается в ответ на запрос и записывается в кэш. Если копия в кэше аналогична копии на сервере, возвращается копия из кэша. В протоколе кэширования HTTP для этого используется условный запрос.</summary>
		// Token: 0x040023F8 RID: 9208
		Revalidate,
		/// <summary>Выполняет запрос, используя сервер. Ответ может быть сохранен в кэше. В протоколе кэширования HTTP для этого используется директива управления кэшем no-cache и заголовок <see langword="Pragma" /> no-cache.</summary>
		// Token: 0x040023F9 RID: 9209
		Reload,
		/// <summary>Никогда не выполняет запрос, используя ресурсы из кэша, и не кэширует ресурсы. Если ресурс есть в локальном кэше, он удаляется. Этот уровень политики указывает, что ресурс должен быть удален из промежуточных кэшей. В протоколе кэширования HTTP для этого используется директива управления кэшем no-cache.</summary>
		// Token: 0x040023FA RID: 9210
		NoCacheNoStore,
		/// <summary>Выполняет запрос ресурса из кэша локального компьютера или удаленного кэша локальной сети. Если не удается выполнить запрос, генерируется исключение <see cref="T:System.Net.WebException" />. В протоколе кэширования HTTP для этого используется директива управления кэшем <see langword="only-if-cached" />.</summary>
		// Token: 0x040023FB RID: 9211
		CacheOrNextCacheOnly,
		/// <summary>Выполняет запрос, используя сервер или кэш, отличный от локального. Перед использованием результата из промежуточного кэша в качестве ответа на запрос кэш должен повторно проверить кэшированную запись для этого результата, обратившись к серверу. В протоколе кэширования HTTP для этого используется директива управления кэшем max-age = 0 и заголовок <see langword="Pragma" /> no-cache.</summary>
		// Token: 0x040023FC RID: 9212
		Refresh
	}
}
