using System;

namespace System.Net.Cache
{
	/// <summary>Указывает поведение кэширования ресурсов, полученных с помощью класса <see cref="T:System.Net.WebRequest" /> и производных от него.</summary>
	// Token: 0x02000788 RID: 1928
	public enum RequestCacheLevel
	{
		/// <summary>Выполняет запрос ресурса с помощью кэшированной копии ресурса или путем отправки запроса ресурса на сервер. Выполняемое действие определяется текущей политикой кэша и временем существования содержимого кэша. Это уровень кэша, который должен использоваться большинством приложений.</summary>
		// Token: 0x040023EB RID: 9195
		Default,
		/// <summary>Выполняет запрос, используя сервер. Записи не берутся из кэшей, не добавляются в кэши и не удаляются из кэшей между клиентом и сервером. Таким является поведение кэша по умолчанию, указанное в файле конфигурации компьютера, который поставляется с платформой .NET Framework.</summary>
		// Token: 0x040023EC RID: 9196
		BypassCache,
		/// <summary>Выполняет запрос, используя ресурс из локального кэша, и не отправляет запрос элемента, которого нет в кэше. Если указан этот уровень политики кэша, в случае отсутствия элемента в клиентском кэше генерируется исключение <see cref="T:System.Net.WebException" />.</summary>
		// Token: 0x040023ED RID: 9197
		CacheOnly,
		/// <summary>Выполняет запрос ресурса из кэша, если ресурс доступен, в противном случае отправляет запрос ресурса на сервер. Если запрошенный элемент доступен в каком-либо кэше между клиентом к сервером, запрос может быть выполнен промежуточным кэшем.</summary>
		// Token: 0x040023EE RID: 9198
		CacheIfAvailable,
		/// <summary>Выполняет запрос, используя кэшированную копию ресурса, если метка времени ресурса совпадает с меткой времени ресурса на сервере, в противном случае ресурс загружается с сервера, представляется вызывающему объекту и сохраняется в кэше.</summary>
		// Token: 0x040023EF RID: 9199
		Revalidate,
		/// <summary>Выполняет запрос, используя сервер. Ответ может быть сохранен в кэше. В протоколе кэширования HTTP для этого используется директива управления кэшем <see langword="no-cache" /> и заголовок <see langword="Pragma" /> no-cache.</summary>
		// Token: 0x040023F0 RID: 9200
		Reload,
		/// <summary>Никогда не выполняет запрос, используя ресурсы из кэша, и не кэширует ресурсы. Если ресурс есть в локальном кэше, он удаляется. Этот уровень политики указывает, что ресурс должен быть удален из промежуточных кэшей. В протоколе кэширования HTTP для этого используется директива управления кэшем <see langword="no-cache" />.</summary>
		// Token: 0x040023F1 RID: 9201
		NoCacheNoStore
	}
}
