using System;

namespace System.Collections.Concurrent
{
	/// <summary>Задает параметры для управления поведением буферизации модуля разделения.</summary>
	// Token: 0x02000A67 RID: 2663
	[Flags]
	public enum EnumerablePartitionerOptions
	{
		/// <summary>Используйте поведение умолчанию, при котором должна применяться буферизация для достижения оптимальной производительности.</summary>
		// Token: 0x04003965 RID: 14693
		None = 0,
		/// <summary>Создайте модуль разделения, принимающий элементы из исходного перечисляемого поочередно без промежуточного хранилища, которое может быть более эффективно использовано несколькими потоками. Данный параметр обеспечивает поддержку малой задержки (элементы будут обрабатываться сразу же, как только они становятся доступными из источника) и частичную поддержку зависимостей между элементами (невозможна взаимоблокировка потока при ожидании элемента, за обработку которого отвечает сам этот поток).</summary>
		// Token: 0x04003966 RID: 14694
		NoBuffering = 1
	}
}
