using System;

namespace System.IO
{
	/// <summary>Представляет дополнительные параметры для создания объекта <see cref="T:System.IO.FileStream" />.</summary>
	// Token: 0x02000B09 RID: 2825
	[Flags]
	public enum FileOptions
	{
		/// <summary>Указывает, что при создании объекта <see cref="T:System.IO.FileStream" /> не должны использоваться дополнительные параметры.</summary>
		// Token: 0x04003B3D RID: 15165
		None = 0,
		/// <summary>Указывает, что запись в системе должна выполняться через любой промежуточный кэш и переходить напрямую на диск.</summary>
		// Token: 0x04003B3E RID: 15166
		WriteThrough = -2147483648,
		/// <summary>Указывает, что файл может использоваться для асинхронного чтения и записи.</summary>
		// Token: 0x04003B3F RID: 15167
		Asynchronous = 1073741824,
		/// <summary>Указывается, что доступ к файлу осуществляется произвольно. Система может использовать это в качестве подсказки для оптимизации кэширования файла.</summary>
		// Token: 0x04003B40 RID: 15168
		RandomAccess = 268435456,
		/// <summary>Указывает, что файл автоматически удаляется, если он не будет больше использоваться.</summary>
		// Token: 0x04003B41 RID: 15169
		DeleteOnClose = 67108864,
		/// <summary>Указывает, что доступ к файлу осуществляется последовательно от начала к концу. Система может использовать это в качестве подсказки для оптимизации кэширования файла. Если в приложении указатель позиции в файле перемещается для произвольного доступа, оптимального кэширования можно не достигнуть, однако правильная работа гарантируется.</summary>
		// Token: 0x04003B42 RID: 15170
		SequentialScan = 134217728,
		/// <summary>Указывает, что файл является зашифрованным и может быть расшифрован только с использованием той же учетной записи пользователя, которая применялась для шифрования.</summary>
		// Token: 0x04003B43 RID: 15171
		Encrypted = 16384
	}
}
