using System;

namespace System.IO
{
	/// <summary>Предоставляет атрибуты для файлов и каталогов.</summary>
	// Token: 0x02000B49 RID: 2889
	[Flags]
	public enum FileAttributes
	{
		/// <summary>Файл доступен только для чтения.</summary>
		// Token: 0x04003CC1 RID: 15553
		ReadOnly = 1,
		/// <summary>Файл скрытый и, таким образом, не включается в обычный список каталога.</summary>
		// Token: 0x04003CC2 RID: 15554
		Hidden = 2,
		/// <summary>Файл является системным. То есть файл является частью операционной системы или используется исключительно операционной системой.</summary>
		// Token: 0x04003CC3 RID: 15555
		System = 4,
		/// <summary>Файл является каталогом.</summary>
		// Token: 0x04003CC4 RID: 15556
		Directory = 16,
		/// <summary>Файл выбран для резервного копирования или удаления.</summary>
		// Token: 0x04003CC5 RID: 15557
		Archive = 32,
		/// <summary>Зарезервировано для будущего использования.</summary>
		// Token: 0x04003CC6 RID: 15558
		Device = 64,
		/// <summary>Файл является стандартным файлом без специальных атрибутов. Этот атрибут действителен, только если он используется отдельно.</summary>
		// Token: 0x04003CC7 RID: 15559
		Normal = 128,
		/// <summary>Файл является временным. Временный файл содержит данные, необходимые во время выполнения приложения, но не требуемые после завершения приложения. Файловые системы для ускорения доступа стремятся держать все данные в памяти, а не сбрасывать их обратно на запоминающее устройство. Приложение должно стереть временный файл сразу после того, как он перестанет быть нужным.</summary>
		// Token: 0x04003CC8 RID: 15560
		Temporary = 256,
		/// <summary>Файл является разреженным. Разреженными файлами обычно являются большие файлы, в которых содержатся в основном нулевые данные.</summary>
		// Token: 0x04003CC9 RID: 15561
		SparseFile = 512,
		/// <summary>Файл содержит точку повторной обработки, блокирующую определяемые пользователем данные, связанные с файлом или каталогом.</summary>
		// Token: 0x04003CCA RID: 15562
		ReparsePoint = 1024,
		/// <summary>Файл сжат.</summary>
		// Token: 0x04003CCB RID: 15563
		Compressed = 2048,
		/// <summary>Файл находится в автономном режиме. Данные этого файла недоступны непосредственно.</summary>
		// Token: 0x04003CCC RID: 15564
		Offline = 4096,
		/// <summary>Файл не будет индексироваться службой индексирования содержимого операционной системы.</summary>
		// Token: 0x04003CCD RID: 15565
		NotContentIndexed = 8192,
		/// <summary>Файл или каталог зашифрован. Для файла это означает, что все данные в файле зашифрованы. Для каталога это означает, что шифрование производится по умолчанию для вновь создаваемых файлов и каталогов.</summary>
		// Token: 0x04003CCE RID: 15566
		Encrypted = 16384,
		/// <summary>Файл или каталог включает поддержку целостности данных. Когда это значение применяется к файлу, все потоки данных в этом файле имеют поддержку целостности. Когда это значение применяется к каталогу, все новые файлы и подкаталоги этого каталога по умолчанию включают поддержку целостности.</summary>
		// Token: 0x04003CCF RID: 15567
		IntegrityStream = 32768,
		/// <summary>Файл или каталог исключен из проверки целостности данных. Когда это значение применяется к каталогу, по умолчанию для всех новых файлов и подкаталогов этого каталога поддержка целостности исключается.</summary>
		// Token: 0x04003CD0 RID: 15568
		NoScrubData = 131072
	}
}
