using System;

namespace System.IO
{
	/// <summary>Содержит константы, позволяющие управлять типом доступа, который другие объекты <see cref="T:System.IO.FileStream" /> могут осуществлять к тому же файлу.</summary>
	// Token: 0x02000B0A RID: 2826
	[Flags]
	public enum FileShare
	{
		/// <summary>Отклоняет совместное использование текущего файла. Любой запрос на открытие файла (данным процессом или другим процессом) не выполняется до тех пор, пока файл не будет закрыт.</summary>
		// Token: 0x04003B45 RID: 15173
		None = 0,
		/// <summary>Разрешает последующее открытие файла для чтения. Если этот флаг не задан, любой запрос на открытие файла для чтения (данным процессом или другим процессом) не выполняется до тех пор, пока файл не будет закрыт. Однако, даже если этот флаг задан, для доступа к данному файлу могут потребоваться дополнительные разрешения.</summary>
		// Token: 0x04003B46 RID: 15174
		Read = 1,
		/// <summary>Разрешает последующее открытие файла для записи. Если этот флаг не задан, любой запрос на открытие файла для записи (данным процессом или другим процессом) не выполняется до тех пор, пока файл не будет закрыт. Однако, даже если этот флаг задан, для доступа к данному файлу могут потребоваться дополнительные разрешения.</summary>
		// Token: 0x04003B47 RID: 15175
		Write = 2,
		/// <summary>Разрешает последующее открытие файла для чтения или записи. Если этот флаг не задан, любой запрос на открытие файла для записи или чтения (данным процессом или другим процессом) не выполняется до тех пор, пока файл не будет закрыт. Однако, даже если этот флаг задан, для доступа к данному файлу могут потребоваться дополнительные разрешения.</summary>
		// Token: 0x04003B48 RID: 15176
		ReadWrite = 3,
		/// <summary>Разрешает последующее удаление файла.</summary>
		// Token: 0x04003B49 RID: 15177
		Delete = 4,
		/// <summary>Разрешает наследование дескриптора файла дочерними процессами. В Win32 непосредственная поддержка этого свойства не обеспечена.</summary>
		// Token: 0x04003B4A RID: 15178
		Inheritable = 16
	}
}
