using System;

namespace System.IO
{
	/// <summary>Определяет константы для доступа к файлу для чтения, записи или чтения и записи.</summary>
	// Token: 0x02000B05 RID: 2821
	[Flags]
	public enum FileAccess
	{
		/// <summary>Доступ для чтения файла. Данные можно прочитать из файла. Для получения доступа для чтения и записи необходимо объединить с <see langword="Write" />.</summary>
		// Token: 0x04003B2E RID: 15150
		Read = 1,
		/// <summary>Доступ для записи в файл. Данные можно записать в файл. Для получения доступа для чтения и записи необходимо объединить с <see langword="Read" />.</summary>
		// Token: 0x04003B2F RID: 15151
		Write = 2,
		/// <summary>Доступ для чтения и записи файла. Данные можно записать в файл и прочитать из файла.</summary>
		// Token: 0x04003B30 RID: 15152
		ReadWrite = 3
	}
}
