using System;

namespace System.IO
{
	/// <summary>Указывает, следует ли выполнять поиск в текущем каталоге или в текущем каталоге и всех подкаталогах.</summary>
	// Token: 0x02000B3F RID: 2879
	public enum SearchOption
	{
		/// <summary>Включает в операцию поиска только текущий каталог.</summary>
		// Token: 0x04003C81 RID: 15489
		TopDirectoryOnly,
		/// <summary>Включает текущий каталог и все подкаталоги в операцию поиска. Этот параметр включает в поиск точки повторной обработки, такие как подключенные диски и символические ссылки.</summary>
		// Token: 0x04003C82 RID: 15490
		AllDirectories
	}
}
