using System;

namespace System.Runtime.Versioning
{
	/// <summary>Описывает гарантированную совместимость компонента, типа или члена типа с несколькими версиями.</summary>
	// Token: 0x0200063E RID: 1598
	[Flags]
	public enum ComponentGuaranteesOptions
	{
		/// <summary>Разработчик не гарантирует совместимости с другими версиями. Потребители компонента, типа или члена могут ожидать, что с будущими версиями существующий клиент работать не будет.</summary>
		// Token: 0x040026F2 RID: 9970
		None = 0,
		/// <summary>Разработчик обещает, что тип будет неограниченно совместим с несколькими версиями. Потребители типа могут ожидать, что он будет совместим с будущими версиями, и использовать его во всех интерфейсах. Проблемы с версиями нельзя устранить с помощью параллельного выполнения.</summary>
		// Token: 0x040026F3 RID: 9971
		Exchange = 1,
		/// <summary>Разработчик обещает устойчивую совместимость с другими версиями. Потребители типа могут ожидать, что с будущими версиями существующий клиент будет работать. Но если с будущими версиями возникнут проблемы, а клиент не использовал тип в интерфейсах, исправить проблему можно с помощью параллельного выполнения.</summary>
		// Token: 0x040026F4 RID: 9972
		Stable = 2,
		/// <summary>Была проведена проверка работы компонента при загрузке нескольких версий сборки в один и тот же домен приложения. Будущие версии могут нарушить совместимость. Однако при внесении подобных критических изменений старая версия не изменяется, а продолжает существовать параллельно новой.</summary>
		// Token: 0x040026F5 RID: 9973
		SideBySide = 4
	}
}
