using System;

namespace System.Drawing.Drawing2D
{
	/// <summary>Указывает, каким образом могут быть объединены различные области отсечения.</summary>
	// Token: 0x02000137 RID: 311
	public enum CombineMode
	{
		/// <summary>Одна область отсечения заменяется другой.</summary>
		// Token: 0x04000ABB RID: 2747
		Replace,
		/// <summary>Две области отсечения объединяются путем создания их пересечения.</summary>
		// Token: 0x04000ABC RID: 2748
		Intersect,
		/// <summary>Две области отсечения объединяются путем создания их объединения.</summary>
		// Token: 0x04000ABD RID: 2749
		Union,
		/// <summary>Две области отсечения объединяются путем взятия только областей, заключенных в одну или в другую область, но не в обе.</summary>
		// Token: 0x04000ABE RID: 2750
		Xor,
		/// <summary>Указывает, что существующая область заменяется результатом удаления новой области из существующей области. Иначе говоря, новая область исключается из существующей области.</summary>
		// Token: 0x04000ABF RID: 2751
		Exclude,
		/// <summary>Указывает, что существующая область заменяется результатом удаления существующей области из новой области. Иначе говоря, существующая область исключается из новой области.</summary>
		// Token: 0x04000AC0 RID: 2752
		Complement
	}
}
