using System;

namespace System.Drawing.Drawing2D
{
	/// <summary>Указывает систему для использования при обработке координат.</summary>
	// Token: 0x0200013A RID: 314
	public enum CoordinateSpace
	{
		/// <summary>Указывает на то, что координаты находятся в мировом контексте координат. Мировые координаты используются в нефизическом окружении, например в среде моделирования.</summary>
		// Token: 0x04000ACC RID: 2764
		World,
		/// <summary>Указывает на то, что координаты находятся в контексте координат страницы. Их единицы измерения определяются свойством <see cref="P:System.Drawing.Graphics.PageUnit" /> и они должны являться одним из элементов перечисления <see cref="T:System.Drawing.GraphicsUnit" />.</summary>
		// Token: 0x04000ACD RID: 2765
		Page,
		/// <summary>Указывает на то, что координаты находятся в контексте координат устройства. На экране компьютера координаты устройства обычно измеряются в пикселях.</summary>
		// Token: 0x04000ACE RID: 2766
		Device
	}
}
