using System;

namespace System.Drawing.Drawing2D
{
	/// <summary>Указывает, завершаются (очищаются) ли команды в графическом стеке немедленно или выполняются как можно быстрее.</summary>
	// Token: 0x0200013F RID: 319
	public enum FlushIntention
	{
		/// <summary>Указывает на то, что стек всех графических операций очищается немедленно.</summary>
		// Token: 0x04000ADF RID: 2783
		Flush,
		/// <summary>Указывает на то, что все графические операции в стеке выполняются как можно быстрее. Это синхронизирует графическое состояние.</summary>
		// Token: 0x04000AE0 RID: 2784
		Sync
	}
}
