using System;

namespace System.Drawing.Drawing2D
{
	/// <summary>Определяет, как соединить последовательных сегменты линий или кривых в фигуре (субконтуре), содержащемся в объекте <see cref="T:System.Drawing.Drawing2D.GraphicsPath" />.</summary>
	// Token: 0x02000146 RID: 326
	public enum LineJoin
	{
		/// <summary>Задает угловое соединение со скосом в 45 градусов. В результате получается острый или обрезанный угол в зависимости от того, превышает ли длина среза ограничение по срезу.</summary>
		// Token: 0x04000B33 RID: 2867
		Miter,
		/// <summary>Задает скошенное соединение. В результате получается угол при диагонали.</summary>
		// Token: 0x04000B34 RID: 2868
		Bevel,
		/// <summary>Задает круговое соединение. В результате получается ровная круговая дуга между двумя линиями.</summary>
		// Token: 0x04000B35 RID: 2869
		Round,
		/// <summary>Задает угловое соединение со скосом в 45 градусов. В результате получается острый или срезанный угол в зависимости от того, превышает ли длина среза ограничение по срезу.</summary>
		// Token: 0x04000B36 RID: 2870
		MiterClipped
	}
}
