using System;

namespace System.Threading.Tasks
{
	/// <summary>Задает флаги, которые управляют необязательным поведением создания и выполнения задач.</summary>
	// Token: 0x02000361 RID: 865
	[Flags]
	public enum TaskCreationOptions
	{
		/// <summary>Указывает, что следует использовать поведение по умолчанию.</summary>
		// Token: 0x04001D06 RID: 7430
		None = 0,
		/// <summary>Рекомендация для <see cref="T:System.Threading.Tasks.TaskScheduler" /> для планирования задач максимально прямым способом, то есть задачи, запланированные ранее, будут выполняться ранее, а более поздние — позднее.</summary>
		// Token: 0x04001D07 RID: 7431
		PreferFairness = 1,
		/// <summary>Указывает, что задача будет выполняться долго в качестве общей операции, включающей еще несколько компонентов, по размеру превышающих детализированные системы. Предоставляет сведения для <see cref="T:System.Threading.Tasks.TaskScheduler" />, что следует ожидать избыточной подписки. Превышение лимита подписки позволяет создать больше потоков, чем количество доступных аппаратных потоков. Он также подсказывает планировщику задач, что для задачи может потребоваться дополнительный поток, чтобы она не блокировала дальнейший ход работы других потоков или рабочих элементов в локальной очереди пула потоков.</summary>
		// Token: 0x04001D08 RID: 7432
		LongRunning = 2,
		/// <summary>Указывает, что задача присоединена к родительской задаче в иерархии задач. По умолчанию дочерняя задача (это внутренняя задача, создаваемая внешней задачей) выполняется независимо от своей родительской задачи. Вы можете воспользоваться параметром <see cref="F:System.Threading.Tasks.TaskContinuationOptions.AttachedToParent" />, чтобы синхронизировать родительские и дочерние задачи.  
		/// Обратите внимание, что если родительская задача настроена с параметром <see cref="F:System.Threading.Tasks.TaskCreationOptions.DenyChildAttach" />, параметр <see cref="F:System.Threading.Tasks.TaskCreationOptions.AttachedToParent" /> в дочерней задаче не действует, и эта дочерняя задача будет выполняться как отсоединенная.  
		/// Дополнительные сведения см. в разделе Присоединенные и отсоединенные дочерние задачи.</summary>
		// Token: 0x04001D09 RID: 7433
		AttachedToParent = 4,
		/// <summary>Указывает, что любая дочерняя задача, для которой выполняется попытка выполнения в качестве подсоединенной дочерней задачи (т. е. она создается с параметром <see cref="F:System.Threading.Tasks.TaskCreationOptions.AttachedToParent" />), не сможет подключиться к родительской задаче и будет выполняться как отсоединенная дочерняя задача. Дополнительные сведения см. в разделе Присоединенные и отсоединенные дочерние задачи.</summary>
		// Token: 0x04001D0A RID: 7434
		DenyChildAttach = 8,
		/// <summary>Не позволяет видеть внешний планировщик как текущий планировщик в созданной задаче. Это означает, что такие операции, как StartNew или ContinueWith, которые выполняются в созданной задаче, в качестве текущего планировщика будут видеть свойство <see cref="P:System.Threading.Tasks.TaskScheduler.Default" />.</summary>
		// Token: 0x04001D0B RID: 7435
		HideScheduler = 16,
		/// <summary>Принудительное асинхронное выполнение продолжений, добавляемых в текущую задачу.  
		/// Обратите внимание, что элемент <see cref="F:System.Threading.Tasks.TaskCreationOptions.RunContinuationsAsynchronously" /> доступен в перечислении <see cref="T:System.Threading.Tasks.TaskCreationOptions" />, начиная с .NET Framework 4.6.</summary>
		// Token: 0x04001D0C RID: 7436
		RunContinuationsAsynchronously = 64
	}
}
