using System;
using System.Runtime.InteropServices;

namespace System.Drawing
{
	/// <summary>Определяет, как цвет источника в операции копирования пикселя объединяется с цветом назначения для получения окончательного цвета.</summary>
	// Token: 0x0200006A RID: 106
	[ComVisible(true)]
	public enum CopyPixelOperation
	{
		/// <summary>Область назначения заполняется цветом, связанным с индексом 0 в физической палитре. (Черный цвет для физической палитры по умолчанию).</summary>
		// Token: 0x04000464 RID: 1124
		Blackness = 66,
		/// <summary>Окна, расположенные слоями в верхней части окна, включаются в создаваемое изображение. По умолчанию изображение содержит только текущее окно. Обратите внимание, что обычно это нельзя использовать для контекста устройств печати.</summary>
		// Token: 0x04000465 RID: 1125
		CaptureBlt = 1073741824,
		/// <summary>Область назначения инвертируется.</summary>
		// Token: 0x04000466 RID: 1126
		DestinationInvert = 5570569,
		/// <summary>Цвета области источника объединяются с цветами выбранной кисти целевого устройства с помощью логического оператора <see langword="AND" />.</summary>
		// Token: 0x04000467 RID: 1127
		MergeCopy = 12583114,
		/// <summary>Цвета инвертированной области источника объединяются с цветами области назначения с помощью логического оператора <see langword="OR" />.</summary>
		// Token: 0x04000468 RID: 1128
		MergePaint = 12255782,
		/// <summary>Точечный рисунок не отражается.</summary>
		// Token: 0x04000469 RID: 1129
		NoMirrorBitmap = -2147483648,
		/// <summary>Инвертированная область источника копируется в область назначения.</summary>
		// Token: 0x0400046A RID: 1130
		NotSourceCopy = 3342344,
		/// <summary>Цвета источника и назначения объединяются логическим оператором <see langword="OR" />, и полученный цвет инвертируется.</summary>
		// Token: 0x0400046B RID: 1131
		NotSourceErase = 1114278,
		/// <summary>В точечный рисунок назначения копируется кисть, выбранная в данный момент в контексте устройства назначения.</summary>
		// Token: 0x0400046C RID: 1132
		PatCopy = 15728673,
		/// <summary>Цвета кисти, выбранной в данный момент в контексте устройства назначения, объединяются с цветами назначения с помощью логического оператора <see langword="XOR" />.</summary>
		// Token: 0x0400046D RID: 1133
		PatInvert = 5898313,
		/// <summary>Цвета кисти, выбранной в данный момент в контексте устройства назначения, объединяются с цветами инвертированной области источника с помощью логического оператора <see langword="OR" />. Результат этой операции объединяется с цветами области назначения с помощью логического оператора <see langword="OR" />.</summary>
		// Token: 0x0400046E RID: 1134
		PatPaint = 16452105,
		/// <summary>Цвета областей источника и назначения объединяются с помощью логического оператора <see langword="AND" />.</summary>
		// Token: 0x0400046F RID: 1135
		SourceAnd = 8913094,
		/// <summary>Область источника копируется прямо в область назначения.</summary>
		// Token: 0x04000470 RID: 1136
		SourceCopy = 13369376,
		/// <summary>Инвертированные цвета области назначения объединяются с цветами области источника с помощью логического оператора <see langword="AND" />.</summary>
		// Token: 0x04000471 RID: 1137
		SourceErase = 4457256,
		/// <summary>Цвета областей источника и назначения объединяются с помощью логического оператора <see langword="XOR" />.</summary>
		// Token: 0x04000472 RID: 1138
		SourceInvert = 6684742,
		/// <summary>Цвета областей источника и назначения объединяются с помощью логического оператора <see langword="OR" />.</summary>
		// Token: 0x04000473 RID: 1139
		SourcePaint = 15597702,
		/// <summary>Целевая область заполняется цветом, связанным с индексом 1 в физической палитре. (Белый цвет для физической палитры по умолчанию.)</summary>
		// Token: 0x04000474 RID: 1140
		Whiteness = 16711778
	}
}
