using System;

namespace System.Drawing
{
	/// <summary>Задает величину поворота изображения и ось для зеркального отражения рисунка.</summary>
	// Token: 0x02000039 RID: 57
	public enum RotateFlipType
	{
		/// <summary>Задает отсутствие поворота по часовой стрелке и зеркального отражения.</summary>
		// Token: 0x04000345 RID: 837
		RotateNoneFlipNone,
		/// <summary>Задает поворот на 90 градусов по часовой стрелке без зеркального отражения.</summary>
		// Token: 0x04000346 RID: 838
		Rotate90FlipNone,
		/// <summary>Задает поворот на 180 градусов по часовой стрелке без зеркального отражения.</summary>
		// Token: 0x04000347 RID: 839
		Rotate180FlipNone,
		/// <summary>Задает поворот на 270 градусов по часовой стрелке без зеркального отражения.</summary>
		// Token: 0x04000348 RID: 840
		Rotate270FlipNone,
		/// <summary>Задает отсутствие поворота по часовой стрелке с последующим зеркальным отражением по горизонтали.</summary>
		// Token: 0x04000349 RID: 841
		RotateNoneFlipX,
		/// <summary>Задает поворот на 90 градусов по часовой стрелке с последующим зеркальным отражением по горизонтали.</summary>
		// Token: 0x0400034A RID: 842
		Rotate90FlipX,
		/// <summary>Задает поворот на 180 градусов по часовой стрелке с последующим зеркальным отражением по горизонтали.</summary>
		// Token: 0x0400034B RID: 843
		Rotate180FlipX,
		/// <summary>Задает поворот на 270 градусов по часовой стрелке с последующим зеркальным отражением по горизонтали.</summary>
		// Token: 0x0400034C RID: 844
		Rotate270FlipX,
		/// <summary>Задает отсутствие поворота по часовой стрелке с последующим зеркальным отражением по вертикали.</summary>
		// Token: 0x0400034D RID: 845
		RotateNoneFlipY = 6,
		/// <summary>Задает поворот на 90 градусов по часовой стрелке с последующим зеркальным отражением по вертикали.</summary>
		// Token: 0x0400034E RID: 846
		Rotate90FlipY,
		/// <summary>Задает поворот на 180 градусов по часовой стрелке с последующим зеркальным отражением по вертикали.</summary>
		// Token: 0x0400034F RID: 847
		Rotate180FlipY = 4,
		/// <summary>Задает поворот на 270 градусов по часовой стрелке с последующим зеркальным отражением по вертикали.</summary>
		// Token: 0x04000350 RID: 848
		Rotate270FlipY,
		/// <summary>Задает отсутствие поворота по часовой стрелке с последующим зеркальным отражением по горизонтали и по вертикали.</summary>
		// Token: 0x04000351 RID: 849
		RotateNoneFlipXY = 2,
		/// <summary>Задает поворот на 90 градусов по часовой стрелке с последующим зеркальным отражением по горизонтали и по вертикали.</summary>
		// Token: 0x04000352 RID: 850
		Rotate90FlipXY,
		/// <summary>Задает поворот на 180 градусов по часовой стрелке с последующим зеркальным отражением по горизонтали и по вертикали.</summary>
		// Token: 0x04000353 RID: 851
		Rotate180FlipXY = 0,
		/// <summary>Задает поворот на 270 градусов по часовой стрелке с последующим зеркальным отражением по горизонтали и по вертикали.</summary>
		// Token: 0x04000354 RID: 852
		Rotate270FlipXY
	}
}
