using System;

namespace System.Drawing
{
	/// <summary>Указывает, как удалить знаки из строки, которая не полностью помещается в форму структуры.</summary>
	// Token: 0x0200003E RID: 62
	public enum StringTrimming
	{
		/// <summary>Указывает на отсутствие обрезки.</summary>
		// Token: 0x0400036B RID: 875
		None,
		/// <summary>Указывает, что текст обрезается по ближайшему знаку.</summary>
		// Token: 0x0400036C RID: 876
		Character,
		/// <summary>Указывает, что текст обрезается по ближайшему слову.</summary>
		// Token: 0x0400036D RID: 877
		Word,
		/// <summary>Указывает, что текст обрезается по ближайшему знаку и в конце обрезанной строки вставляется троеточие.</summary>
		// Token: 0x0400036E RID: 878
		EllipsisCharacter,
		/// <summary>Указывает, что текст обрезается по ближайшему слову и в конце обрезанной строки вставляется троеточие.</summary>
		// Token: 0x0400036F RID: 879
		EllipsisWord,
		/// <summary>Из обрезанных строк удаляется центральная часть и заменяется троеточием. Этот алгоритм позволяет сохранить максимально возможную часть отделенного косой чертой последнего сегмента строки.</summary>
		// Token: 0x04000370 RID: 880
		EllipsisPath
	}
}
