using System;

namespace System.Drawing
{
	/// <summary>Определяет выравнивание строки текста относительно прямоугольника размещения.</summary>
	// Token: 0x0200003B RID: 59
	public enum StringAlignment
	{
		/// <summary>Определяет, что текст выравнивается по ближнему краю. При размещении слева направо ближним краем будет левый. При размещении справа налево ближним краем будет правый.</summary>
		// Token: 0x04000358 RID: 856
		Near,
		/// <summary>Определяет, что текст выравнивается по центру прямоугольника размещения.</summary>
		// Token: 0x04000359 RID: 857
		Center,
		/// <summary>Определяет, что текст выравнивается по дальнему краю от исходного положения прямоугольника размещения. При размещении слева направо дальним положением будет правое. При размещении справа налево дальним положением будет левое.</summary>
		// Token: 0x0400035A RID: 858
		Far
	}
}
