using System;

namespace System.Drawing
{
	/// <summary>Указывает сведения об отображении и размещении строк текста.</summary>
	// Token: 0x0200003D RID: 61
	[Flags]
	public enum StringFormatFlags
	{
		/// <summary>Отображает текст справа налево.</summary>
		// Token: 0x04000361 RID: 865
		DirectionRightToLeft = 1,
		/// <summary>Текст выравнивается по вертикали.</summary>
		// Token: 0x04000362 RID: 866
		DirectionVertical = 2,
		/// <summary>Частям символов разрешается выступать за границы прямоугольника строки. По умолчанию положение символов изменяется во избежание какого-либо выступа.</summary>
		// Token: 0x04000363 RID: 867
		FitBlackBox = 4,
		/// <summary>Управляющие символы, такие как метка слева направо, показываются в выходных данных с помощью характерного глифа.</summary>
		// Token: 0x04000364 RID: 868
		DisplayFormatControl = 32,
		/// <summary>Переход к альтернативным шрифтам для знаков, не поддерживаемых в требуемом шрифте, отключен. Все недостающие символы отображаются с помощью глифа отсутствия шрифтов, обычно пустого квадрата.</summary>
		// Token: 0x04000365 RID: 869
		NoFontFallback = 1024,
		/// <summary>Вставляет замыкающий пробел в конце каждой строки. По умолчанию ограничивающий прямоугольник, возвращаемый методом <see cref="Overload:System.Drawing.Graphics.MeasureString" />, исключает пробелы в конце каждой строки. Установите этот флаг, чтобы включить в результат измерения эти пробелы.</summary>
		// Token: 0x04000366 RID: 870
		MeasureTrailingSpaces = 2048,
		/// <summary>Автоматический перенос на новую строку при форматировании в прямоугольнике отключен. Этот флаг означает передачу точки вместо прямоугольника или нулевую длину строки указанного прямоугольника.</summary>
		// Token: 0x04000367 RID: 871
		NoWrap = 4096,
		/// <summary>В прямоугольнике форматирования размещаются только целые строки. По умолчанию форматирование продолжается либо до конца текста, либо до того места, после которого в результате усечения отсутствуют видимые строки. Следует иметь в виду, что стандартные параметры разрешают частично скрывать последнюю строку в прямоугольнике форматирования, высота которого не кратна высоте строки. Чтобы отображались только целые строки, задайте это значение, не забыв предусмотреть, чтобы высота прямоугольника форматирования была не меньше высоты одной строки.</summary>
		// Token: 0x04000368 RID: 872
		LineLimit = 8192,
		/// <summary>Разрешается отображать выступающие части глифов и текст, выходящий за пределы прямоугольной зоны форматирования. По умолчанию весь текст и части глифов, выступающие за границы прямоугольника форматирования, отсекаются.</summary>
		// Token: 0x04000369 RID: 873
		NoClip = 16384
	}
}
