using System;

namespace System.Text.RegularExpressions
{
	/// <summary>Предоставляет перечисленные значения для использования при задании параметров регулярных выражений.</summary>
	// Token: 0x02000208 RID: 520
	[Flags]
	public enum RegexOptions
	{
		/// <summary>Указывает на отсутствие заданных параметров. Дополнительные сведения о поведении по умолчанию обработчика регулярных выражений см. в подразделе "Параметры по умолчанию" раздела Параметры регулярных выражений.</summary>
		// Token: 0x04000938 RID: 2360
		None = 0,
		/// <summary>Указывает соответствие, не учитывающее регистр. Дополнительные сведения см. в подразделе "Сопоставление без учета регистра" раздела Параметры регулярных выражений.</summary>
		// Token: 0x04000939 RID: 2361
		IgnoreCase = 1,
		/// <summary>Многострочный режим. Изменяет значение символов "^" и "$" так, что они совпадают, соответственно, в начале и конце любой строки, а не только в начале и конце целой строки. Дополнительные сведения см. в подразделе "Многострочный режим" раздела Параметры регулярных выражений.</summary>
		// Token: 0x0400093A RID: 2362
		Multiline = 2,
		/// <summary>Указывает, что единственные допустимые записи являются явно именованными или нумерованными группами в форме (?&lt;name&gt;...). Это позволяет использовать неименованные круглые скобки в качестве незахватываемых групп, тем самым не допуская синтаксической громоздкости выражения (?:...). Дополнительные сведения см. в подразделе "Только явные захваты" раздела Параметры регулярных выражений.</summary>
		// Token: 0x0400093B RID: 2363
		ExplicitCapture = 4,
		/// <summary>Указывает, что регулярное выражение скомпилировано в сборку. Это порождает более быстрое исполнение, но увеличивает время запуска. Это значение не должно назначаться свойству <see cref="P:System.Text.RegularExpressions.RegexCompilationInfo.Options" /> при обращении к методу <see cref="M:System.Text.RegularExpressions.Regex.CompileToAssembly(System.Text.RegularExpressions.RegexCompilationInfo[],System.Reflection.AssemblyName)" />. Дополнительные сведения см. в подразделе "Скомпилированные регулярные выражения" раздела Параметры регулярных выражений.</summary>
		// Token: 0x0400093C RID: 2364
		Compiled = 8,
		/// <summary>Указывает однострочный режим. Изменяет значение точки (.) так, что она соответствует любому символу (вместо любого символа, кроме "\n"). Дополнительные сведения см. в подразделе "Однострочный режим" раздела Параметры регулярных выражений.</summary>
		// Token: 0x0400093D RID: 2365
		Singleline = 16,
		/// <summary>Устраняет из шаблона неизбежные пробелы и включает комментарии, помеченные "#". Однако это значение не затрагивает и не устраняет пробелы в классах символов, числовых квантификаторах или токенах, отмечающих начало отдельных языковых элементов регулярных выражений. Дополнительные сведения см. в подразделе "Пропуск пробелов" раздела Параметры регулярных выражений.</summary>
		// Token: 0x0400093E RID: 2366
		IgnorePatternWhitespace = 32,
		/// <summary>Указывает, что поиск будет выполнен в направлении справа налево, а не слева направо. Дополнительные сведения см. в подразделе "Режим справа налево" раздела Параметры регулярных выражений.</summary>
		// Token: 0x0400093F RID: 2367
		RightToLeft = 64,
		/// <summary>Включает ECMAScript-совместимое поведение для выражения. Это значение может быть использовано только вместе со значениями <see cref="F:System.Text.RegularExpressions.RegexOptions.IgnoreCase" />, <see cref="F:System.Text.RegularExpressions.RegexOptions.Multiline" /> и <see cref="F:System.Text.RegularExpressions.RegexOptions.Compiled" />. Использование этого значения вместе с любыми другими приводит к исключению.  
		/// Дополнительные сведения о параметре <see cref="F:System.Text.RegularExpressions.RegexOptions.ECMAScript" /> см. в подразделе "Поведение сопоставления ECMAScript" раздела Параметры регулярных выражений.</summary>
		// Token: 0x04000940 RID: 2368
		ECMAScript = 256,
		/// <summary>Указывает игнорирование региональных языковых различий. Дополнительные сведения см. в подразделе "Сравнение с использованием инвариантного языка и региональных параметров" раздела Параметры регулярных выражений.</summary>
		// Token: 0x04000941 RID: 2369
		CultureInvariant = 512
	}
}
