using System;

namespace System.Net.Sockets
{
	/// <summary>Указывает коды управления вводом-выводом, поддерживаемые методом <see cref="M:System.Net.Sockets.Socket.IOControl(System.Int32,System.Byte[],System.Byte[])" />.</summary>
	// Token: 0x020007A6 RID: 1958
	public enum IOControlCode : long
	{
		/// <summary>Включает получение уведомлений при ожидании получения данных. Это значение равно константе FIOASYNC спецификации Winsock 2.</summary>
		// Token: 0x040024B2 RID: 9394
		AsyncIO = 2147772029L,
		/// <summary>Управляет блокирующим режимом сокета. Если аргумент, указанный этим управляющим кодом равен нулю, сокет находится в блокирующем режиме. Если аргумент не равен нулю, сокет находится в неблокирующем режиме. Это значение равно константе FIONBIO спецификации Winsock 2.</summary>
		// Token: 0x040024B3 RID: 9395
		NonBlockingIO,
		/// <summary>Возвращает количество байтов, доступных для чтения. Это значение равно константе FIONREAD спецификации Winsock 2.</summary>
		// Token: 0x040024B4 RID: 9396
		DataToRead = 1074030207L,
		/// <summary>Возвращает сведения о находящихся за пределом диапазона данных, которые должны быть получены. Когда этот управляющий код используется для потока сокетов, возвращаемое значение указывает количество доступных данных.</summary>
		// Token: 0x040024B5 RID: 9397
		OobDataRead = 1074033415L,
		/// <summary>Связывает этот сокет с указанным дескриптором сопутствующего интерфейса. Дополнительные сведения о соответствующей протоколу приставке см. в справочнике по интерфейсу Winsock 2 или в документации по конкретному сопутствующему интерфейсу. Рекомендуется использовать модель COM вместо этой функции IOCTL для обнаружения и отслеживания других интерфейсов, которые могут поддерживаться сокетом. Этот управляющий код предназначен для обратной совместимости с системами, в которых модель COM недоступна или по каким-либо причинам не может быть использована. Это значение равно константе SIO_ASSOCIATE_HANDLE спецификации Winsock 2.</summary>
		// Token: 0x040024B6 RID: 9398
		AssociateHandle = 2281701377L,
		/// <summary>Заменяет дольше всех находящуюся в очереди датаграмму входящей датаграммой, когда очередь входящих сообщений заполнена. Это значение равно константе SIO_ENABLE_CIRCULAR_QUEUEING спецификации Winsock 2.</summary>
		// Token: 0x040024B7 RID: 9399
		EnableCircularQueuing = 671088642L,
		/// <summary>Удаляет содержимое очереди отправки. Это значение равно константе SIO_FLUSH спецификации Winsock 2.</summary>
		// Token: 0x040024B8 RID: 9400
		Flush = 671088644L,
		/// <summary>Возвращает структуру SOCKADDR, содержащую адрес широковещательной рассылки для семейства адресов текущего сокета. Возвращаемый адрес можно использовать с методом <see cref="Overload:System.Net.Sockets.Socket.SendTo" />. Это значение равно константе SIO_GET_BROADCAST_ADDRESS спецификации Winsock 2. Это значение может быть использовано только сокетами UDP.</summary>
		// Token: 0x040024B9 RID: 9401
		GetBroadcastAddress = 1207959557L,
		/// <summary>Получите специфичную для поставщика функцию, не входящую в состав спецификации Winsock. Функции указаны с использованием идентификатора GUID, назначенного поставщиком. Это значение равно константе SIO_GET_EXTENSION_FUNCTION_POINTER спецификации Winsock 2.</summary>
		// Token: 0x040024BA RID: 9402
		GetExtensionFunctionPointer = 3355443206L,
		/// <summary>Возвращает структуру QOS, связанную с сокетом. Этот элемент управления поддерживается только на платформах, которые предоставляют транспорт, совместимый с QOS (Windows Me, Windows 2000 и операционные системы более поздних версий.) Это значение равно константе SIO_GET_QOS спецификации Winsock 2.</summary>
		// Token: 0x040024BB RID: 9403
		GetQos,
		/// <summary>Возвращает атрибуты качества обслуживания (QOS) для группы сокетов. Это значение зарезервировано для использования в будущем и равно константе SIO_GET_GROUP_QOS спецификации Winsock 2.</summary>
		// Token: 0x040024BC RID: 9404
		GetGroupQos,
		/// <summary>Указывает, должны ли появляться данные многоадресной рассылки, отправленные сокетом, как входные данные в приемной очереди сокетов. Это значение равно константе SIO_MULTIPOINT_LOOPBACK спецификации Winsock 2.</summary>
		// Token: 0x040024BD RID: 9405
		MultipointLoopback = 2281701385L,
		/// <summary>Управляет количеством пересылок пакета многоадресной рассылки, которое может быть выполнено маршрутизатором; также называемом сроком жизни или количеством прыжков. Это значение равно константе SIO_MULTICAST_SCOPE спецификации Winsock 2.</summary>
		// Token: 0x040024BE RID: 9406
		MulticastScope,
		/// <summary>Задает атрибуты качества обслуживания (QOS) для сокета. Качество обслуживания определяет требования к пропускной способности сокета. Этот управляющий код поддерживается в Windows Me, Windows 2000 и более поздних операционных системах. Это значение равно константе SIO_SET_QOS спецификации Winsock 2.</summary>
		// Token: 0x040024BF RID: 9407
		SetQos,
		/// <summary>Задает атрибуты качества обслуживания (QOS) для группы сокетов. Это значение зарезервировано для использования в будущем и равно константе SIO_SET_GROUP_QOS спецификации Winsock 2.</summary>
		// Token: 0x040024C0 RID: 9408
		SetGroupQos,
		/// <summary>Возвращает дескриптор для сокета, являющегося допустимым в контексте сопутствующего интерфейса. Это значение равно константе SIO_TRANSLATE_HANDLE спецификации Winsock 2.</summary>
		// Token: 0x040024C1 RID: 9409
		TranslateHandle = 3355443213L,
		/// <summary>Возвращает адреса интерфейсов, которые могут использоваться для подключения к указанному удаленному адресу. Это значение равно константе SIO_ROUTING_INTERFACE_QUERY спецификации Winsock 2.</summary>
		// Token: 0x040024C2 RID: 9410
		RoutingInterfaceQuery = 3355443220L,
		/// <summary>Включает получение уведомлений при изменении локального интерфейса, используемого для доступа к удаленной конечной точке. Это значение равно константе SIO_ROUTING_INTERFACE_CHANGE спецификации Winsock 2.</summary>
		// Token: 0x040024C3 RID: 9411
		RoutingInterfaceChange = 2281701397L,
		/// <summary>Возвращает список локальных интерфейсов, к которым может быть привязан сокет. Этот управляющий код поддерживается в Windows 2000 и более поздних операционных системах. Это значение равно константе SIO_ADDRESS_LIST_QUERY спецификации Winsock 2.</summary>
		// Token: 0x040024C4 RID: 9412
		AddressListQuery = 1207959574L,
		/// <summary>Включает получение уведомлений при изменении списка локальных интерфейсов для семейства протоколов сокета. Этот управляющий код поддерживается в Windows 2000 и более поздних операционных системах. Это значение равно константе SIO_ADDRESS_LIST_CHANGE спецификации Winsock 2.</summary>
		// Token: 0x040024C5 RID: 9413
		AddressListChange = 671088663L,
		/// <summary>Получает дескриптор SOCKET основного поставщика. Этот дескриптор может быть использован для получения уведомления о событии Plug-and-Play. Этот управляющий код поддерживается в Windows 2000 и более поздних операционных системах. Это значение равно константе SIO_QUERY_TARGET_PNP_HANDLE спецификации Winsock 2.</summary>
		// Token: 0x040024C6 RID: 9414
		QueryTargetPnpHandle = 1207959576L,
		/// <summary>Указывает, должны ли сокеты получать уведомление, когда запрос пространства имен становится недопустимым. Этот управляющий код поддерживается в Windows XP и более поздних операционных системах. Это значение равно константе SIO_NSP_NOTIFY_LIST_CHANGE спецификации Winsock 2.</summary>
		// Token: 0x040024C7 RID: 9415
		NamespaceChange = 2281701401L,
		/// <summary>Сортирует структуру, возвращаемую полем <see cref="F:System.Net.Sockets.IOControlCode.AddressListQuery" /> и добавляет сведения об области идентификаторов для IPv6-адресов. Этот управляющий код поддерживается в Windows XP и более поздних операционных системах. Это значение равно константе SIO_ADDRESS_LIST_SORT спецификации Winsock 2.</summary>
		// Token: 0x040024C8 RID: 9416
		AddressListSort = 3355443225L,
		/// <summary>Включает получение всех сетевых IPv4-пакетов. У сокета должно быть семейство адресов <see cref="F:System.Net.Sockets.AddressFamily.InterNetwork" />, типом сокета должно быть <see cref="F:System.Net.Sockets.SocketType.Raw" />, а типом протокола должен быть <see cref="F:System.Net.Sockets.ProtocolType.IP" />. Текущий пользователь должен быть участником группы администраторов на локальном компьютере, а сокет должен принадлежать определенному порту. Этот управляющий код поддерживается в Windows 2000 и более поздних операционных системах. Это значение равно константе SIO_RCVALL спецификации Winsock 2.</summary>
		// Token: 0x040024C9 RID: 9417
		ReceiveAll = 2550136833L,
		/// <summary>Включает получение всех сетевых IPv4-пакетов многоадресной рассылки. У этих пакетов адреса назначения находятся в диапазоне от 224.0.0.0 до 239.255.255.255. У сокета должно быть семейство адресов <see cref="F:System.Net.Sockets.AddressFamily.InterNetwork" />, типом сокета должно быть <see cref="F:System.Net.Sockets.SocketType.Raw" />, а типом протокола должен быть <see cref="F:System.Net.Sockets.ProtocolType.Udp" />. Текущий пользователь должен быть участником группы администраторов на локальном компьютере, а сокет должен принадлежать определенному порту. Этот управляющий код поддерживается в Windows 2000 и более поздних операционных системах. Это значение равно константе SIO_RCVALL_MCAST спецификации Winsock 2.</summary>
		// Token: 0x040024CA RID: 9418
		ReceiveAllMulticast,
		/// <summary>Включает получение всех сетевых IGMP-пакетов. У сокета должно быть семейство адресов <see cref="F:System.Net.Sockets.AddressFamily.InterNetwork" />, типом сокета должно быть <see cref="F:System.Net.Sockets.SocketType.Raw" />, а типом протокола должен быть <see cref="F:System.Net.Sockets.ProtocolType.Igmp" />. Текущий пользователь должен быть участником группы администраторов на локальном компьютере, а сокет должен принадлежать определенному порту. Этот управляющий код поддерживается в Windows 2000 и более поздних операционных системах. Это значение равно константе SIO_RCVALL_IGMPMCAST спецификации Winsock 2.</summary>
		// Token: 0x040024CB RID: 9419
		ReceiveAllIgmpMulticast,
		/// <summary>Управляет отправкой TCP-пакетов проверки на активность и интервалом времени, с которым они посылаются. Этот управляющий код поддерживается в Windows 2000 и более поздних операционных системах. Дополнительные сведения см. в разделе 4.2.3.6 стандарта RFC 1122. Это значение равно константе SIO_KEEPALIVE_VALS спецификации Winsock 2.</summary>
		// Token: 0x040024CC RID: 9420
		KeepAliveValues,
		/// <summary>Это значение равно константе SIO_ABSORB_RTRALERT спецификации Winsock 2.</summary>
		// Token: 0x040024CD RID: 9421
		AbsorbRouterAlert,
		/// <summary>Задает интерфейс, используемый для исходящих пакетов одноадресной передачи. Это значение равно константе SIO_UCAST_IF спецификации Winsock 2.</summary>
		// Token: 0x040024CE RID: 9422
		UnicastInterface,
		/// <summary>Это значение равно константе SIO_LIMIT_BROADCASTS спецификации Winsock 2.</summary>
		// Token: 0x040024CF RID: 9423
		LimitBroadcasts,
		/// <summary>Привязывает сокет к указанному индексу интерфейса. Этот управляющий код поддерживается в Windows 2000 и более поздних операционных системах. Это значение равно константе SIO_INDEX_BIND спецификации Winsock 2.</summary>
		// Token: 0x040024D0 RID: 9424
		BindToInterface,
		/// <summary>Задает интерфейс, используемый для исходящих пакетов многоадресной рассылки. Интерфейс идентифицируется своим индексом. Этот управляющий код поддерживается в Windows 2000 и более поздних операционных системах.  Это значение равно константе SIO_INDEX_MCASTIF спецификации Winsock 2.</summary>
		// Token: 0x040024D1 RID: 9425
		MulticastInterface,
		/// <summary>Присоединяет к группе многоадресной рассылки с помощью интерфейса, определенного его индексом. Этот управляющий код поддерживается в Windows 2000 и более поздних операционных системах. Это значение равно константе SIO_INDEX_ADD_MCAST спецификации Winsock 2.</summary>
		// Token: 0x040024D2 RID: 9426
		AddMulticastGroupOnInterface,
		/// <summary>Удаляет сокет из группы многоадресной рассылки. Этот управляющий код поддерживается в Windows 2000 и более поздних операционных системах. Это значение равно константе SIO_INDEX_ADD_MCAST спецификации Winsock 2.</summary>
		// Token: 0x040024D3 RID: 9427
		DeleteMulticastGroupFromInterface
	}
}
