using System;

namespace System.Net.Sockets
{
	/// <summary>Значение, позволяющее ограничивать сокет IPv6 указанным диапазоном, например адресами с одинаковой локальной ссылкой или локальным префиксом сайта.</summary>
	// Token: 0x020007A8 RID: 1960
	public enum IPProtectionLevel
	{
		/// <summary>Уровень защиты IP — не указано. В Windows 7 и Windows Server 2008 R2 и значение по умолчанию для уровня защиты IP сокета — не указано.</summary>
		// Token: 0x040024D7 RID: 9431
		Unspecified = -1,
		/// <summary>Уровень защиты IP — неограниченно. Это значение используется приложениями, разработанными для работы в Интернете, включая приложения, использующие возможности обхода IPv6 NAT, включенные в Windows (например, Teredo). Эти приложения могут обходить брандмауэры протокола IPv4, поэтому они должны быть защищены от атак из Интернета, направленных на открытый порт. В Windows Server 2008 R2 и Windows Vista значение по умолчанию для уровня защиты IP сокета — неограниченно.</summary>
		// Token: 0x040024D8 RID: 9432
		Unrestricted = 10,
		/// <summary>Уровень защиты IP — предельно ограничено. Это значение используется приложениями, разработанными для работы в Интернете. Этот параметр не позволяет обойти механизм преобразования сетевых адресов (NAT) с помощью реализации Windows Teredo. Эти приложения могут обходить брандмауэры протокола IPv4, поэтому они должны быть защищены от атак из Интернета, направленных на открытый порт. В Windows Server 2003 и Windows XP значение по умолчанию для уровня защиты IP сокета — предельно ограничено.</summary>
		// Token: 0x040024D9 RID: 9433
		EdgeRestricted = 20,
		/// <summary>Уровень защиты IP — ограничено. Это значение используется приложениями интрасети, не работающих в Интернете. Эти приложения обычно не тестируются и не защищаются против атак из Интернета. Этот параметр ограничивает получаемый трафик локальным.</summary>
		// Token: 0x040024DA RID: 9434
		Restricted = 30
	}
}
