using System;

namespace System.Runtime.InteropServices.ComTypes
{
	/// <summary>Указывает целевую платформу операционной системы.</summary>
	// Token: 0x020007CB RID: 1995
	[Serializable]
	public enum SYSKIND
	{
		/// <summary>Целевая операционная система для библиотеки типов — 16-разрядные системы Windows. Поля данных по умолчанию упакованы.</summary>
		// Token: 0x04002D04 RID: 11524
		SYS_WIN16,
		/// <summary>Целевая операционная система для библиотеки типов — 32-разрядные системы Windows. Поля данных по умолчанию выровнены естественным образом (например, 2-байтовые целые числа выровнены по границам четных байтов, 4-байтовые целые числа — по границам четырехбайтовых слов и т. д.).</summary>
		// Token: 0x04002D05 RID: 11525
		SYS_WIN32,
		/// <summary>Целевая операционная система для библиотеки типов — Apple Macintosh. По умолчанию все поля данных выравниваются по границам четных байтов.</summary>
		// Token: 0x04002D06 RID: 11526
		SYS_MAC,
		/// <summary>Целевая операционная система для библиотеки типов — 64-разрядные системы Windows.</summary>
		// Token: 0x04002D07 RID: 11527
		SYS_WIN64
	}
}
