using System;

namespace Microsoft.Win32
{
	/// <summary>Определяет идентификаторы событий режима питания, о которых сообщает операционная система.</summary>
	// Token: 0x02000121 RID: 289
	public enum PowerModes
	{
		/// <summary>Операционная система готова выйти из приостановленного состояния.</summary>
		// Token: 0x040004CF RID: 1231
		Resume = 1,
		/// <summary>Событие уведомления о состоянии режима питания было вызвано операционной системой. Оно может указывать на слабый заряд батареи или ее зарядку, на переход от питания переменного тока к питанию от батареи или на другие изменения статуса источника питания системы.</summary>
		// Token: 0x040004D0 RID: 1232
		StatusChange,
		/// <summary>Операционная система готова приостановить работу.</summary>
		// Token: 0x040004D1 RID: 1233
		Suspend
	}
}
