using System;

namespace Microsoft.Win32
{
	/// <summary>Определяет идентификаторы, представляющие категории пользовательских параметров.</summary>
	// Token: 0x0200012D RID: 301
	public enum UserPreferenceCategory
	{
		/// <summary>Показывает пользовательские параметры, связанные со средствами специальных возможностей, предназначенных для пользователей с ограниченными возможностями.</summary>
		// Token: 0x040004E7 RID: 1255
		Accessibility = 1,
		/// <summary>Показывает пользовательские параметры, связанные с системными цветами. Эта категория включает, такие параметры, как цвета по умолчанию для окон и меню.</summary>
		// Token: 0x040004E8 RID: 1256
		Color,
		/// <summary>Показывает пользовательские параметры, связанные с системным рабочим столом. Эта категория включает фоновое изображение или макет фонового изображения для рабочего стола.</summary>
		// Token: 0x040004E9 RID: 1257
		Desktop,
		/// <summary>Показывает пользовательские параметры, которые не связаны ни с какой другой категорией.</summary>
		// Token: 0x040004EA RID: 1258
		General,
		/// <summary>Показывает пользовательские параметры для настроек значков, включая их высоту и расположение.</summary>
		// Token: 0x040004EB RID: 1259
		Icon,
		/// <summary>Показывает пользовательские параметры для настроек клавиатуры, таких как частота и задержка повтора при нажатой клавише.</summary>
		// Token: 0x040004EC RID: 1260
		Keyboard,
		/// <summary>Показывает пользовательские параметры для настроек меню, таких как задержки меню и выравнивание текста.</summary>
		// Token: 0x040004ED RID: 1261
		Menu,
		/// <summary>Показывает пользовательские параметры для настроек мыши, таких как время двойного щелчка и чувствительность мыши.</summary>
		// Token: 0x040004EE RID: 1262
		Mouse,
		/// <summary>Показывает пользовательские параметры для настроек политик, таких как права пользователя и уровни доступа.</summary>
		// Token: 0x040004EF RID: 1263
		Policy,
		/// <summary>Показывает пользовательские параметры для настроек системного питания. В эту категорию входят параметры питания, такие как время простоя перед тем, как система автоматически переходит в режим низкого электропотребления.</summary>
		// Token: 0x040004F0 RID: 1264
		Power,
		/// <summary>Показывает пользовательские параметры, связанные с экранной заставкой.</summary>
		// Token: 0x040004F1 RID: 1265
		Screensaver,
		/// <summary>Показывает пользовательские параметры, связанные с размерами и характеристиками окон системы.</summary>
		// Token: 0x040004F2 RID: 1266
		Window,
		/// <summary>Показывает изменения пользовательских параметров для региональных параметров, таких как кодировка символов и строки сведений о региональных настройках.</summary>
		// Token: 0x040004F3 RID: 1267
		Locale,
		/// <summary>Показывает пользовательские параметры, связанные с визуальными стилями, такие как включение или отключение визуальных стилей и переключение от одного стиля к другому.</summary>
		// Token: 0x040004F4 RID: 1268
		VisualStyle
	}
}
