using System;

namespace System.Transactions
{
	/// <summary>Указывает уровень изоляции транзакции.</summary>
	// Token: 0x02000019 RID: 25
	public enum IsolationLevel
	{
		/// <summary>Во время обработки транзакции переменные данные могут считываться, но не могут изменяться. Добавление новых данных невозможно.</summary>
		// Token: 0x0400003C RID: 60
		Serializable,
		/// <summary>Во время обработки транзакции переменные данные могут считываться, но не могут изменяться. В ходе транзакции возможно добавление новых данных.</summary>
		// Token: 0x0400003D RID: 61
		RepeatableRead,
		/// <summary>Во время обработки транзакции переменные данные не могут считываться, но могут изменяться.</summary>
		// Token: 0x0400003E RID: 62
		ReadCommitted,
		/// <summary>Во время обработки транзакции переменные данные могут считываться и изменяться.</summary>
		// Token: 0x0400003F RID: 63
		ReadUncommitted,
		/// <summary>Переменные данные могут считываться. Перед тем, как транзакция изменяет данные, она проверяет, не изменены ли данные другой транзакцией после их первоначального считывания. Если данные обновлены, возникает ошибка. Это позволяет транзакции получить значение данных, зафиксированное ранее.</summary>
		// Token: 0x04000040 RID: 64
		Snapshot,
		/// <summary>Ожидающие изменения более изолированных транзакций не могут быть перезаписаны.</summary>
		// Token: 0x04000041 RID: 65
		Chaos,
		/// <summary>Используется уровень изоляции, отличный от указанного, однако этот уровень не может быть определен. При задании этого значения вызывается исключение.</summary>
		// Token: 0x04000042 RID: 66
		Unspecified
	}
}
