using System;

namespace System.Transactions
{
	/// <summary>Предоставляет дополнительные параметры для создания области транзакций.</summary>
	// Token: 0x0200002B RID: 43
	public enum TransactionScopeOption
	{
		/// <summary>Транзакция запрашивается областью. Она использует внешнюю транзакцию, если таковая уже существует. В противном случае до ввода области создается новая транзакция. Это значение по умолчанию.</summary>
		// Token: 0x04000077 RID: 119
		Required,
		/// <summary>Для области всегда создается новая транзакция.</summary>
		// Token: 0x04000078 RID: 120
		RequiresNew,
		/// <summary>При создании области контекст внешней транзакции подавляется. Все операции в рамках области выполняются без контекста внешней транзакции.</summary>
		// Token: 0x04000079 RID: 121
		Suppress
	}
}
