using System;

namespace System.Security.AccessControl
{
	/// <summary>Определяет тип выполняемого изменения управления доступом. Это перечисление используется методами класса <see cref="T:System.Security.AccessControl.ObjectSecurity" /> и производных классов.</summary>
	// Token: 0x02000500 RID: 1280
	public enum AccessControlModification
	{
		/// <summary>Добавить указанное правило авторизации к списку управления доступом.</summary>
		// Token: 0x040023FE RID: 9214
		Add,
		/// <summary>Удалить все правила авторизации из списка управления доступом, после чего добавить в список управления доступом указанное правило авторизации.</summary>
		// Token: 0x040023FF RID: 9215
		Set,
		/// <summary>Удалить правила авторизации, содержащие ИД безопасности, как у указанного правила авторизации, из списка управления доступом, после чего добавить в список управления доступом указанное правило авторизации.</summary>
		// Token: 0x04002400 RID: 9216
		Reset,
		/// <summary>Удалить правила авторизации, содержащие ИД безопасности и маску доступа, как у указанного правила авторизации, из списка управления доступом.</summary>
		// Token: 0x04002401 RID: 9217
		Remove,
		/// <summary>Удалить правила авторизации, содержащие ИД безопасности, как у указанного правила авторизации, из списка управления доступом.</summary>
		// Token: 0x04002402 RID: 9218
		RemoveAll,
		/// <summary>Удалить правила авторизации, в точности совпадающие с указанным правилом авторизации, из списка управления доступом.</summary>
		// Token: 0x04002403 RID: 9219
		RemoveSpecific
	}
}
