using System;

namespace System.Security.AccessControl
{
	/// <summary>Определяет доступные типы элементов управления доступом.</summary>
	// Token: 0x02000508 RID: 1288
	public enum AceType : byte
	{
		/// <summary>Разрешает доступ к объекту для конкретного доверенного лица, определяемого объектом <see cref="T:System.Security.Principal.IdentityReference" />.</summary>
		// Token: 0x04002422 RID: 9250
		AccessAllowed,
		/// <summary>Запрещает доступ к объекту для конкретного доверенного лица, определяемого объектом <see cref="T:System.Security.Principal.IdentityReference" />.</summary>
		// Token: 0x04002423 RID: 9251
		AccessDenied,
		/// <summary>Вызывает регистрацию сообщения аудита, когда указанное доверенное лицо пытается получить доступ к объекту. Доверенное лицо определяется объектом <see cref="T:System.Security.Principal.IdentityReference" />.</summary>
		// Token: 0x04002424 RID: 9252
		SystemAudit,
		/// <summary>Зарезервировано для будущего использования.</summary>
		// Token: 0x04002425 RID: 9253
		SystemAlarm,
		/// <summary>Определено, но никогда не используется. Указано для полноты представления информации.</summary>
		// Token: 0x04002426 RID: 9254
		AccessAllowedCompound,
		/// <summary>Разрешает доступ к объекту, набору свойств или свойству. Такой элемент управления доступом содержит набор прав доступа, идентификатор GUID, определяющий тип объекта, а также объект <see cref="T:System.Security.Principal.IdentityReference" />, который определяет доверенное лицо, получающее доступ. Кроме того, этот элемент содержит GUID и набор флагов, определяющих параметры наследования элемента управления доступом дочерними объектами.</summary>
		// Token: 0x04002427 RID: 9255
		AccessAllowedObject,
		/// <summary>Запрещает доступ к объекту, набору свойств или свойству. Такой элемент управления доступом содержит набор прав доступа, идентификатор GUID, определяющий тип объекта, а также объект <see cref="T:System.Security.Principal.IdentityReference" />, который определяет доверенное лицо, получающее доступ. Кроме того, этот элемент содержит GUID и набор флагов, определяющих параметры наследования элемента управления доступом дочерними объектами.</summary>
		// Token: 0x04002428 RID: 9256
		AccessDeniedObject,
		/// <summary>Вызывает регистрацию сообщения аудита, когда указанное доверенное лицо пытается получить доступ к объекту или его составляющим, например к свойству или набору свойств. Такой элемент управления доступом содержит набор прав доступа, идентификатор GUID, определяющий тип объекта или его составляющих, а также объект <see cref="T:System.Security.Principal.IdentityReference" />, который определяет доверенное лицо, доступ которого подлежит аудиту. Кроме того, этот элемент содержит GUID и набор флагов, определяющих параметры наследования элемента управления доступом дочерними объектами.</summary>
		// Token: 0x04002429 RID: 9257
		SystemAuditObject,
		/// <summary>Зарезервировано для будущего использования.</summary>
		// Token: 0x0400242A RID: 9258
		SystemAlarmObject,
		/// <summary>Разрешает доступ к объекту для конкретного доверенного лица, определяемого объектом <see cref="T:System.Security.Principal.IdentityReference" />. Элемент управления доступом этого типа может содержать необязательные данные обратного вызова. Данные обратного вызова представляют собой определяемый диспетчером ресурсов и неинтерпретируемый большой двоичный объект.</summary>
		// Token: 0x0400242B RID: 9259
		AccessAllowedCallback,
		/// <summary>Запрещает доступ к объекту для конкретного доверенного лица, определяемого объектом <see cref="T:System.Security.Principal.IdentityReference" />. Элемент управления доступом этого типа может содержать необязательные данные обратного вызова. Данные обратного вызова представляют собой определяемый диспетчером ресурсов и неинтерпретируемый большой двоичный объект.</summary>
		// Token: 0x0400242C RID: 9260
		AccessDeniedCallback,
		/// <summary>Разрешает доступ к объекту, набору свойств или свойству. Такой элемент управления доступом содержит набор прав доступа, идентификатор GUID, определяющий тип объекта, а также объект <see cref="T:System.Security.Principal.IdentityReference" />, который определяет доверенное лицо, получающее доступ. Кроме того, этот элемент содержит GUID и набор флагов, определяющих параметры наследования элемента управления доступом дочерними объектами. Элемент управления доступом этого типа может содержать необязательные данные обратного вызова. Данные обратного вызова представляют собой определяемый диспетчером ресурсов и неинтерпретируемый большой двоичный объект.</summary>
		// Token: 0x0400242D RID: 9261
		AccessAllowedCallbackObject,
		/// <summary>Запрещает доступ к объекту, набору свойств или свойству. Такой элемент управления доступом содержит набор прав доступа, идентификатор GUID, определяющий тип объекта, а также объект <see cref="T:System.Security.Principal.IdentityReference" />, который определяет доверенное лицо, получающее доступ. Кроме того, этот элемент содержит GUID и набор флагов, определяющих параметры наследования элемента управления доступом дочерними объектами. Элемент управления доступом этого типа может содержать необязательные данные обратного вызова. Данные обратного вызова представляют собой определяемый диспетчером ресурсов и неинтерпретируемый большой двоичный объект.</summary>
		// Token: 0x0400242E RID: 9262
		AccessDeniedCallbackObject,
		/// <summary>Вызывает регистрацию сообщения аудита, когда указанное доверенное лицо пытается получить доступ к объекту. Доверенное лицо определяется объектом <see cref="T:System.Security.Principal.IdentityReference" />. Элемент управления доступом этого типа может содержать необязательные данные обратного вызова. Данные обратного вызова представляют собой определяемый диспетчером ресурсов и неинтерпретируемый большой двоичный объект.</summary>
		// Token: 0x0400242F RID: 9263
		SystemAuditCallback,
		/// <summary>Зарезервировано для будущего использования.</summary>
		// Token: 0x04002430 RID: 9264
		SystemAlarmCallback,
		/// <summary>Вызывает регистрацию сообщения аудита, когда указанное доверенное лицо пытается получить доступ к объекту или его составляющим, например к свойству или набору свойств. Такой элемент управления доступом содержит набор прав доступа, идентификатор GUID, определяющий тип объекта или его составляющих, а также объект <see cref="T:System.Security.Principal.IdentityReference" />, который определяет доверенное лицо, доступ которого подлежит аудиту. Кроме того, этот элемент содержит GUID и набор флагов, определяющих параметры наследования элемента управления доступом дочерними объектами. Элемент управления доступом этого типа может содержать необязательные данные обратного вызова. Данные обратного вызова представляют собой определяемый диспетчером ресурсов и неинтерпретируемый большой двоичный объект.</summary>
		// Token: 0x04002431 RID: 9265
		SystemAuditCallbackObject,
		/// <summary>Зарезервировано для будущего использования.</summary>
		// Token: 0x04002432 RID: 9266
		SystemAlarmCallbackObject,
		/// <summary>Максимальный определенный тип элемента управления доступом в перечислении.</summary>
		// Token: 0x04002433 RID: 9267
		MaxDefinedAceType = 16
	}
}
