using System;

namespace System.Security.AccessControl
{
	/// <summary>Определяет порядок распространения действия элементов управления доступом на дочерние объекты.  Эти флаги имеют значение лишь в том случае, когда имеются флаги наследования.</summary>
	// Token: 0x02000543 RID: 1347
	[Flags]
	public enum PropagationFlags
	{
		/// <summary>Указывает, что флаги наследования не установлены.</summary>
		// Token: 0x040024D1 RID: 9425
		None = 0,
		/// <summary>Указывает, что элемент управления доступом не распространяется на дочерние объекты.</summary>
		// Token: 0x040024D2 RID: 9426
		NoPropagateInherit = 1,
		/// <summary>Указывает, что элемент управления доступом распространяется только на дочерние объекты. К ним относятся контейнеры и конечные дочерние объекты.</summary>
		// Token: 0x040024D3 RID: 9427
		InheritOnly = 2
	}
}
