using System;

namespace System.IO.Ports
{
	/// <summary>Определяет протокол управления, который организует связь с последовательным портом для объекта <see cref="T:System.IO.Ports.SerialPort" />.</summary>
	// Token: 0x0200052A RID: 1322
	public enum Handshake
	{
		/// <summary>Для подтверждения соединения протоколы управления не используются.</summary>
		// Token: 0x04001705 RID: 5893
		None,
		/// <summary>Используется протокол программного управления XON/XOFF. Для прекращения передачи данных посылается код XOFF. Для возобновления передачи посылается код XON. Эти программные управляющие коды используются вместо аппаратных управляющих сигналов RTS (запрос передачи) и CTS (готовность к приему).</summary>
		// Token: 0x04001706 RID: 5894
		XOnXOff,
		/// <summary>Используется аппаратное управление потоком передачи с помощью сигналов запроса передачи (RTS). RTS сигнализирует о наличии данных, предназначенных для передачи. При переполнении входного буфера линия RTS устанавливается в положение <see langword="false" />. Линия RTS устанавливается в положение <see langword="true" />, как только во входном буфере увеличивается свободное место.</summary>
		// Token: 0x04001707 RID: 5895
		RequestToSend,
		/// <summary>Используется как аппаратный контроль RTS, так и программный контроль XON/XOFF.</summary>
		// Token: 0x04001708 RID: 5896
		RequestToSendXOnXOff
	}
}
