using System;

namespace System.IO.Ports
{
	/// <summary>Указывает тип изменения, произошедшего с объектом <see cref="T:System.IO.Ports.SerialPort" />.</summary>
	// Token: 0x02000530 RID: 1328
	public enum SerialPinChange
	{
		/// <summary>Изменилось состояние сигнала готовности к приему (CTS). Этот сигнал используется для того, чтобы показать, что данные можно передавать через последовательный порт.</summary>
		// Token: 0x0400171A RID: 5914
		CtsChanged = 8,
		/// <summary>Изменилось состояние сигнала готовности данных (DSR). Этот сигнал используется для того, чтобы показать, что устройство, подключенное к последовательному порту, готово к работе.</summary>
		// Token: 0x0400171B RID: 5915
		DsrChanged = 16,
		/// <summary>Изменилось состояние сигнала обнаружения несущей (CD). Этот сигнал используется для того, чтобы показать, что модем подключен к рабочей телефонной линии и в ней обнаружен сигнал несущей частоты.</summary>
		// Token: 0x0400171C RID: 5916
		CDChanged = 32,
		/// <summary>Обнаружен разрыв на входе.</summary>
		// Token: 0x0400171D RID: 5917
		Break = 64,
		/// <summary>Обнаружен индикатор вызова.</summary>
		// Token: 0x0400171E RID: 5918
		Ring = 256
	}
}
