using System;

namespace System.Drawing.Design
{
	/// <summary>Задает идентификаторы, которые определяют значение стиля редактирования объекта <see cref="T:System.Drawing.Design.UITypeEditor" />.</summary>
	// Token: 0x02000130 RID: 304
	public enum UITypeEditorEditStyle
	{
		/// <summary>Интерактивные компоненты пользовательского интерфейса не предоставляются.</summary>
		// Token: 0x04000AA5 RID: 2725
		None = 1,
		/// <summary>Отображает кнопку с многоточием (...) для вызова модального диалогового окна, в котором запрашивается ввод пользователем данных перед продолжением выполнения программы или немодального диалогового окна, которое остается открытым и может использоваться в любое время, не блокируя другие действия пользователя.</summary>
		// Token: 0x04000AA6 RID: 2726
		Modal,
		/// <summary>Отображают кнопку раскрывающегося списка и содержит пользовательский интерфейс поле раскрывающегося списка.</summary>
		// Token: 0x04000AA7 RID: 2727
		DropDown
	}
}
