using System;

namespace System.Runtime.InteropServices.ComTypes
{
	/// <summary>Указывает, какой аспект данных или представления объекта требуется при рисовании или получении данных.</summary>
	// Token: 0x02000189 RID: 393
	[Flags]
	public enum DVASPECT
	{
		/// <summary>Представление объекта, позволяющее отображать объект в виде внедренного объекта внутри контейнера. Это значение обычно задается для объектов составных документов. Представление может использоваться для экрана или принтера.</summary>
		// Token: 0x040006FC RID: 1788
		DVASPECT_CONTENT = 1,
		/// <summary>Представление эскиза объекта, позволяющее отображать этот объект в средствах просмотра. Эскиз представляет собой аппаратно-независимый точечный рисунок, приблизительно 120 на 120 пикселей, 16 цветов (рекомендуется), возможно, помещенный в метафайл.</summary>
		// Token: 0x040006FD RID: 1789
		DVASPECT_THUMBNAIL = 2,
		/// <summary>Символическое представление объекта.</summary>
		// Token: 0x040006FE RID: 1790
		DVASPECT_ICON = 4,
		/// <summary>Представление объекта на экране выглядит так же, как при печати на принтере с помощью команды Печать в меню Файл. Описываемые данные могут представлять последовательность страниц.</summary>
		// Token: 0x040006FF RID: 1791
		DVASPECT_DOCPRINT = 8
	}
}
