using System;

namespace System.Security.Authentication.ExtendedProtection
{
	/// <summary>Перечисление <see cref="T:System.Security.Authentication.ExtendedProtection.ProtectionScenario" /> указывает сценарий защиты, регламентированный политикой.</summary>
	// Token: 0x020002A9 RID: 681
	public enum ProtectionScenario
	{
		/// <summary>Транспорт выберет безопасный или обычный сценарий защиты в зависимости от типа используемого канала. Для сценария безопасной защиты встроенная проверка подлинности Windows заключается в безопасный канал и содержит в точности совпадающий токен привязки канала без проверки имени поставщика услуг (SPN). Для сценария обычной защиты встроенная проверка подлинности Windows заключается в безопасный канал (необязательно) и содержит необязательный токен привязки канала с обязательной проверкой имени поставщика услуг (SPN). Если запрос проходит по безопасному каналу, проверяется токен привязки канала (CBT); в противном случае проверяется SPN.</summary>
		// Token: 0x04000BFE RID: 3070
		TransportSelected,
		/// <summary>Встроенная проверка подлинности Windows заключается в безопасный канал, оканчивающийся доверенным прокси, и содержит токен привязки канала с обязательной проверкой имени поставщика услуг (SPN). Этот сценарий требует присутствия CBT, но CBT, в отличие от SPN, не проверяется.</summary>
		// Token: 0x04000BFF RID: 3071
		TrustedProxy
	}
}
