using System;

namespace System.Net.NetworkInformation
{
	/// <summary>Указывает текущее состояние IP-адреса.</summary>
	// Token: 0x020006DC RID: 1756
	public enum DuplicateAddressDetectionState
	{
		/// <summary>Недопустимый адрес. У недопустимого адреса истек срок действия и он больше не назначен интерфейсу. Приложения не должны отправлять данные на этот адрес.</summary>
		// Token: 0x0400214C RID: 8524
		Invalid,
		/// <summary>Оценка процедуры обнаружения повторяющихся адресов не была успешно завершена. Этот адрес не должен использоваться приложениями, потому что он еще недопустим и отправляемые на него пакеты удаляются.</summary>
		// Token: 0x0400214D RID: 8525
		Tentative,
		/// <summary>Адрес не является уникальным. Этот адрес не должен назначаться сетевому интерфейсу.</summary>
		// Token: 0x0400214E RID: 8526
		Duplicate,
		/// <summary>Адрес действителен, но его срок аренды истекает и он не должен использоваться приложениями.</summary>
		// Token: 0x0400214F RID: 8527
		Deprecated,
		/// <summary>Адрес действителен и может использоваться без ограничений.</summary>
		// Token: 0x04002150 RID: 8528
		Preferred
	}
}
