using System;

namespace System.Net.NetworkInformation
{
	/// <summary>Сообщает о состоянии отправки сообщения проверки связи ICMP на компьютер.</summary>
	// Token: 0x020006E9 RID: 1769
	public enum IPStatus
	{
		/// <summary>Запрос проверки связи ICMP выполнен успешно. Получен ответ за запрос проверки связи ICMP. Если получено это состояние, значит остальные свойства объекта <see cref="T:System.Net.NetworkInformation.PingReply" /> содержат допустимые данные.</summary>
		// Token: 0x04002172 RID: 8562
		Success,
		/// <summary>Не удалось выполнить запрос проверки связи ICMP из-за недоступности сети, в которой находится конечный компьютер.</summary>
		// Token: 0x04002173 RID: 8563
		DestinationNetworkUnreachable = 11002,
		/// <summary>Не удалось выполнить запрос проверки связи ICMP из-за недоступности конечного компьютера.</summary>
		// Token: 0x04002174 RID: 8564
		DestinationHostUnreachable,
		/// <summary>Не удалось выполнить запрос проверки связи ICMP из-за недоступности компьютера назначения, указанного в сообщении проверки связи ICMP, поскольку он не поддерживает протокол, по которому передается пакет. Это значение применимо только к IPv4. Это значение описано в IETF RFC 1812 как "Связь административно запрещена".</summary>
		// Token: 0x04002175 RID: 8565
		DestinationProtocolUnreachable,
		/// <summary>Не удалось выполнить запрос проверки связи ICMP из-за недоступности порта на конечном компьютере.</summary>
		// Token: 0x04002176 RID: 8566
		DestinationPortUnreachable,
		/// <summary>Не удалось выполнить запрос проверки связи ICMPv6 из-за административного запрета связи с конечным компьютером. Это значение применимо только к IPv6.</summary>
		// Token: 0x04002177 RID: 8567
		DestinationProhibited = 11004,
		/// <summary>Не удалось выполнить запрос проверки связи ICMP из-за нехватки сетевых ресурсов.</summary>
		// Token: 0x04002178 RID: 8568
		NoResources = 11006,
		/// <summary>Не удалось выполнить запрос проверки связи ICMP из-за наличия в нем недопустимого параметра.</summary>
		// Token: 0x04002179 RID: 8569
		BadOption,
		/// <summary>Не удалось выполнить запрос проверки связи ICMP из-за аппаратной ошибки.</summary>
		// Token: 0x0400217A RID: 8570
		HardwareError,
		/// <summary>Не удалось выполнить запрос проверки связи ICMP из-за того, что размер пакета с запросом превышает MTU узла (маршрутизатора или шлюза), расположенного между отправителем и получателем. MTU определяет максимальный размер передаваемого пакета.</summary>
		// Token: 0x0400217B RID: 8571
		PacketTooBig,
		/// <summary>Ответ на запрос проверки связи ICMP не был получен за отведенное время. Значение допустимого времени ожидания ответа по умолчанию — 5 секунд. Это значение можно изменить с помощью метода <see cref="Overload:System.Net.NetworkInformation.Ping.Send" /> или <see cref="Overload:System.Net.NetworkInformation.Ping.SendAsync" />, использующего параметр <paramref name="timeout" />.</summary>
		// Token: 0x0400217C RID: 8572
		TimedOut,
		/// <summary>Не удалось выполнить запрос проверки связи ICMP из-за отсутствия допустимого маршрута между компьютером-источником и конечным компьютером.</summary>
		// Token: 0x0400217D RID: 8573
		BadRoute = 11012,
		/// <summary>Не удалось выполнить запрос проверки связи ICMP из-за того, что срок жизни пакета стал равным нулю, в следствие чего он был удален маршрутищирующим узелом (маршрутизатором или шлюзом).</summary>
		// Token: 0x0400217E RID: 8574
		TtlExpired,
		/// <summary>Не удалось выполнить запрос проверки связи ICMP из-за того, что для передачи пакет был разбит на фрагменты, не все из которых были получены за отведенное время для повторной сборки. В стандарте RFC 2460 (доступном по адресу www.ietf.org) предельное время, за которое должны быть получены все фрагменты пакета, составляет 60 секунд.</summary>
		// Token: 0x0400217F RID: 8575
		TtlReassemblyTimeExceeded,
		/// <summary>Не удалось выполнить запрос проверки связи ICMP из-за проблем, возникших на узле (маршрутизаторе или шлюзе) при обработке заголовка пакета. Такое состояние возникает, например, если в заголовке содержатся недопустимые данные полей или нераспознанный параметр.</summary>
		// Token: 0x04002180 RID: 8576
		ParameterProblem,
		/// <summary>Не удалось выполнить запрос проверки связи ICMP из-за того, что пакет был удален. Это происходит, если в очереди вывода компьютера-источника недостаточно места для хранения или если пакеты приходят к получателю слишком быстро, чтобы успеть их обработать.</summary>
		// Token: 0x04002181 RID: 8577
		SourceQuench,
		/// <summary>Сбой запроса проверки связи ICMP произошел из-за того, что IP-адрес назначения не может получить запросы проверки связи ICMP или не должен указываться в поле адреса назначения любых IP-датаграмм. Например, это состояние будет возвращено, если вызвать метод <see cref="Overload:System.Net.NetworkInformation.Ping.Send" />, указав IP-адрес "000.0.0.0".</summary>
		// Token: 0x04002182 RID: 8578
		BadDestination = 11018,
		/// <summary>Не удалось выполнить запрос проверки связи ICMP из-за недоступности компьютера назначения, указанного в сообщении проверки связи ICMP. Точная причина проблемы неизвестна.</summary>
		// Token: 0x04002183 RID: 8579
		DestinationUnreachable = 11040,
		/// <summary>Не удалось выполнить запрос проверки связи ICMP из-за того, что срок жизни пакета стал равным нулю, в следствие чего он был удален маршрутищирующим узелом (маршрутизатором или шлюзом).</summary>
		// Token: 0x04002184 RID: 8580
		TimeExceeded,
		/// <summary>Не удалось выполнить запрос проверки связи ICMP из-за недопустимого заголовка.</summary>
		// Token: 0x04002185 RID: 8581
		BadHeader,
		/// <summary>Не удалось выполнить запрос проверки связи ICMP из-за отсутствия в поле "Next Header" (Следующий заголовок) распознаваемого значения. В поле "Next Header" (Следующий заголовок) указывается тип заголовка расширения (если имеется) или протокол, работающий поверх протокола IP, например TCP или UDP.</summary>
		// Token: 0x04002186 RID: 8582
		UnrecognizedNextHeader,
		/// <summary>Не удалось выполнить запрос проверки связи ICMP из-за ошибки протокола ICMP.</summary>
		// Token: 0x04002187 RID: 8583
		IcmpError,
		/// <summary>Не удалось выполнить запрос проверки связи ICMP из-за того, что адреса источника и назначения, указанные в сообщении проверки связи ICMP, находятся в разных областях. Обычно причиной является маршрутизатор, выполняющий переадресацию пакета с помощью интерфейса, который находится за пределами области адреса источника. Области адресов (локальный адрес канала, локальный адрес сети и глобальная область) определяют область сети, в которой адрес действителен.</summary>
		// Token: 0x04002188 RID: 8584
		DestinationScopeMismatch,
		/// <summary>Не удалось выполнить запрос проверки связи ICMP по неизвестной причине.</summary>
		// Token: 0x04002189 RID: 8585
		Unknown = -1
	}
}
