using System;

namespace System.Net.NetworkInformation
{
	/// <summary>Указывает операционное состояние сетевого интерфейса.</summary>
	// Token: 0x020006FA RID: 1786
	public enum OperationalStatus
	{
		/// <summary>Сетевой интерфейс работает и может передавать пакеты данных.</summary>
		// Token: 0x0400219D RID: 8605
		Up = 1,
		/// <summary>Сетевой интерфейс не может передавать пакеты данных.</summary>
		// Token: 0x0400219E RID: 8606
		Down,
		/// <summary>Выполняется тестирование сетевого интерфейса.</summary>
		// Token: 0x0400219F RID: 8607
		Testing,
		/// <summary>Сетевой интерфейс имеет неизвестное состояние.</summary>
		// Token: 0x040021A0 RID: 8608
		Unknown,
		/// <summary>Сетевой интерфейс не может передавать пакеты данных, он ожидает внешнее событие.</summary>
		// Token: 0x040021A1 RID: 8609
		Dormant,
		/// <summary>Сетевой интерфейс не может передавать пакеты данных из-за отсутствующего компонента, обычно аппаратного.</summary>
		// Token: 0x040021A2 RID: 8610
		NotPresent,
		/// <summary>Сетевой интерфейс не может передавать пакеты данных, потому что он работает поверх одного или нескольких других интерфейсов, и не менее одного из этих интерфейсов "нижнего уровня" не работает.</summary>
		// Token: 0x040021A3 RID: 8611
		LowerLayerDown
	}
}
