using System;

namespace System.Net.NetworkInformation
{
	/// <summary>Указывает состояния подключения TCP.</summary>
	// Token: 0x02000706 RID: 1798
	public enum TcpState
	{
		/// <summary>Неизвестное состояние подключения ТСР.</summary>
		// Token: 0x040021CF RID: 8655
		Unknown,
		/// <summary>Подключение TCP закрыто.</summary>
		// Token: 0x040021D0 RID: 8656
		Closed,
		/// <summary>Локальная конечная точка подключения TCP прослушивает запросы на подключение от любой удаленной точки.</summary>
		// Token: 0x040021D1 RID: 8657
		Listen,
		/// <summary>Локальная конечная точка подключения ТСР отправила удаленной конечной точке заголовок сегмента с установленным управляющим битом синхронизации (SYN) и ожидает соответствующий запрос на подключение.</summary>
		// Token: 0x040021D2 RID: 8658
		SynSent,
		/// <summary>Локальная конечная точка подключения TCP отправила и получила запрос на подключение, и ожидает подтверждения.</summary>
		// Token: 0x040021D3 RID: 8659
		SynReceived,
		/// <summary>Выполнено TCP-подтверждение. Подключение установлено, данные могут быть отправлены.</summary>
		// Token: 0x040021D4 RID: 8660
		Established,
		/// <summary>Локальная конечная точка подключения ТСР ожидает от удаленной конечной точки запрос на разрыв подключения или подтверждение ранее отправленного запроса на разрыв подключения.</summary>
		// Token: 0x040021D5 RID: 8661
		FinWait1,
		/// <summary>Локальная конечная точка подключения TCP ожидает от удаленной конечной точки запрос на разрыв подключения.</summary>
		// Token: 0x040021D6 RID: 8662
		FinWait2,
		/// <summary>Локальная конечная точка подключения TCP ожидает от локального пользователя запрос на разрыв подключения.</summary>
		// Token: 0x040021D7 RID: 8663
		CloseWait,
		/// <summary>Локальная конечная точка подключения TCP ожидает подтверждение ранее отправленного запроса на разрыв подключения.</summary>
		// Token: 0x040021D8 RID: 8664
		Closing,
		/// <summary>Локальная конечная точка подключения TCP ожидает окончательное подтверждение ранее отправленного запроса на разрыв подключения.</summary>
		// Token: 0x040021D9 RID: 8665
		LastAck,
		/// <summary>Локальная конечная точка подключения ТСР ожидает в течение достаточного времени, чтобы обеспечить получение удаленной точкой подтверждения ее запроса на разрыв подключения.</summary>
		// Token: 0x040021DA RID: 8666
		TimeWait,
		/// <summary>Удаляется буфер управления передачей (TCB) для подключения TCP.</summary>
		// Token: 0x040021DB RID: 8667
		DeleteTcb
	}
}
