using System;

namespace System.Net.Configuration
{
	/// <summary>Управляет тем, как символы юникода интерпретируются методами <see cref="Overload:System.Net.WebUtility.HtmlDecode" />.</summary>
	// Token: 0x02000758 RID: 1880
	public enum UnicodeDecodingConformance
	{
		/// <summary>Используйте автоматическое поведение. Поведение декодирования определяется текущей целевой рабочей средой приложения. Для .NET Framework 4.5 и более поздних версиях, поведение декодирования Юникод строгое.</summary>
		// Token: 0x04002366 RID: 9062
		Auto,
		/// <summary>Используйте строгое поведение. Указывает, что поступающие кодированные данные проверяются на действительность до декодирования. Например, входная строка "&amp;#144308;" будет декодирована как U+233B4, но входную строку"&amp;#xD84C;&amp;#xDFB4;" не удастся правильно декодировать. Уже декодированные данные в строке не проверяются на допустимость. Например, входная строка "\ud800" даст выходную строку "\ud800", так как уже декодированный суррогат пропускается во время декодирования, даже несмотря на то, что он непарный.</summary>
		// Token: 0x04002367 RID: 9063
		Strict,
		/// <summary>Используйте совместимое поведение. Указывает, что поступающие данные не проверяются на действительность до декодирования. Например, входная строка "&amp;amp; #xD84C;" будет декодирована как U+D84C, что представляет собой непарный суррогат. Кроме того, декодер не понимает кодовые точки в SMP, если только они не представлены в виде закодированного в HTML суррогата, поэтому входная строка "&amp;#144308;" приведет к появлению выходной строки "&amp;#144308;".</summary>
		// Token: 0x04002368 RID: 9064
		Compat,
		/// <summary>Используйте свободное поведение. Как и в <see cref="F:System.Net.Configuration.UnicodeDecodingConformance.Compat" />, нет проверок допустимости, но декодер также понимает кодовые точки. Входная строка "&amp;#144308;" будет правильно декодирована в символ U+233B4. Этот параметр предназначен для предоставления максимального взаимодействия, когда декодер не знает, какой формат поставщик использует для создания кодированной строки.</summary>
		// Token: 0x04002369 RID: 9065
		Loose
	}
}
