using System;

namespace System.Runtime
{
	/// <summary>Настраивает время вмешательства сборщика мусора в работу приложения.</summary>
	// Token: 0x02000551 RID: 1361
	[Serializable]
	public enum GCLatencyMode
	{
		/// <summary>Отключает параллельную сборку мусора и подбирает объекты, используя пакетный вызов. Это режим с наибольшим уровнем вмешательства.</summary>
		// Token: 0x04002509 RID: 9481
		Batch,
		/// <summary>Включает параллельную сборку мусора и подбирает объекты во время работы приложения. Это режим по умолчанию для сборки мусора на рабочей станции, обеспечивающий меньшее вмешательство по сравнению с <see cref="F:System.Runtime.GCLatencyMode.Batch" />. В нем сбалансированы пропускная способность и время отклика приложения.</summary>
		// Token: 0x0400250A RID: 9482
		Interactive,
		/// <summary>Включает режим сборки мусора, при котором объекты подбираются с большей осторожностью. Полная сборка происходит только в случае недостатка памяти, в то время как сборки нулевого и первого поколения могут происходить чаще.</summary>
		// Token: 0x0400250B RID: 9483
		LowLatency,
		/// <summary>Включает сборку мусора, которая пытается минимизировать задержку на протяжении длительного периода. Сборщик пытается выполнять сборку только по поколению 0, поколению 1 и параллельные сборки по поколению 2. Полностью блокирующие сборки могут все равно возникать при нехватке памяти в системе.</summary>
		// Token: 0x0400250C RID: 9484
		SustainedLowLatency,
		/// <summary>Указывает, что сборка мусора приостанавливается, пока приложение выполняет критический путь.  
		///  <see cref="F:System.Runtime.GCLatencyMode.NoGCRegion" /> — значение только для чтения; то есть нельзя назначить значение <see cref="F:System.Runtime.GCLatencyMode.NoGCRegion" /> для свойства <see cref="P:System.Runtime.GCSettings.LatencyMode" />. Режим задержки без области сборки мусора вызывается методом <see cref="Overload:System.GC.TryStartNoGCRegion" /> и прекращается вызовом метода <see cref="M:System.GC.EndNoGCRegion" />.</summary>
		// Token: 0x0400250D RID: 9485
		NoGCRegion
	}
}
