using System;

namespace System.Threading
{
	/// <summary>
	///         Указывает, можно ли несколько раз войти в блокировку из одного и того же потока.
	///       </summary>
	// Token: 0x02000362 RID: 866
	public enum LockRecursionPolicy
	{
		/// <summary>
		///         Если поток пытается войти в блокировку рекурсивно, выдается исключение.
		///          Некоторые классы могут допускать определенные виды рекурсий, когда этот параметр.
		///       </summary>
		// Token: 0x04000CA6 RID: 3238
		NoRecursion,
		/// <summary>
		///         Поток может войти в блокировку рекурсивно.
		///          Некоторые классы могут игнорировать эту возможность.
		///       </summary>
		// Token: 0x04000CA7 RID: 3239
		SupportsRecursion
	}
}
