using System;

namespace System.Text
{
	/// <summary>Определяет тип выполняемой нормализации.</summary>
	// Token: 0x020003AA RID: 938
	public enum NormalizationForm
	{
		/// <summary>Указывает на то, что строка Юникода нормализуется с использованием полной канонической декомпозиции, после чего по возможности следует замена последовательностей их первичными составляющими.</summary>
		// Token: 0x04001DCC RID: 7628
		FormC = 1,
		/// <summary>Указывает на то, что строка Юникода нормализуется с использованием полной канонической декомпозиции.</summary>
		// Token: 0x04001DCD RID: 7629
		FormD,
		/// <summary>Указывает на то, что строка Юникода нормализуется с использованием полной декомпозиции совместимости, после чего по возможности следует замена последовательностей их первичными составляющими.</summary>
		// Token: 0x04001DCE RID: 7630
		FormKC = 5,
		/// <summary>Указывает на то, что строка Юникода нормализуется с использованием полной декомпозиции совместимости.</summary>
		// Token: 0x04001DCF RID: 7631
		FormKD
	}
}
