using System;

namespace System.Configuration
{
	/// <summary>Определяет схему сериализации, используемую для хранения параметров приложения.</summary>
	// Token: 0x020001D7 RID: 471
	public enum SettingsSerializeAs
	{
		/// <summary>Свойство параметров сериализуется как обычный текст.</summary>
		// Token: 0x040007B4 RID: 1972
		String,
		/// <summary>Свойство параметров сериализуется как XML с помощью XML-сериализации.</summary>
		// Token: 0x040007B5 RID: 1973
		Xml,
		/// <summary>Свойство параметров сериализуется с помощью двоичного объекта сериализации.</summary>
		// Token: 0x040007B6 RID: 1974
		Binary,
		/// <summary>Поставщик параметров обладает неточными знаниями о свойстве или его типе, а также подбирает соответствующий механизм сериализации. Часто используется для настраиваемой сериализации.</summary>
		// Token: 0x040007B7 RID: 1975
		ProviderSpecific
	}
}
