using System;

namespace System.Net.Mail
{
	/// <summary>Формат доставки, используемый для отправки исходящих сообщений электронной почты по протоколу SMTP.</summary>
	// Token: 0x02000837 RID: 2103
	public enum SmtpDeliveryFormat
	{
		/// <summary>Формат доставки, использующий 7-битовые символы ASCII.  
		/// традиционный формат доставки, используемый в протоколе SMTP для почтовых сообщений.</summary>
		// Token: 0x0400289E RID: 10398
		SevenBit,
		/// <summary>Формат доставки, где символы, отличные от ASCII, в полях конверта и заголовка, используемых протоколом SMTP для сообщений электронной почты, кодируются с помощью символов UTF-8.  
		/// Расширения для поддержки международной электронной почты определены в стандартах IETF RFC 6530, 6531, и 6532.</summary>
		// Token: 0x0400289F RID: 10399
		International
	}
}
