using System;

namespace System.Configuration.Assemblies
{
	/// <summary>Определяет все хэш-алгоритмы, используемые для хэширования файлов и создания строгого имени.</summary>
	// Token: 0x02000A0C RID: 2572
	public enum AssemblyHashAlgorithm
	{
		/// <summary>Маска, указывающая на отсутствие алгоритма хеширования. Если задать для многомодульной сборки значение <see langword="None" />, по умолчанию среда CLR будет использовать алгоритм SHA1, поскольку для многомодульных сборок генерация хэш значения является обязательной.</summary>
		// Token: 0x04003857 RID: 14423
		None,
		/// <summary>Извлекает хэш-алгоритм MD5. Алгоритм MD5 был разработан Рональдом Райвестом в 1991 г. В его основе лежит алгоритм MD4, снабженный системой безопасности. MD5 работает немного медленнее, чем MD4, но более надежен. Этот алгоритм состоит из четырех отдельных циклов, несколько отличных от MD4. Размер хэш-значения и требования к заполнению остаются теми же.</summary>
		// Token: 0x04003858 RID: 14424
		MD5 = 32771,
		/// <summary>Маска, используемая для извлечения пересмотренного алгоритма SHA, исправляющего неопубликованный дефект в SHA.</summary>
		// Token: 0x04003859 RID: 14425
		SHA1,
		/// <summary>Маска, используемая для извлечения версии алгоритма SHA с размером хэша 256 бит.</summary>
		// Token: 0x0400385A RID: 14426
		SHA256 = 32780,
		/// <summary>Маска, используемая для извлечения версии алгоритма SHA с размером хэша 384 бита.</summary>
		// Token: 0x0400385B RID: 14427
		SHA384,
		/// <summary>Маска, используемая для извлечения версии алгоритма SHA с размером хэша 512 бит.</summary>
		// Token: 0x0400385C RID: 14428
		SHA512
	}
}
