using System;

namespace System.Security.Permissions
{
	/// <summary>Указывает разрешенное использование изолированного хранилища.</summary>
	// Token: 0x0200042C RID: 1068
	public enum IsolatedStorageContainment
	{
		/// <summary>Использование изолированного хранилища не допускается.</summary>
		// Token: 0x04001FDF RID: 8159
		None,
		/// <summary>Хранилище изолируется сначала пользователем, а затем доменом и сборкой. Хранилище также изолируется компьютером. Доступ к данным может быть осуществлен только в контексте того же приложения и только при запуске тем же пользователем. Это полезно, когда сборке сторонней организации требуется закрытое хранилище данных.</summary>
		// Token: 0x04001FE0 RID: 8160
		DomainIsolationByUser = 16,
		/// <summary>Хранилище изолируется сначала пользователем, а затем приложением. Хранилище также изолируется компьютером. Таким образом обеспечивается для приложения хранение данных, доступных в контексте любого домена. Ячейка данных в приложении требует дополнительного доверия, т. к. она может привести к появлению "туннеля" между приложениями, который может вызвать нарушение изоляции данных приложений на некоторых веб-узлах.</summary>
		// Token: 0x04001FE1 RID: 8161
		ApplicationIsolationByUser = 21,
		/// <summary>Хранилище изолируется сначала пользователем, а затем сборкой кода. Хранилище также изолируется компьютером. Таким образом обеспечивается для сборки хранение данных, доступных в контексте любого домена. Ячейка данных в сборке требует дополнительного доверия, т. к. она может привести к появлению "туннеля" между приложениями, который может вызвать нарушение изоляции данных приложений на некоторых веб-узлах.</summary>
		// Token: 0x04001FE2 RID: 8162
		AssemblyIsolationByUser = 32,
		/// <summary>Хранилище изолируется сначала компьютером, а затем доменом и сборкой. Доступ к данным может быть осуществлен только в контексте того же приложения и только при запуске на том же компьютере. Это полезно, когда сборке сторонней организации требуется закрытое хранилище данных.</summary>
		// Token: 0x04001FE3 RID: 8163
		DomainIsolationByMachine = 48,
		/// <summary>Хранилище изолируется сначала компьютером, а затем сборкой кода. Таким образом обеспечивается для сборки хранение данных, доступных в контексте любого домена. Ячейка данных в сборке требует дополнительного доверия, т. к. она может привести к появлению "туннеля" между приложениями, который может вызвать нарушение изоляции данных приложений на некоторых веб-узлах.</summary>
		// Token: 0x04001FE4 RID: 8164
		AssemblyIsolationByMachine = 64,
		/// <summary>Хранилище изолируется сначала компьютером, а затем приложением. Таким образом обеспечивается для приложения хранение данных, доступных в контексте любого домена. Ячейка данных в приложении требует дополнительного доверия, т. к. она может привести к появлению "туннеля" между приложениями, который может вызвать нарушение изоляции данных приложений на некоторых веб-узлах.</summary>
		// Token: 0x04001FE5 RID: 8165
		ApplicationIsolationByMachine = 69,
		/// <summary>Хранилище изолируется сначала пользователем, а затем доменом и сборкой. Хранилище будет перемещаться, если включено перемещение данных пользователя Windows. Доступ к данным может быть осуществлен только в контексте того же приложения и только при запуске тем же пользователем. Это полезно, когда сборке сторонней организации требуется закрытое хранилище данных.</summary>
		// Token: 0x04001FE6 RID: 8166
		DomainIsolationByRoamingUser = 80,
		/// <summary>Хранилище изолируется сначала пользователем, а затем свидетельством сборки. Хранилище будет перемещаться, если включено перемещение данных пользователя Windows. Таким образом обеспечивается для сборки хранение данных, доступных в контексте любого домена. Ячейка данных в сборке требует дополнительного доверия, т. к. она может привести к появлению "туннеля" между приложениями, который может вызвать нарушение изоляции данных приложений на некоторых веб-узлах.</summary>
		// Token: 0x04001FE7 RID: 8167
		AssemblyIsolationByRoamingUser = 96,
		/// <summary>Хранилище изолируется сначала пользователем, а затем свидетельством приложения. Хранилище будет перемещаться, если включено перемещение данных пользователя Windows. Таким образом обеспечивается для приложения хранение данных, доступных в контексте любого домена. Ячейка данных в приложении требует дополнительного доверия, т. к. она может привести к появлению "туннеля" между приложениями, который может вызвать нарушение изоляции данных приложений на некоторых веб-узлах.</summary>
		// Token: 0x04001FE8 RID: 8168
		ApplicationIsolationByRoamingUser = 101,
		/// <summary>Неограниченные возможности администрирования для хранилища пользователя. Позволяет просматривать и удалять все хранилище пользователя, но доступ к чтению предоставляется только собственной идентификации домена/сборки.</summary>
		// Token: 0x04001FE9 RID: 8169
		AdministerIsolatedStorageByUser = 112,
		/// <summary>Использование изолированного хранилища допускается без ограничения. Код имеет полный доступ к любой части пользовательского хранилища независимо от учетной записи домена или сборки. Такое использование изолированного хранилища включает в себя возможность перечислять содержимое изолированного хранилища данных.</summary>
		// Token: 0x04001FEA RID: 8170
		UnrestrictedIsolatedStorage = 240
	}
}
