using System;
using System.Runtime.InteropServices;

namespace System.Security.Permissions
{
	/// <summary>Указывает действия безопасности, которые можно выполнить с помощью декларативной безопасности.</summary>
	// Token: 0x02000455 RID: 1109
	[ComVisible(true)]
	[Serializable]
	public enum SecurityAction
	{
		/// <summary>Всем вызывающим объектам выше в стеке вызовов должно быть предоставлено разрешение, заданное текущим объектом разрешений.</summary>
		// Token: 0x0400208A RID: 8330
		Demand = 2,
		/// <summary>Вызывающий код может получить доступ к ресурсу, определяемому текущим объектом разрешения, даже если вызывающим объектам выше в стеке вызовов не предоставлено разрешение на доступ к ресурсу (см. раздел Использование метода Assert).</summary>
		// Token: 0x0400208B RID: 8331
		Assert,
		/// <summary>Вызывающим объектам запрещен доступ к ресурсу (определяется текущим объектом разрешения), даже если им предоставлено разрешение на доступ к этому ресурсу (см. раздел об использовании метода Deny).</summary>
		// Token: 0x0400208C RID: 8332
		[Obsolete("This requests should not be used")]
		Deny,
		/// <summary>Доступ можно получить только к ресурсам, указанным данным объектом разрешения, даже если коду предоставлено разрешение на доступ к другим ресурсам.</summary>
		// Token: 0x0400208D RID: 8333
		PermitOnly,
		/// <summary>Указанное разрешение необходимо предоставить непосредственно вызывающему объекту. Не используйте в .NET Framework 4. Для полного доверия используйте вместо него <see cref="T:System.Security.SecurityCriticalAttribute" />; для частичного доверия используйте <see cref="F:System.Security.Permissions.SecurityAction.Demand" />.</summary>
		// Token: 0x0400208E RID: 8334
		LinkDemand,
		/// <summary>Необходимо, чтобы производному классу, наследующему класс или переопределяющему метод, было предоставлено указанное разрешение.</summary>
		// Token: 0x0400208F RID: 8335
		InheritanceDemand,
		/// <summary>Запрос на минимальный набор разрешений, необходимых для выполнения кода. Это действие может использоваться только в пределах сборки.</summary>
		// Token: 0x04002090 RID: 8336
		[Obsolete("This requests should not be used")]
		RequestMinimum,
		/// <summary>Запрос дополнительных разрешений, которые не являются обязательными (не требуются для выполнения). Этот запрос неявно отклоняет все прочие разрешения, не запрошенные специально. Это действие может использоваться только в пределах сборки.</summary>
		// Token: 0x04002091 RID: 8337
		[Obsolete("This requests should not be used")]
		RequestOptional,
		/// <summary>Запрос на непредоставление вызывающему коду разрешений, которые могут быть неправильно использованы. Это действие может использоваться только в пределах сборки.</summary>
		// Token: 0x04002092 RID: 8338
		[Obsolete("This requests should not be used")]
		RequestRefuse
	}
}
