using System;

namespace System.Reflection
{
	/// <summary>Определяет допустимые соглашения о вызовах для метода.</summary>
	// Token: 0x02000894 RID: 2196
	[Flags]
	public enum CallingConventions
	{
		/// <summary>Определяет соглашение вызова по умолчанию, определяемое общеязыковой средой выполнения. Это соглашение о вызове используется для статических методов. Для экземпляра или виртуальных методов используется метод <see langword="HasThis" />.</summary>
		// Token: 0x04002E7E RID: 11902
		Standard = 1,
		/// <summary>Определяет соглашение вызова для методов с переменными аргументами.</summary>
		// Token: 0x04002E7F RID: 11903
		VarArgs = 2,
		/// <summary>Определяет используемые соглашения вызова: <see langword="Standard" /> или <see langword="VarArgs" />.</summary>
		// Token: 0x04002E80 RID: 11904
		Any = 3,
		/// <summary>Определяет экземпляр или виртуальный (не статический) метод. Во время выполнения вызываемому методу в качестве первого аргумента передается указатель на конечный объект (указатель <see langword="this" />). Сигнатура, хранящаяся в метаданных, не содержит тип этого первого аргумента, так как этот метод известен и класс его владельца может быть извлечен из метаданных.</summary>
		// Token: 0x04002E81 RID: 11905
		HasThis = 32,
		/// <summary>Указывает, что данная сигнатура является сигнатурой указателя функции, представляя собой экземпляр или виртуальный (не статический) метод. Если установлен параметр <see langword="ExplicitThis" />, должен быть задан и параметр <see langword="HasThis" />. Первый аргумент, передаваемый вызываемому методу, все же является указателем <see langword="this" />, но тип первого аргумента в этот момент неизвестен. Следовательно, в сигнатуре метаданных указателя <see langword="this" /> явно хранится маркер, описывающий тип (или класс) этого указателя.</summary>
		// Token: 0x04002E82 RID: 11906
		ExplicitThis = 64
	}
}
