using System;

namespace System.Reflection
{
	/// <summary>Идентифицирует виды предложений для обработки исключений.</summary>
	// Token: 0x0200089D RID: 2205
	[Flags]
	public enum ExceptionHandlingClauseOptions
	{
		/// <summary>Это предложение принимает все исключения, которые являются производными от заданного типа.</summary>
		// Token: 0x04002E8D RID: 11917
		Clause = 0,
		/// <summary>Это предложение содержит пользовательские инструкции, которые определяют, должно исключение игнорироваться (другими словами, должно ли быть возобновлено обычное выполнение), обрабатываться сопоставленным обработчиком или передаваться в следующее предложение.</summary>
		// Token: 0x04002E8E RID: 11918
		Filter = 1,
		/// <summary>Это предложение выполняется при существовании блока "try" в обычном потоке управления или при возникновении необработанного исключения.</summary>
		// Token: 0x04002E8F RID: 11919
		Finally = 2,
		/// <summary>Это предложение выполняется при возникновении исключения, но не по завершении нормального потока управления.</summary>
		// Token: 0x04002E90 RID: 11920
		Fault = 4
	}
}
