using System;

namespace System.Reflection
{
	/// <summary>Задает флаги, описывающие атрибуты поля.</summary>
	// Token: 0x0200089E RID: 2206
	[Flags]
	public enum FieldAttributes
	{
		/// <summary>Определяет уровень доступа для заданного поля.</summary>
		// Token: 0x04002E92 RID: 11922
		FieldAccessMask = 7,
		/// <summary>Определяет, что на поле нельзя ссылаться.</summary>
		// Token: 0x04002E93 RID: 11923
		PrivateScope = 0,
		/// <summary>Определяет, что поле доступно только для родительского типа.</summary>
		// Token: 0x04002E94 RID: 11924
		Private = 1,
		/// <summary>Определяет, что поле доступно только для подтипов в данной сборке.</summary>
		// Token: 0x04002E95 RID: 11925
		FamANDAssem = 2,
		/// <summary>Определяет, что поле доступно во всей сборке.</summary>
		// Token: 0x04002E96 RID: 11926
		Assembly = 3,
		/// <summary>Определяет, что поле доступно только для типа и подтипов.</summary>
		// Token: 0x04002E97 RID: 11927
		Family = 4,
		/// <summary>Определяет, что поле доступно для подтипов, находящихся где угодно, а также во всей сборке.</summary>
		// Token: 0x04002E98 RID: 11928
		FamORAssem = 5,
		/// <summary>Определяет, что поле доступно любому члену, для которого эта ограниченная область действия является видимой.</summary>
		// Token: 0x04002E99 RID: 11929
		Public = 6,
		/// <summary>Определяет, что поле представляет указанный тип или является полем для экземпляра.</summary>
		// Token: 0x04002E9A RID: 11930
		Static = 16,
		/// <summary>Указывает, что поле инициализируется и задается только в теле конструктора.</summary>
		// Token: 0x04002E9B RID: 11931
		InitOnly = 32,
		/// <summary>Определяет, что значение поля является константой (статической или с ранним связыванием), определяемой во время компиляции. Любая попытка задать создает <see cref="T:System.FieldAccessException" />.</summary>
		// Token: 0x04002E9C RID: 11932
		Literal = 64,
		/// <summary>Определяет, что если тип является удаленным, поле не должно быть сериализовано.</summary>
		// Token: 0x04002E9D RID: 11933
		NotSerialized = 128,
		/// <summary>Определяет специальный метод с именем, которое описывает, насколько этот метод является специальным.</summary>
		// Token: 0x04002E9E RID: 11934
		SpecialName = 512,
		/// <summary>Зарезервировано для будущего использования.</summary>
		// Token: 0x04002E9F RID: 11935
		PinvokeImpl = 8192,
		/// <summary>Определяет, что общеязыковая среда выполнения (внутренние API метаданных) должна проверить кодировку имени.</summary>
		// Token: 0x04002EA0 RID: 11936
		RTSpecialName = 1024,
		/// <summary>Определяет, что для поля заданы сведения о маршалинге.</summary>
		// Token: 0x04002EA1 RID: 11937
		HasFieldMarshal = 4096,
		/// <summary>Определяет, что для поля задано значение по умолчанию.</summary>
		// Token: 0x04002EA2 RID: 11938
		HasDefault = 32768,
		/// <summary>Определяет, что для поля задан RVA (Relative Virtual Address, относительный виртуальный адрес). RVA определяет местонахождение текста сообщения метода в текущем образе — адрес относительно начала файла образа, в котором оно находится.</summary>
		// Token: 0x04002EA3 RID: 11939
		HasFieldRVA = 256,
		/// <summary>Зарезервировано.</summary>
		// Token: 0x04002EA4 RID: 11940
		ReservedMask = 38144
	}
}
