using System;

namespace System.Reflection
{
	/// <summary>Задает флаги для атрибутов метода. Эти флаги определяются в файле corhdr.h.</summary>
	// Token: 0x020008AC RID: 2220
	[Flags]
	public enum MethodAttributes
	{
		/// <summary>Извлекает сведения о доступности.</summary>
		// Token: 0x04002EC5 RID: 11973
		MemberAccessMask = 7,
		/// <summary>Указывает, что невозможно создать ссылку на этот член.</summary>
		// Token: 0x04002EC6 RID: 11974
		PrivateScope = 0,
		/// <summary>Указывает, что метод доступен только для текущего класса.</summary>
		// Token: 0x04002EC7 RID: 11975
		Private = 1,
		/// <summary>Указывает, что метод доступен для членов этого типа и производных типов, которые находятся только в данной сборке.</summary>
		// Token: 0x04002EC8 RID: 11976
		FamANDAssem = 2,
		/// <summary>Указывает, что метод доступен для любого класса этой сборки.</summary>
		// Token: 0x04002EC9 RID: 11977
		Assembly = 3,
		/// <summary>Указывает, что метод доступен только для членов этого класса и его производных классов.</summary>
		// Token: 0x04002ECA RID: 11978
		Family = 4,
		/// <summary>Указывает, что метод доступен для производных классов любой сборки и любого класса этой сборки.</summary>
		// Token: 0x04002ECB RID: 11979
		FamORAssem = 5,
		/// <summary>Указывает, что метод доступен для любого объекта, для которого данный объект находится в ограниченной области действия.</summary>
		// Token: 0x04002ECC RID: 11980
		Public = 6,
		/// <summary>Указывает, что метод определяется для типа; в противном случае метод определяется для каждого экземпляра.</summary>
		// Token: 0x04002ECD RID: 11981
		Static = 16,
		/// <summary>Указывает, что метод не может быть переопределен.</summary>
		// Token: 0x04002ECE RID: 11982
		Final = 32,
		/// <summary>Указывает, что данный метод является виртуальным.</summary>
		// Token: 0x04002ECF RID: 11983
		Virtual = 64,
		/// <summary>Указывает, что метод скрывается на основе оценки имени и сигнатуры; в обратном случае метод скрывается только по имени.</summary>
		// Token: 0x04002ED0 RID: 11984
		HideBySig = 128,
		/// <summary>Указывает, что метод может быть переопределен только в том случае, если он доступен.</summary>
		// Token: 0x04002ED1 RID: 11985
		CheckAccessOnOverride = 512,
		/// <summary>Извлекает атрибуты vtable.</summary>
		// Token: 0x04002ED2 RID: 11986
		VtableLayoutMask = 256,
		/// <summary>Указывает, что метод использует существующую ячейку в таблице vtable. Это поведение установлено по умолчанию.</summary>
		// Token: 0x04002ED3 RID: 11987
		ReuseSlot = 0,
		/// <summary>Указывает, что метод всегда получает новую ячейку в таблице vtable.</summary>
		// Token: 0x04002ED4 RID: 11988
		NewSlot = 256,
		/// <summary>Указывает, что данный класс не обеспечивает реализацию этого метода.</summary>
		// Token: 0x04002ED5 RID: 11989
		Abstract = 1024,
		/// <summary>Указывает, что данный метод является специальным. Особенность метода описывается в его имени.</summary>
		// Token: 0x04002ED6 RID: 11990
		SpecialName = 2048,
		/// <summary>Указывает, что реализация метода перенаправляется через PInvoke (Platform Invocation Services; службы платформенных вызовов).</summary>
		// Token: 0x04002ED7 RID: 11991
		PinvokeImpl = 8192,
		/// <summary>Указывает, что данный управляемый метод экспортируется преобразователем в неуправляемый программный код.</summary>
		// Token: 0x04002ED8 RID: 11992
		UnmanagedExport = 8,
		/// <summary>Указывает, что кодировка имен проверяется общеязыковой средой выполнения.</summary>
		// Token: 0x04002ED9 RID: 11993
		RTSpecialName = 4096,
		/// <summary>Показывает, что с данным методом связаны параметры безопасности. Флаг зарезервирован для использования только во время выполнения.</summary>
		// Token: 0x04002EDA RID: 11994
		HasSecurity = 16384,
		/// <summary>Указывает, что метод вызывает другой метод, содержащий код защиты. Флаг зарезервирован для использования только во время выполнения.</summary>
		// Token: 0x04002EDB RID: 11995
		RequireSecObject = 32768,
		/// <summary>Указывает, что флаг зарезервирован для использования только во время выполнения.</summary>
		// Token: 0x04002EDC RID: 11996
		ReservedMask = 53248
	}
}
