using System;

namespace System.Reflection
{
	/// <summary>Задает атрибуты типа.</summary>
	// Token: 0x020008CD RID: 2253
	[Flags]
	public enum TypeAttributes
	{
		/// <summary>Задает сведения о видимости типа.</summary>
		// Token: 0x04002F36 RID: 12086
		VisibilityMask = 7,
		/// <summary>Указывает, что данный класс не является открытым.</summary>
		// Token: 0x04002F37 RID: 12087
		NotPublic = 0,
		/// <summary>Указывает, что данный класс является открытым.</summary>
		// Token: 0x04002F38 RID: 12088
		Public = 1,
		/// <summary>Указывает, что класс является вложенным с открытой областью видимости.</summary>
		// Token: 0x04002F39 RID: 12089
		NestedPublic = 2,
		/// <summary>Указывает, что данный класс является вложенным с закрытой областью видимости.</summary>
		// Token: 0x04002F3A RID: 12090
		NestedPrivate = 3,
		/// <summary>Указывает, что данный класс является вложенным с областью видимости на уровне семейства и поэтому доступен только методам в пределах его собственного типа и производных типов.</summary>
		// Token: 0x04002F3B RID: 12091
		NestedFamily = 4,
		/// <summary>Указывает, что данный класс является вложенным с областью видимости на уровне сборки и доступен только методам в пределах сборки.</summary>
		// Token: 0x04002F3C RID: 12092
		NestedAssembly = 5,
		/// <summary>Указывает, что данный класс является вложенным с областью видимости на уровне сборки и семейства и доступен только для методов, область определения которых находится на пересечении семейства класса и сборки.</summary>
		// Token: 0x04002F3D RID: 12093
		NestedFamANDAssem = 6,
		/// <summary>Указывает, что данный класс является вложенным с областью видимости на уровне сборки или семейства и доступен только для методов, область определения которых находится в объединении семейства класса и сборки.</summary>
		// Token: 0x04002F3E RID: 12094
		NestedFamORAssem = 7,
		/// <summary>Задает сведения о структуре класса.</summary>
		// Token: 0x04002F3F RID: 12095
		LayoutMask = 24,
		/// <summary>Указывает, что поля класса автоматически распределяются общеязыковой средой выполнения.</summary>
		// Token: 0x04002F40 RID: 12096
		AutoLayout = 0,
		/// <summary>Указывает, что поля класса распределены последовательно в порядке их передачи в метаданные.</summary>
		// Token: 0x04002F41 RID: 12097
		SequentialLayout = 8,
		/// <summary>Указывает, что поля класса распределяются с заданными смещениями.</summary>
		// Token: 0x04002F42 RID: 12098
		ExplicitLayout = 16,
		/// <summary>Определяет сведения о семантике класса; текущий класс зависит от контекста (в обратном случае он является гибким).</summary>
		// Token: 0x04002F43 RID: 12099
		ClassSemanticsMask = 32,
		/// <summary>Указывает, что данный тип является классом.</summary>
		// Token: 0x04002F44 RID: 12100
		Class = 0,
		/// <summary>Указывает, что данный тип является интерфейсом.</summary>
		// Token: 0x04002F45 RID: 12101
		Interface = 32,
		/// <summary>Указывает, что данный тип является абстрактным.</summary>
		// Token: 0x04002F46 RID: 12102
		Abstract = 128,
		/// <summary>Указывает, что класс конкретизирован и не может быть расширен.</summary>
		// Token: 0x04002F47 RID: 12103
		Sealed = 256,
		/// <summary>Указывает, что класс является специальным. Особенности класса отражены в его имени.</summary>
		// Token: 0x04002F48 RID: 12104
		SpecialName = 1024,
		/// <summary>Указывает, что класс или интерфейс импортирован из другого модуля.</summary>
		// Token: 0x04002F49 RID: 12105
		Import = 4096,
		/// <summary>Указывает, что класс может быть сериализован.</summary>
		// Token: 0x04002F4A RID: 12106
		Serializable = 8192,
		/// <summary>Задает тип Среда выполнения Windows.</summary>
		// Token: 0x04002F4B RID: 12107
		WindowsRuntime = 16384,
		/// <summary>Используется для извлечения строковых данных для присущей данному объекту организации встроенного взаимодействия.</summary>
		// Token: 0x04002F4C RID: 12108
		StringFormatMask = 196608,
		/// <summary>LPTSTR обрабатывается как ANSI.</summary>
		// Token: 0x04002F4D RID: 12109
		AnsiClass = 0,
		/// <summary>LPTSTR обрабатывается как UNICODE.</summary>
		// Token: 0x04002F4E RID: 12110
		UnicodeClass = 65536,
		/// <summary>LPTSTR обрабатывается автоматически.</summary>
		// Token: 0x04002F4F RID: 12111
		AutoClass = 131072,
		/// <summary>Тип LPSTR интерпретируется некоторыми средствами, включенными в конкретные реализации, что предоставляет возможность выдать исключение <see cref="T:System.NotSupportedException" />. Не используется в реализации .NET Framework от Microsoft.</summary>
		// Token: 0x04002F50 RID: 12112
		CustomFormatClass = 196608,
		/// <summary>Используется для извлечения сведений о нестандартном шифровании встроенного взаимодействия. Использование значений этих 2 бит не определено. Не используется в реализации .NET Framework от Microsoft.</summary>
		// Token: 0x04002F51 RID: 12113
		CustomFormatMask = 12582912,
		/// <summary>Указывает, что вызов статических методов типа не принуждает систему инициализировать тип.</summary>
		// Token: 0x04002F52 RID: 12114
		BeforeFieldInit = 1048576,
		/// <summary>Кодировка имен должна контролироваться средой выполнения.</summary>
		// Token: 0x04002F53 RID: 12115
		RTSpecialName = 2048,
		/// <summary>С данным типом связаны параметры безопасности.</summary>
		// Token: 0x04002F54 RID: 12116
		HasSecurity = 262144,
		/// <summary>Атрибуты, зарезервированные для использования средой выполнения.</summary>
		// Token: 0x04002F55 RID: 12117
		ReservedMask = 264192
	}
}
