using System;

namespace System.Diagnostics.PerformanceData
{
	/// <summary>
	///         Указывает, допускает ли набор счетчиков несколько экземпляров, например, процессы и физических дисков, или одного экземпляра, например памяти.
	///       </summary>
	// Token: 0x0200038F RID: 911
	public enum CounterSetInstanceType
	{
		/// <summary>
		///         Набор счетчиков содержит счетчики с единственным экземпляром, статистические значения которых получается из одного или нескольких источников.
		///          Например счетчик в наборе счетчиков данного типа может получать число операций чтения из каждого из трех жестких дисков на компьютере и сумма их значения.
		///       </summary>
		// Token: 0x04000D13 RID: 3347
		GlobalAggregate = 4,
		/// <summary>
		///         Этот тип аналогичен <see cref="F:System.Diagnostics.PerformanceData.CounterSetInstanceType.GlobalAggregate" /> за исключением того, что этот набор счетчиков типа хранит все значения счетчиков в течение времени существования приложения-потребителя (значение счетчика кэшируется после истечения времени жизни счетчика).
		///          Например если один из жестких дисков в примере глобальной статистики перестает становятся недоступными, общее число байтов, считанных с данного диска по-прежнему будет доступно и может использоваться для вычисления статистического значения.
		///       </summary>
		// Token: 0x04000D14 RID: 3348
		GlobalAggregateWithHistory = 11,
		/// <summary>
		///         Этот тип аналогичен <see cref="F:System.Diagnostics.PerformanceData.CounterSetInstanceType.MultipleAggregate" />, за исключением того, что вместо статистической обработки все данные экземпляра в одном экземпляре агрегированные (_Total), он будет выполнять статистическую обработку данных счетчиков из экземпляров с тем же именем.
		///          Например, если несколько поставщик обрабатывает вложенных экземпляров с именем IExplore <see cref="F:System.Diagnostics.PerformanceData.CounterSetInstanceType.Multiple" /> и <see cref="F:System.Diagnostics.PerformanceData.CounterSetInstanceType.MultipleAggregate" /> CounterSet покажет несколько экземпляров IExplore (IExplore, IExplore #1, IExplore #2 и т. д.), однако <see cref="F:System.Diagnostics.PerformanceData.CounterSetInstanceType.InstanceAggregate" /> публикации только один экземпляр IExplore с статистических данных для всех экземпляров с именем IExplore тип экземпляра.
		///       </summary>
		// Token: 0x04000D15 RID: 3349
		InstanceAggregate = 22,
		/// <summary>
		///         Набор счетчиков содержит многоэкземплярные счетчики, например, счетчик для измерения среднего числа операций дискового ввода-вывода для процесса.
		///       </summary>
		// Token: 0x04000D16 RID: 3350
		Multiple = 2,
		/// <summary>
		///         Набор счетчиков содержит многоэкземплярные счетчики, статистические значения которых получается из всех экземпляров счетчика.
		///          Например счетчик в наборе счетчиков данного типа может получать общего времени выполнения потока для всех потоков многопоточного приложения и суммировать их значения.
		///       </summary>
		// Token: 0x04000D17 RID: 3351
		MultipleAggregate = 6,
		/// <summary>
		///         Набор счетчиков содержит счетчики с единственным экземпляром, например, счетчик объема физической памяти.
		///       </summary>
		// Token: 0x04000D18 RID: 3352
		Single = 0
	}
}
