using System;

namespace System.Diagnostics.PerformanceData
{
	/// <summary>
	///         Определяет возможные типы счетчика.
	///          Каждому счетчику присваивается тип счетчика.
	///          Тип счетчика определяет, как вычисляется, в среднем и отображаются данные счетчика.
	///       </summary>
	// Token: 0x02000390 RID: 912
	public enum CounterType
	{
		/// <summary>
		///         Этот счетчик используется как базовый данных (делитель) при расчете времени или количества средних значений для <see cref="F:System.Diagnostics.PerformanceData.CounterType.AverageCount64" /> и <see cref="F:System.Diagnostics.PerformanceData.CounterType.AverageTimer32" /> типов счетчиков.
		///          Счетчик данного типа хранит только последнее наблюдаемое значение.
		///          (См. тип счетчика PERF_AVERAGE_BASE в пакете развертывания).
		///       </summary>
		// Token: 0x04000D1A RID: 3354
		AverageBase = 1073939458,
		/// <summary>
		///         Счетчик данного типа показывает, сколько элементов обработано в среднем за операцию.
		///          Счетчики этого типа отображают отношение обработанных (например, отправленных байтов) элементов к числу завершенных операций.
		///          Это отношение вычисляется путем сравнения число обработанных элементов в течение последнего интервала число операций, завершенных в течение последнего интервала.
		///          (См. тип счетчика PERF_AVERAGE_BULK в пакете развертывания).
		///       </summary>
		// Token: 0x04000D1B RID: 3355
		AverageCount64 = 1073874176,
		/// <summary>
		///         Этот тип счетчика измеряет среднее время, необходимое для завершения процесса или операции.
		///          Счетчики этого типа отображают отношение общее затраченное время интервала выборки на число процессов или операций, завершенных за это время.
		///          Этот тип счетчика измеряет время в тактах системных часов.
		///          (См. тип счетчика PERF_AVERAGE_TIMER в пакете развертывания).
		///       </summary>
		// Token: 0x04000D1C RID: 3356
		AverageTimer32 = 805438464,
		/// <summary>
		///         Счетчик данного типа показывает изменение в атрибуте измеренный между двумя последними интервалами измерения.
		///          (См. тип счетчика PERF_COUNTER_DELTA в пакете развертывания).
		///       </summary>
		// Token: 0x04000D1D RID: 3357
		Delta32 = 4195328,
		/// <summary>
		///         Счетчик данного типа показывает изменение в атрибуте измеренный между двумя последними интервалами измерения.
		///          Это аналогично <see cref="F:System.Diagnostics.PerformanceData.CounterType.Delta32" /> счетчик типа, за исключением того, что используются большие поля для размещения больших значений.
		///          (См. тип счетчика PERF_COUNTER_LARGE_DELTA в пакете развертывания).
		///       </summary>
		// Token: 0x04000D1E RID: 3358
		Delta64 = 4195584,
		/// <summary>
		///         Счетчик данного типа показывает полное время между началом работы компонента или процесса и вычислением это значение.
		///          (См. тип счетчика PERF_ELAPSED_TIME в пакете развертывания).
		///       </summary>
		// Token: 0x04000D1F RID: 3359
		ElapsedTime = 807666944,
		/// <summary>
		///         Счетчик данного типа отслеживает среднюю длину очереди к ресурсу со временем.
		///          Счетчики этого типа отображают разницу между длинами очередей, наблюдаемых в течение последних двух интервалов, деленную на продолжительность интервала.
		///          Этот тип счетчика является таким же, как <see cref="F:System.Diagnostics.PerformanceData.CounterType.QueueLength" /> счетчик типа, за исключением того, что используются большие поля для размещения больших значений.
		///          (См. тип счетчика PERF_COUNTER_LARGE_QUEUELEN_TYPE в пакете развертывания).
		///       </summary>
		// Token: 0x04000D20 RID: 3360
		LargeQueueLength = 4523264,
		/// <summary>
		///         Указывает число измеренных элементов.
		///          Используется как знаменатель в вычислениях для получения среднего среди измеренных элементов при измерении времени нескольких, но очень похожие элементы.
		///          Этот тип поддерживает следующие типы счетчика: <see cref="F:System.Diagnostics.PerformanceData.CounterType.MultiTimerPercentageActive" />, <see cref="F:System.Diagnostics.PerformanceData.CounterType.MultiTimerPercentageNotActive" />, <see cref="F:System.Diagnostics.PerformanceData.CounterType.MultiTimerPercentageActive100Ns" />, и <see cref="F:System.Diagnostics.PerformanceData.CounterType.MultiTimerPercentageNotActive100Ns" />.
		///       </summary>
		// Token: 0x04000D21 RID: 3361
		MultiTimerBase = 1107494144,
		/// <summary>
		///         Этот тип счетчика является мультитаймером.
		///          Мультитаймеры более одного экземпляра компонента, например процессора или диска.
		///          Счетчики этого типа отображают активного времени одного или нескольких компонентов в процентах от общего времени интервала выборки.
		///          Поскольку числитель записывает время активности работающих компонентов одновременно, результат может превышать 100 процентов.
		///          Этот тип счетчика отличается от <see cref="F:System.Diagnostics.PerformanceData.CounterType.MultiTimerPercentageActive100Ns" /> в том, что он измеряет время в тактах системного таймера производительности, а не в единицах измерения, равных 100 нс.
		///          (См. тип счетчика PERF_COUNTER_MULTI_TIMER в пакете развертывания).
		///       </summary>
		// Token: 0x04000D22 RID: 3362
		MultiTimerPercentageActive = 574686464,
		/// <summary>
		///         Счетчик данного типа показывает активного времени одного или нескольких компонентов в процентах от общего времени интервала выборки.
		///          Время измеряется в единицах измерения, равных 100 нс.
		///          Этот тип счетчика является мультитаймером.
		///          Мультитаймеры предназначены для наблюдения за более одного экземпляра компонента, например процессора или диска.
		///          (См. тип счетчика PERF_100NSEC_MULTI_TIMER в пакете развертывания).
		///       </summary>
		// Token: 0x04000D23 RID: 3363
		MultiTimerPercentageActive100Ns = 575735040,
		/// <summary>
		///         Счетчик данного типа показывает активного времени одного или нескольких компонентов в процентах от общего времени интервала выборки.
		///          Этот тип счетчика представляет собой обратный мультитаймер.
		///          Мультитаймеры исследуют более одного экземпляра компонента, например процессора или диска.
		///          Обратные счетчики измеряют время, компонент не был активным и получают из этого измерения активное время.
		///          Этот счетчик отличается от <see cref="F:System.Diagnostics.PerformanceData.CounterType.MultiTimerPercentageNotActive100Ns" /> в том, что он измеряет время в тактах системного таймера производительности, а не в единицах измерения, равных 100 нс.
		///          (См. тип счетчика PERF_COUNTER_MULTI_TIMER_INV в пакете развертывания).
		///       </summary>
		// Token: 0x04000D24 RID: 3364
		MultiTimerPercentageNotActive = 591463680,
		/// <summary>
		///         Счетчик данного типа показывает активного времени одного или нескольких компонентов в процентах от общего времени интервала выборки.
		///          Счетчики этого типа измерения времени в единицах измерения, равных 100 нс.
		///          Этот тип счетчика представляет собой обратный мультитаймер.
		///          Мультитаймеры предназначены для наблюдения за более одного экземпляра компонента, например процессора или диска.
		///          Обратные счетчики измеряют время, компонент не был активным и таким образом из измерения времени.
		///          (См. тип счетчика PERF_100NSEC_MULTI_TIMER_INV в пакете развертывания).
		///       </summary>
		// Token: 0x04000D25 RID: 3365
		MultiTimerPercentageNotActive100Ns = 592512256,
		/// <summary>
		///         Этот тип 64-разрядный счетчик является таймер для отображения единиц измерения определенного объекта.
		///          (См. тип счетчика PERF_OBJ_TIME_TIMER в пакете развертывания).
		///       </summary>
		// Token: 0x04000D26 RID: 3366
		ObjectSpecificTimer = 543229184,
		/// <summary>
		///         Этот счетчик показывает среднее время, компонент был активным в процентах к полному времени измерения.
		///          (См. тип счетчика PERF_COUNTER_TIMER в пакете развертывания).
		///       </summary>
		// Token: 0x04000D27 RID: 3367
		PercentageActive = 541132032,
		/// <summary>
		///         Счетчик данного типа показывает активное время компонента в процентах от общее затраченное время интервала выборки.
		///          Время измеряется в единицах 100 наносекунд.
		///          Счетчики этого типа предназначены для измерения активности компонента одновременно.
		///          (См. сведения о типе счетчика PERF_100NSEC_TIMER в пакете развертывания).
		///       </summary>
		// Token: 0x04000D28 RID: 3368
		PercentageActive100Ns = 542180608,
		/// <summary>
		///         Это обратный тип счетчика.
		///          Обратные счетчики измеряют время, компонент не был активным и получают из этого измерения активное время.
		///          Счетчики этого типа для отображения среднего процента измеренного за интервал времени.
		///          Значение этих счетчиков вычисляется путем мониторинга процент времени, для которого служба была неактивна и затем вычитанием этого значения из 100%.
		///          Этот тип счетчика является таким же, как <see cref="F:System.Diagnostics.PerformanceData.CounterType.PercentageNotActive100Ns" /> счетчик типа, за исключением того, что он измеряет время в тактах системного таймера производительности, а не в единицах измерения, равных 100 нс.
		///          (См. тип счетчика PERF_COUNTER_TIMER_INV в пакете развертывания).
		///       </summary>
		// Token: 0x04000D29 RID: 3369
		PercentageNotActive = 557909248,
		/// <summary>
		///         Этот тип счетчика среднего процента измеренного за определенный интервал времени.
		///          Это обратный счетчик.
		///          Обратные счетчики вычисляется путем мониторинга процент времени, для которого служба была неактивна и затем вычитанием этого значения из 100%.
		///          (См. тип счетчика PERF_100NSEC_TIMER_INV в пакете развертывания).
		///       </summary>
		// Token: 0x04000D2A RID: 3370
		PercentageNotActive100Ns = 558957824,
		/// <summary>
		///         Этот счетчик показывает значение, которое состоит из значений двух счетчиков: количества времени, затраченного отслеживаемого события и частотой, указанной в поле PerfFreq заголовка объекта.
		///          Этот тип счетчика отличается от других таймеров тем, что значение тактов часов сопровождающий значение счетчика для устранения возможных разница из-за задержки в вызове функции.
		///          Точные типы счетчиков используются, когда стандартный системный таймер не обеспечивает необходимую точность значений.
		///          (См. тип счетчика PERF_PRECISION_OBJECT_TIMER в пакете развертывания).
		///       </summary>
		// Token: 0x04000D2B RID: 3371
		PrecisionObjectSpecificTimer = 543622400,
		/// <summary>
		///         Этот счетчик показывает значение, которое состоит из значений двух счетчиков: количества времени, отслеживаемого события и частоты системного таймера производительности.
		///          Этот тип счетчика отличается от других таймеров тем, что значение тактов часов сопровождающий значение счетчика тактируется из-за задержки в вызове функции.
		///          Точные типы счетчиков используются, когда стандартный системный таймер не обеспечивает необходимую точность значений.
		///          (См. тип счетчика PERF_PRECISION_TIMER в пакете развертывания).
		///       </summary>
		// Token: 0x04000D2C RID: 3372
		PrecisionSystemTimer = 541525248,
		/// <summary>
		///         Этот счетчик показывает значение, которое состоит из значений двух счетчиков: количества времени, отслеживаемого события и времени, измеренного частным таймером в тех же единицах.
		///          Время измеряется в единицах измерения, равных 100 нс.
		///          Этот тип счетчика отличается от других таймеров тем, что значение тактов часов сопровождающий значение счетчика тактируется из-за задержки в вызове функции.
		///          Точные типы счетчиков используются, когда стандартный системный таймер не обеспечивает необходимую точность значений.
		///          (См. тип счетчика PERF_PRECISION_100NS_TIMER в пакете развертывания).
		///       </summary>
		// Token: 0x04000D2D RID: 3373
		PrecisionTimer100Ns = 542573824,
		/// <summary>
		///         Счетчик данного типа предназначен для отслеживания средней длины очереди к ресурсу со временем.
		///          Он показывает разницу между длинами очередей, наблюдаемых в течение последних двух интервалов, деленную на продолжительность интервала.
		///          (См. тип счетчика PERF_COUNTER_QUEUELEN_TYPE в пакете развертывания).
		///       </summary>
		// Token: 0x04000D2E RID: 3374
		QueueLength = 4523008,
		/// <summary>
		///         Этот тип счетчика измеряет длину очереди произведение на интервалах 100 нс.
		///          (См. тип счетчика PERF_COUNTER_100NS_QUEUELEN_TYPE в пакете развертывания).
		///       </summary>
		// Token: 0x04000D2F RID: 3375
		QueueLength100Ns = 5571840,
		/// <summary>
		///         Этот тип счетчика измеряет произведение интервалах длина очереди базы относящиеся к определенному объекту.
		///          (См. тип счетчика PERF_COUNTER_OBJ_QUEUELEN_TYPE в пакете развертывания).
		///       </summary>
		// Token: 0x04000D30 RID: 3376
		QueueLengthObjectTime = 6620416,
		/// <summary>
		///         Счетчик данного типа показывает среднее число операций, завершенных в течение каждой секунды интервала выборки.
		///          Счетчики этого типа измеряют время в тактах системных часов.
		///          (См. тип счетчика PERF_COUNTER_COUNTER в пакете развертывания).
		///       </summary>
		// Token: 0x04000D31 RID: 3377
		RateOfCountPerSecond32 = 272696320,
		/// <summary>
		///         Счетчик данного типа показывает среднее число операций, завершенных в течение каждой секунды интервала выборки.
		///          Счетчики этого типа измеряют время в тактах системных часов.
		///          Этот тип счетчика является таким же, как <see cref="F:System.Diagnostics.PerformanceData.CounterType.RateOfCountPerSecond32" /> типа, но использует большие поля для размещения больших значений.
		///          (См. тип счетчика PERF_COUNTER_BULK_COUNT в пакете развертывания).
		///       </summary>
		// Token: 0x04000D32 RID: 3378
		RateOfCountPerSecond64 = 272696576,
		/// <summary>
		///         Счетчик данного типа хранит только последнее наблюдаемое значение.
		///          Значение используется как знаменатель счетчика, представляющего обычную арифметическую дробь.
		///          Этот тип поддерживает <see cref="F:System.Diagnostics.PerformanceData.CounterType.RawFraction32" /> тип счетчика.
		///          (См. сведения о типе счетчика PERF_RAW_BASE в пакете развертывания).
		///       </summary>
		// Token: 0x04000D33 RID: 3379
		RawBase32 = 1073939459,
		/// <summary>
		///         Счетчик данного типа хранит последнее наблюдаемое значение.
		///          Это аналогично <see cref="F:System.Diagnostics.PerformanceData.CounterType.RawBase32" />счетчик типа, за исключением того, что используются большие поля для размещения больших значений.
		///          Этот тип поддерживает <see cref="F:System.Diagnostics.PerformanceData.CounterType.RawFraction64" /> тип счетчика.
		///          (См. тип счетчика PERF_LARGE_RAW_BASE в пакете развертывания).
		///       </summary>
		// Token: 0x04000D34 RID: 3380
		RawBase64 = 1073939712,
		/// <summary>
		///         Счетчик данного типа показывает только последнее наблюдаемое значение.
		///          Он не отображает среднее значение.
		///          (См. тип счетчика PERF_COUNTER_RAWCOUNT в пакете развертывания).
		///       </summary>
		// Token: 0x04000D35 RID: 3381
		RawData32 = 65536,
		/// <summary>
		///         Этот тип счетчик показывает последнее наблюдаемое значение, не является средним значением.
		///          Это аналогично <see cref="F:System.Diagnostics.PerformanceData.CounterType.RawData32" /> счетчик типа, за исключением того, что используются большие поля для размещения больших значений.
		///          (См. тип счетчика PERF_COUNTER_LARGE_RAWCOUNT в пакете развертывания).
		///       </summary>
		// Token: 0x04000D36 RID: 3382
		RawData64 = 65792,
		/// <summary>
		///         Счетчик данного типа показывает наиболее измеренного значения в шестнадцатеричном формате.
		///          Он не отображает среднее значение.
		///          (См. тип счетчика PERF_COUNTER_RAWCOUNT_HEX в пакете развертывания).
		///       </summary>
		// Token: 0x04000D37 RID: 3383
		RawDataHex32 = 0,
		/// <summary>
		///         Этот тип счетчик отображает последнее наблюдаемое значение в шестнадцатеричном формате.
		///          Это аналогично <see cref="F:System.Diagnostics.PerformanceData.CounterType.RawDataHex32" /> счетчик типа, за исключением того, что используются большие поля для размещения больших значений.
		///          (См. тип счетчика PERF_COUNTER_LARGE_RAWCOUNT_HEX в пакете развертывания).
		///       </summary>
		// Token: 0x04000D38 RID: 3384
		RawDataHex64 = 256,
		/// <summary>
		///         Этот счетчик показывает отношение подмножества к множеству в процентах.
		///          Например он сравнивает число байтов, используемых на диске, чтобы общее число байтов на диске.
		///          Счетчики этого типа отображают только текущий процент, не является средним значением по времени.
		///          (См. тип счетчика PERF_RAW_FRACTION в пакете развертывания).
		///       </summary>
		// Token: 0x04000D39 RID: 3385
		RawFraction32 = 537003008,
		/// <summary>
		///         Этот счетчик показывает отношение подмножества к множеству в процентах.
		///          Например он сравнивает число байтов, используемых на диске, чтобы общее число байтов на диске.
		///          Счетчики этого типа отображают только текущий процент, не является средним значением по времени.
		///          Это аналогично <see cref="F:System.Diagnostics.PerformanceData.CounterType.RawFraction32" /> счетчик типа, за исключением того, что используются большие поля для размещения больших значений.
		///       </summary>
		// Token: 0x04000D3A RID: 3386
		RawFraction64 = 537003264,
		/// <summary>
		///         Этот счетчик хранит количество выполненных прерываний для измерения и используется в качестве знаменателя в дробь выборки.
		///          Этот тип поддерживает <see cref="F:System.Diagnostics.PerformanceData.CounterType.SampleFraction" /> тип счетчика.
		///       </summary>
		// Token: 0x04000D3B RID: 3387
		SampleBase = 1073939457,
		/// <summary>
		///         Счетчик данного типа показывает среднее число операций, завершенных за одну секунду.
		///          Он измеряет время в тактах системного таймера производительности.
		///          Переменная F представляет количество тактов в секунду.
		///          Значение F добавляется в уравнение для отображения результата в секундах.
		///          (См. тип счетчика PERF_SAMPLE_COUNTER в пакете развертывания).
		///       </summary>
		// Token: 0x04000D3C RID: 3388
		SampleCounter = 4260864,
		/// <summary>
		///         Этот счетчик показывает среднее отношение обращений ко всем операциям за последние два интервала.
		///          (См. тип счетчика PERF_SAMPLE_FRACTION в пакете развертывания).
		///       </summary>
		// Token: 0x04000D3D RID: 3389
		SampleFraction = 549585920
	}
}
