using System;

namespace System
{
	/// <summary>
	///         Инкапсулирует метод, который принимает 16 параметров и возвращает значение типа, указанного параметром <paramref name="TResult" /> параметр.
	///       </summary>
	/// <param name="arg1">
	///           Первый параметр метода, инкапсулируемого этим делегатом.
	///         </param>
	/// <param name="arg2">
	///           Второй параметр метода, инкапсулируемого этим делегатом.
	///         </param>
	/// <param name="arg3">
	///           Третий параметр метода, инкапсулируемого этим делегатом.
	///         </param>
	/// <param name="arg4">
	///           Четвертый параметр метода, инкапсулируемого этим делегатом.
	///         </param>
	/// <param name="arg5">
	///           Пятого параметра метода, инкапсулируемого данным делегатом.
	///         </param>
	/// <param name="arg6">
	///           Шестой параметр метода, инкапсулируемого данным делегатом.
	///         </param>
	/// <param name="arg7">
	///           Седьмого параметра метода, инкапсулируемого данным делегатом.
	///         </param>
	/// <param name="arg8">
	///           Восьмой параметр метода, инкапсулируемого данным делегатом.
	///         </param>
	/// <param name="arg9">
	///           Девятый параметр метода, инкапсулируемого данным делегатом.
	///         </param>
	/// <param name="arg10">
	///           Десятый параметр метода, инкапсулируемого данным делегатом.
	///         </param>
	/// <param name="arg11">
	///           Одиннадцатый параметр метода, инкапсулируемого данным делегатом.
	///         </param>
	/// <param name="arg12">
	///           Двенадцатый параметр метода, инкапсулируемого данным делегатом.
	///         </param>
	/// <param name="arg13">
	///           Тринадцатый параметр метода, инкапсулируемого данным делегатом.
	///         </param>
	/// <param name="arg14">
	///           Четырнадцатый параметр метода, инкапсулируемого данным делегатом.
	///         </param>
	/// <param name="arg15">
	///           Пятнадцатый параметр метода, инкапсулируемого данным делегатом.
	///         </param>
	/// <param name="arg16">
	///           Шестнадцатый параметр метода, инкапсулируемого данным делегатом.
	///         </param>
	/// <typeparam name="T1">
	///           Тип первого параметра метода, инкапсулируемого этим делегатом.
	///         </typeparam>
	/// <typeparam name="T2">
	///           Тип второго параметра метода, инкапсулируемого этим делегатом.
	///         </typeparam>
	/// <typeparam name="T3">
	///           Тип третьего параметра метода, инкапсулируемого этим делегатом.
	///         </typeparam>
	/// <typeparam name="T4">
	///           Тип четвертого параметра метода, инкапсулируемого этим делегатом.
	///         </typeparam>
	/// <typeparam name="T5">
	///           Тип пятого параметра метода, инкапсулируемого данным делегатом.
	///         </typeparam>
	/// <typeparam name="T6">
	///           Тип шестого параметра метода, инкапсулируемого данным делегатом.
	///         </typeparam>
	/// <typeparam name="T7">
	///           Тип седьмого параметра метода, инкапсулируемого данным делегатом.
	///         </typeparam>
	/// <typeparam name="T8">
	///           Тип восьмого параметра метода, инкапсулируемого данным делегатом.
	///         </typeparam>
	/// <typeparam name="T9">
	///           Тип девятого параметра метода, инкапсулируемого данным делегатом.
	///         </typeparam>
	/// <typeparam name="T10">
	///           Тип десятого параметра метода, инкапсулируемого данным делегатом.
	///         </typeparam>
	/// <typeparam name="T11">
	///           Тип одиннадцатого параметра метода, инкапсулируемого данным делегатом.
	///         </typeparam>
	/// <typeparam name="T12">
	///           Тип двенадцатого параметра метода, инкапсулируемого данным делегатом.
	///         </typeparam>
	/// <typeparam name="T13">
	///           Тип тринадцатый параметр метода, инкапсулируемого данным делегатом.
	///         </typeparam>
	/// <typeparam name="T14">
	///           Тип четырнадцатого параметра метода, инкапсулируемого данным делегатом.
	///         </typeparam>
	/// <typeparam name="T15">
	///           Тип пятнадцатого параметра метода, инкапсулируемого данным делегатом.
	///         </typeparam>
	/// <typeparam name="T16">
	///           Тип шестнадцатого параметра метода, инкапсулируемого данным делегатом.
	///         </typeparam>
	/// <typeparam name="TResult">
	///           Тип возвращаемого значения метода, инкапсулируемого данным делегатом.
	///         </typeparam>
	/// <returns>
	///         Возвращаемое значение метода, инкапсулируемого данным делегатом.
	///       </returns>
	// Token: 0x02000030 RID: 48
	// (Invoke) Token: 0x06000097 RID: 151
	public delegate TResult Func<in T1, in T2, in T3, in T4, in T5, in T6, in T7, in T8, in T9, in T10, in T11, in T12, in T13, in T14, in T15, in T16, out TResult>(T1 arg1, T2 arg2, T3 arg3, T4 arg4, T5 arg5, T6 arg6, T7 arg7, T8 arg8, T9 arg9, T10 arg10, T11 arg11, T12 arg12, T13 arg13, T14 arg14, T15 arg15, T16 arg16);
}
