using System;

namespace System.IO.IsolatedStorage
{
	/// <summary>Разрешает сравнивать изолированное хранилище, домен приложения и свидетельство сборки.</summary>
	// Token: 0x02000B6F RID: 2927
	public interface INormalizeForIsolatedStorage
	{
		/// <summary>При переопределении в производном классе, метод возвращает нормализованную копию объекта, для которого он вызывался.</summary>
		/// <returns>Нормализованный объект, представляющий экземпляр, для которого вызывался данный метод. Этот экземпляр может быть строкой, потоком или любым серийным объектом.</returns>
		// Token: 0x06006A77 RID: 27255
		object Normalize();
	}
}
