using System;

namespace System.IO.IsolatedStorage
{
	/// <summary>Осуществляет нумерацию уровней области ограниченного действия изолированного хранения, поддерживаемой классом <see cref="T:System.IO.IsolatedStorage.IsolatedStorage" />.</summary>
	// Token: 0x02000B70 RID: 2928
	[Flags]
	public enum IsolatedStorageScope
	{
		/// <summary>Изолированное хранение не используется.</summary>
		// Token: 0x04003D8E RID: 15758
		None = 0,
		/// <summary>Изолированное хранение, область действия которого ограничивается удостоверением пользователя.</summary>
		// Token: 0x04003D8F RID: 15759
		User = 1,
		/// <summary>Изолированное хранение с областью ограниченного действия для удостоверения домена приложения.</summary>
		// Token: 0x04003D90 RID: 15760
		Domain = 2,
		/// <summary>Изолированное хранение с областью ограниченного действия для удостоверения сборки.</summary>
		// Token: 0x04003D91 RID: 15761
		Assembly = 4,
		/// <summary>Изолированное хранилище может быть помещено в расположение файловой системы, способной перемещаться (если разрешено перемещение данных пользователя в основной операционной системе).</summary>
		// Token: 0x04003D92 RID: 15762
		Roaming = 8,
		/// <summary>Изолированное хранение с областью ограниченного действия для компьютера.</summary>
		// Token: 0x04003D93 RID: 15763
		Machine = 16,
		/// <summary>Изолированное хранение с областью ограниченного действия для приложения.</summary>
		// Token: 0x04003D94 RID: 15764
		Application = 32
	}
}
