using System;

namespace System.Security.Principal
{
	/// <summary>Определяет уровни олицетворения безопасности. Уровни олицетворения безопасности, указывающие степень, до которой серверный процесс может действовать от лица клиентского процесса.</summary>
	// Token: 0x020004E1 RID: 1249
	public enum TokenImpersonationLevel
	{
		/// <summary>Уровень олицетворения не назначается.</summary>
		// Token: 0x040022B8 RID: 8888
		None,
		/// <summary>Серверный процесс не может получать идентификационную информацию о клиенте и не может олицетворять клиента.</summary>
		// Token: 0x040022B9 RID: 8889
		Anonymous,
		/// <summary>Серверный процесс может получать информацию о клиенте, например, идентификаторы и привилегии безопасности, но не может олицетворять клиента. Это может оказаться полезным в том случае, если сервер экспортирует свои собственные объекты, например базы данных, из которых экспортируются таблицы и представления. Используя полученную информацию безопасности клиента, сервер может принимать решения в отношении проверки доступа, не имея возможности применять другие службы, использующие контекст безопасности клиента.</summary>
		// Token: 0x040022BA RID: 8890
		Identification,
		/// <summary>Серверный процесс может олицетворять контекст безопасности клиента в своей локальной системе. Олицетворение клиента сервером в удаленных системах невозможно.</summary>
		// Token: 0x040022BB RID: 8891
		Impersonation,
		/// <summary>Серверный процесс может олицетворять контекст безопасности клиента в удаленных системах.</summary>
		// Token: 0x040022BC RID: 8892
		Delegation
	}
}
