using System;
using System.Runtime.InteropServices;

namespace System.Security.Principal
{
	/// <summary>Задает основные роли, используемые в методе <see cref="M:System.Security.Principal.WindowsPrincipal.IsInRole(System.String)" />.</summary>
	// Token: 0x020004EB RID: 1259
	[ComVisible(true)]
	[Serializable]
	public enum WindowsBuiltInRole
	{
		/// <summary>Администраторы обладают полным и неограниченным доступом к компьютеру или домену.</summary>
		// Token: 0x04002333 RID: 9011
		Administrator = 544,
		/// <summary>Обычным пользователям не разрешено вносить в систему случайные или преднамеренные изменения. Поэтому обычные пользователи могут запускать только сертифицированные приложения. Запуск большинства приложений прежних версий им запрещен.</summary>
		// Token: 0x04002334 RID: 9012
		User,
		/// <summary>Для пользователей с гостевой учетной записью существует больше ограничений, чем для обычных пользователей.</summary>
		// Token: 0x04002335 RID: 9013
		Guest,
		/// <summary>Опытным пользователям предоставлено большинство административных прав с некоторыми ограничениями. Поэтому наряду с сертифицированными приложениями опытные пользователи могут запускать приложения прежних версий.</summary>
		// Token: 0x04002336 RID: 9014
		PowerUser,
		/// <summary>Операторы учетных записей осуществляют управление учетными записями пользователей на компьютере или в домене.</summary>
		// Token: 0x04002337 RID: 9015
		AccountOperator,
		/// <summary>Системные операторы управляют определенным компьютером.</summary>
		// Token: 0x04002338 RID: 9016
		SystemOperator,
		/// <summary>Операторы печати могут управлять принтером.</summary>
		// Token: 0x04002339 RID: 9017
		PrintOperator,
		/// <summary>Операторы архива могут переопределять ограничения по безопасности для конкретных целей (резервное копирование или восстановление файлов).</summary>
		// Token: 0x0400233A RID: 9018
		BackupOperator,
		/// <summary>Репликаторы поддерживают репликацию файлов в домене.</summary>
		// Token: 0x0400233B RID: 9019
		Replicator
	}
}
