using System;

namespace System.Xml.Schema
{
	/// <summary>
	///         Представляет собой уровень серьезности события проверки.
	///       </summary>
	// Token: 0x020005ED RID: 1517
	public enum XmlSeverityType
	{
		/// <summary>
		///         Указывает, что при проверке документа экземпляра произошла ошибка проверки.
		///          Это применяется для определения типа документа (DTD) и схемами языка определения схемы XML.
		///          Ограничения на допустимость World Wide Web Consortium (W3C) считаются ошибками.
		///          Если отсутствует обработчик событий проверки будет создано, ошибки исключение.
		///       </summary>
		// Token: 0x04002C33 RID: 11315
		Error,
		/// <summary>
		///         Указывает, что произошло событие, которое не является ошибкой.
		///          Предупреждение обычно формируется при DTD или схемы XML для проверки определенного элемента или атрибута.
		///          В отличие от ошибок предупреждения не создают исключения при отсутствии обработчика событий.
		///       </summary>
		// Token: 0x04002C34 RID: 11316
		Warning
	}
}
