using System;

namespace System.Data.SqlTypes
{
	/// <summary>Задает значения параметров сравнения для структуры <see cref="T:System.Data.SqlTypes.SqlString" />.</summary>
	// Token: 0x02000316 RID: 790
	[Flags]
	public enum SqlCompareOptions
	{
		/// <summary>Задает параметры по умолчанию для сравнения объектов типа <see cref="T:System.Data.SqlTypes.SqlString" />.</summary>
		// Token: 0x040018DB RID: 6363
		None = 0,
		/// <summary>Указывает, что при выполнении сравнения объектов <see cref="T:System.Data.SqlTypes.SqlString" /> не должен учитываться регистр.</summary>
		// Token: 0x040018DC RID: 6364
		IgnoreCase = 1,
		/// <summary>Задает игнорирование несамостоятельных знаков (например, диакритических) при сравнении объектов типа  <see cref="T:System.Data.SqlTypes.SqlString" />. В стандарте Юникод несамостоятельные знаки определяются как знаки, которые в сочетании с основными знаками образуют новый знак. Несамостоятельные знаки при отображении не занимают место знака. Дополнительные сведения о несамостоятельных знаках без пробелов см. на веб-сайте стандарта Юникод по адресу https://www.unicode.org.</summary>
		// Token: 0x040018DD RID: 6365
		IgnoreNonSpace = 2,
		/// <summary>Задает игнорирование типа японской азбуки при сравнении объектов типа <see cref="T:System.Data.SqlTypes.SqlString" />. Типы японской азбуки Каны обозначают символы хираганы и катаканы, представляющие звуки японского языка. Хирагана используется для японских выражений и слов, а катакана — для слов, заимствованных из других языков, например "компьютер" и "Интернет". Для обозначения любого звука может быть использована как хирагана, так и катакана. Если выбрано это значение, знаки хирагана и катакана для одного и того же звука считаются равными.</summary>
		// Token: 0x040018DE RID: 6366
		IgnoreKanaType = 8,
		/// <summary>Задает игнорирование ширины знака при сравнении объектов типа <see cref="T:System.Data.SqlTypes.SqlString" />. Например, японские знаки катакана могут быть представлены в полную ширину или в половину ширины. Если выбрано это значение, знаки катакана, написанные в полную ширину, считаются равными знакам, написанным в половину ширины.</summary>
		// Token: 0x040018DF RID: 6367
		IgnoreWidth = 16,
		/// <summary>Задает сортировку на основе числового значения символов вместо сортировки по алфавиту.</summary>
		// Token: 0x040018E0 RID: 6368
		BinarySort = 32768,
		/// <summary>Выполняет двоичную сортировку.</summary>
		// Token: 0x040018E1 RID: 6369
		BinarySort2 = 16384
	}
}
