using System;

namespace System.Data.SqlClient
{
	/// <summary>Побитовый флаг, который определяет один или несколько параметров для использования с экземпляром <see cref="T:System.Data.SqlClient.SqlBulkCopy" />.</summary>
	// Token: 0x020001AC RID: 428
	[Flags]
	public enum SqlBulkCopyOptions
	{
		/// <summary>Для всех параметров используйте значения по умолчанию.</summary>
		// Token: 0x04000D66 RID: 3430
		Default = 0,
		/// <summary>Сохраните исходные значения  идентификаторов. Если не указаны, значения идентификаторов назначаются целевым объектом.</summary>
		// Token: 0x04000D67 RID: 3431
		KeepIdentity = 1,
		/// <summary>Проверьте ограничения при вставке данных. По умолчанию ограничения не проверяются.</summary>
		// Token: 0x04000D68 RID: 3432
		CheckConstraints = 2,
		/// <summary>Получите блокировку массовых обновлений в течение выполнения операции массового копирования. Если не указано, используются блокировки строк.</summary>
		// Token: 0x04000D69 RID: 3433
		TableLock = 4,
		/// <summary>Сохраните значения NULL в целевой таблице независимо от параметров значений по умолчанию. Если не указано, значения NULL заменяются значениями по умолчанию там, где это применимо.</summary>
		// Token: 0x04000D6A RID: 3434
		KeepNulls = 8,
		/// <summary>Если указано, заставьте сервер запускать триггеры вставки для строк, вставляемых в базу данных сервера.</summary>
		// Token: 0x04000D6B RID: 3435
		FireTriggers = 16,
		/// <summary>Если указано, каждый пакет операции массового копирования будет выполняться в рамках транзакции. Если указать этот параметр, а также предоставить объект <see cref="T:System.Data.SqlClient.SqlTransaction" /> в конструктор, возникнет <see cref="T:System.ArgumentException" />.</summary>
		// Token: 0x04000D6C RID: 3436
		UseInternalTransaction = 32,
		/// <summary>Если параметр AllowEncryptedValueModifications задан, можно осуществлять массовое копирование зашифрованных данных между таблицами или базами данных без расшифровки данных. Как правило, приложению нужно выбирать данные из зашифрованных столбцов одной таблицы без расшифровки данных (приложение должно подключиться к базе данных с ключевым словом, задающим отключение параметра шифрования столбца), а затем использовать эту возможность для массовой вставки данных, которые остаются зашифрованными. Дополнительные сведения см. в разделе Всегда зашифровано.  
		/// Будьте внимательны при указании параметра AllowEncryptedValueModifications: это может привести к повреждению базы данных, так как драйвер не проверяет, действительно ли данные зашифрованы и зашифрованы ли они правильно, с использованием того же типа шифрования, алгоритма и ключа, что и в целевом столбце.</summary>
		// Token: 0x04000D6D RID: 3437
		AllowEncryptedValueModifications = 64
	}
}
