using System;

namespace System.Data.SqlClient
{
	/// <summary>Указывает, что функция "Всегда зашифровано" включена в подключении. Обратите внимание, что эти параметры нельзя использовать для обхода шифрования и получения доступа к данным в виде обычного текста. Дополнительные сведения см. в разделе Always Encrypted (ядро СУБД).</summary>
	// Token: 0x02000283 RID: 643
	public enum SqlConnectionColumnEncryptionSetting
	{
		/// <summary>Указывает, что подключение не использует функцию "Всегда зашифровано". Следует использовать, если нет отправляемых через подключение запросов, которые получают доступ к зашифрованным столбцам.</summary>
		// Token: 0x040014AF RID: 5295
		Disabled,
		/// <summary>Включает функцию "Всегда зашифровано" для подключения. Параметры запроса, которые соответствуют зашифрованным столбцам, будут прозрачно зашифрованы, а результаты запроса из зашифрованных столбцов будут прозрачно расшифрованы.</summary>
		// Token: 0x040014B0 RID: 5296
		Enabled
	}
}
