using System;

namespace System.Data.SqlClient
{
	/// <summary>Определяет способ отправки и получения данных при чтении и записи зашифрованных столбцов. В зависимости от конкретного запроса влияние на производительность может быть уменьшено за счет обхода обработки драйвером данных в режиме Always Encrypted при использовании незашифрованных столбцов. Обратите внимание, что эти параметры нельзя использовать для обхода шифрования и получения доступа к данным в виде обычного текста. Дополнительные сведения см. в разделе Always Encrypted (ядро СУБД).</summary>
	// Token: 0x02000285 RID: 645
	public enum SqlCommandColumnEncryptionSetting
	{
		/// <summary>Указывает, что команда должна использовать по умолчанию параметр "Всегда зашифрованы" в строке подключения.</summary>
		// Token: 0x040014B8 RID: 5304
		UseConnectionSetting,
		/// <summary>Разрешает режим "Всегда зашифрованы" для запроса.</summary>
		// Token: 0x040014B9 RID: 5305
		Enabled,
		/// <summary>Указывает, что только результаты выполнения команды должны обрабатываться в драйвере в режиме "Всегда зашифрованы". Используйте это значение, если команда не имеет параметров, требующих шифрования.</summary>
		// Token: 0x040014BA RID: 5306
		ResultSetOnly,
		/// <summary>Отменяет режим "Всегда зашифрованы" для запроса.</summary>
		// Token: 0x040014BB RID: 5307
		Disabled
	}
}
