using System;

namespace System.Data.SqlClient
{
	/// <summary>Указывает источник уведомления, полученного обработчиком события зависимости.</summary>
	// Token: 0x02000214 RID: 532
	public enum SqlNotificationSource
	{
		/// <summary>Данные изменились, например, выполнена операция вставки, обновления, удаления или усечения.</summary>
		// Token: 0x040010BF RID: 4287
		Data,
		/// <summary>Истекло время ожидания подписки.</summary>
		// Token: 0x040010C0 RID: 4288
		Timeout,
		/// <summary>Объект базы данных изменился; например, связанный с запросом объект удален или изменен.</summary>
		// Token: 0x040010C1 RID: 4289
		Object,
		/// <summary>Состояние базы данных изменилось, например, связанная с запросом база данных удалена или отсоединена.</summary>
		// Token: 0x040010C2 RID: 4290
		Database,
		/// <summary>Произошло событие, связанное с системой. Например, произошла внутренняя ошибка, перезапущен сервере или интенсивное использование ресурса привело к недействительности.</summary>
		// Token: 0x040010C3 RID: 4291
		System,
		/// <summary>Инструкция Transact-SQL не поддерживает уведомления; например, выполняется инструкция SELECT, для которой не могут генерироваться уведомления, или инструкция, отличная от SELECT.</summary>
		// Token: 0x040010C4 RID: 4292
		Statement,
		/// <summary>Среда выполнения не совместима с уведомлениями; например, задан уровень изоляции снимка или несовместим один или более параметров SET.</summary>
		// Token: 0x040010C5 RID: 4293
		Environment,
		/// <summary>При выполнении произошла ошибка во время выполнения.</summary>
		// Token: 0x040010C6 RID: 4294
		Execution,
		/// <summary>Только для внутреннего использования, а не для непосредственного использования в коде.</summary>
		// Token: 0x040010C7 RID: 4295
		Owner,
		/// <summary>Используется, когда отправленный сервером параметр источника не распознан клиентом.</summary>
		// Token: 0x040010C8 RID: 4296
		Unknown = -1,
		/// <summary>Получено уведомление, инициированное клиентом, такое как клиентский таймаут, или уведомление о попытке добавления команды в зависимость, которая уже действует.</summary>
		// Token: 0x040010C9 RID: 4297
		Client = -2
	}
}
