using System;

namespace System
{
	/// <summary>Задает параметры для <see cref="T:System.UriParser" />.</summary>
	// Token: 0x0200014B RID: 331
	[Flags]
	public enum GenericUriParserOptions
	{
		/// <summary>Средство анализа:
		///
		/// Требует наличия центра.
		/// Преобразует символы обратной косой черты в символы косой черты.
		/// Отменяет преобразование точек пути, символов косой черты и символов обратной косой черты.
		/// Удаляет конечные точки, пустые сегменты и сегменты, содержащие только точки.</summary>
		// Token: 0x04000581 RID: 1409
		Default = 0,
		/// <summary>Это средство анализа разрешает использование сертификатов на основе реестра.</summary>
		// Token: 0x04000582 RID: 1410
		GenericAuthority = 1,
		/// <summary>Это средство анализа разрешает использование URI без сертификата.</summary>
		// Token: 0x04000583 RID: 1411
		AllowEmptyAuthority = 2,
		/// <summary>Данная схема не определяет часть пользовательской информации.</summary>
		// Token: 0x04000584 RID: 1412
		NoUserInfo = 4,
		/// <summary>Данная схема не определяет порт.</summary>
		// Token: 0x04000585 RID: 1413
		NoPort = 8,
		/// <summary>Данная схема не определяет часть запроса.</summary>
		// Token: 0x04000586 RID: 1414
		NoQuery = 16,
		/// <summary>Данная схема не определяет часть фрагмента.</summary>
		// Token: 0x04000587 RID: 1415
		NoFragment = 32,
		/// <summary>Средство анализа не преобразует символы обратной косой черты в символы косой черты.</summary>
		// Token: 0x04000588 RID: 1416
		DontConvertPathBackslashes = 64,
		/// <summary>Средство анализа не канонизирует URI.</summary>
		// Token: 0x04000589 RID: 1417
		DontCompressPath = 128,
		/// <summary>Средство анализа не восстанавливает точки в составе пути, символы косой черты или символы обратной косой черты.</summary>
		// Token: 0x0400058A RID: 1418
		DontUnescapePathDotsAndSlashes = 256,
		/// <summary>Средство анализа поддерживает разбор международных доменных имен (IDN) узлов. Используются ли IDN, зависит от значений параметров конфигурации.</summary>
		// Token: 0x0400058B RID: 1419
		Idn = 512,
		/// <summary>Средство анализа поддерживает правила анализа, определенные стандартом RFC 3987 для международных идентификаторов ресурсов (IRI). Используются ли IRI, зависит от значений параметров конфигурации.</summary>
		// Token: 0x0400058C RID: 1420
		IriParsing = 1024
	}
}
