using System;

namespace System
{
	/// <summary>Предоставляет возможные значения конфигурационных параметров <see cref="T:System.Configuration.IdnElement" /> в пространстве имен <see cref="N:System.Configuration" />.</summary>
	// Token: 0x02000159 RID: 345
	public enum UriIdnScope
	{
		/// <summary>При этом значении имена доменов в Юникоде не будут преобразовываться в их эквиваленты в Punycode. Это значение по умолчанию, которое совместимо с поведением платформы .NET Framework 2.0.</summary>
		// Token: 0x04000628 RID: 1576
		None,
		/// <summary>При этом значении имена всех внешних доменов из Юникода будут преобразовываться в их эквиваленты в Punycode (IDN-имена). В этом случае, чтобы обрабатывать международные имена в локальной интрасети, DNS-серверы, которые используются для интрасети, должны поддерживать имена в Юникоде.</summary>
		// Token: 0x04000629 RID: 1577
		AllExceptIntranet,
		/// <summary>При этом значении имена доменов из Юникода будут преобразовываться в их эквиваленты в Punycode (IDN-имена).</summary>
		// Token: 0x0400062A RID: 1578
		All
	}
}
