using System;

namespace System.Management.Instrumentation
{
	/// <summary>
	///         Определяет значения, которые указывают модель размещения для поставщика.
	///
	///         Примечание. Работа над библиотеками .NET инструментария WMI завершена. В дальнейшем не предвидится никаких разработок, улучшений или обновлений в отношении не связанных с безопасностью проблем, влияющих на эти библиотеки.
	///          Для всех новых разработок следует использовать API-интерфейсы MI.
	///       </summary>
	// Token: 0x02000382 RID: 898
	public enum ManagementHostingModel
	{
		/// <summary>
		///         Активирует поставщик в качестве несвязанного поставщика.
		///       </summary>
		// Token: 0x04000D08 RID: 3336
		Decoupled,
		/// <summary>
		///         Активирует поставщик в хост-процессе поставщика, который выполняется под учетной записью LocalService.
		///       </summary>
		// Token: 0x04000D09 RID: 3337
		LocalService = 2,
		/// <summary>
		///         Активирует поставщик в хост-процессе поставщика, который выполняется под учетной записью LocalSystem.
		///       </summary>
		// Token: 0x04000D0A RID: 3338
		LocalSystem,
		/// <summary>
		///         Активирует поставщик в хост-процессе поставщика, который выполняется под учетной записью NetworkService.
		///       </summary>
		// Token: 0x04000D0B RID: 3339
		NetworkService = 1
	}
}
