using System;

namespace System.Security.Cryptography.X509Certificates
{
	/// <summary>Определяет состояние цепочки X509.</summary>
	// Token: 0x020002C2 RID: 706
	[Flags]
	public enum X509ChainStatusFlags
	{
		/// <summary>Указывает, что цепочка X509 не содержит ошибок.</summary>
		// Token: 0x04000C78 RID: 3192
		NoError = 0,
		/// <summary>Указывает, что цепочка X509 является недопустимой из-за недопустимого значения времени (например, значения, указывающего сертификат с истекшим сроком действия).</summary>
		// Token: 0x04000C79 RID: 3193
		NotTimeValid = 1,
		/// <summary>Не рекомендуется. Указывает, что сертификат ЦС (центра сертификации) и выданный сертификат имеют сроки действия, которые не являются вложенными. Например, сертификат ЦС может действовать с 1 января по 1 декабря, а выданный сертификат — со 2 января по 2 декабря, что означает, что сроки действия не являются вложенными.</summary>
		// Token: 0x04000C7A RID: 3194
		NotTimeNested = 2,
		/// <summary>Указывает, что цепочка X509 является недопустимой из-за отозванного сертификата.</summary>
		// Token: 0x04000C7B RID: 3195
		Revoked = 4,
		/// <summary>Указывает, что цепочка X509 является недопустимой из-за недопустимой подписи сертификата.</summary>
		// Token: 0x04000C7C RID: 3196
		NotSignatureValid = 8,
		/// <summary>Указывает, что использование ключа недопустимо.</summary>
		// Token: 0x04000C7D RID: 3197
		NotValidForUsage = 16,
		/// <summary>Указывает, что цепочка X509 является недопустимой из-за ненадежного корневого сертификата.</summary>
		// Token: 0x04000C7E RID: 3198
		UntrustedRoot = 32,
		/// <summary>Указывает, что невозможно определить, был ли сертификат отозван. Это может быть вызвано с тем, что список отзыва сертификатов (CRL) отключен или недоступен.</summary>
		// Token: 0x04000C7F RID: 3199
		RevocationStatusUnknown = 64,
		/// <summary>Указывает на невозможность построения цепочки X509.</summary>
		// Token: 0x04000C80 RID: 3200
		Cyclic = 128,
		/// <summary>Указывает, что цепочка X509 является недопустимой из-за недопустимого расширения.</summary>
		// Token: 0x04000C81 RID: 3201
		InvalidExtension = 256,
		/// <summary>Указывает, что цепочка X509 является недопустимой из-за недопустимых ограничений политик.</summary>
		// Token: 0x04000C82 RID: 3202
		InvalidPolicyConstraints = 512,
		/// <summary>Указывает, что цепочка X509 является недопустимой из-за недопустимых базовых ограничений.</summary>
		// Token: 0x04000C83 RID: 3203
		InvalidBasicConstraints = 1024,
		/// <summary>Указывает, что цепочка X509 является недопустимой из-за недопустимых ограничений имен.</summary>
		// Token: 0x04000C84 RID: 3204
		InvalidNameConstraints = 2048,
		/// <summary>Указывает, что у сертификата отсутствует поддерживаемое ограничение имен или имеется неподдерживаемое ограничение имен.</summary>
		// Token: 0x04000C85 RID: 3205
		HasNotSupportedNameConstraint = 4096,
		/// <summary>Указывает, что сертификат имеет неопределенное ограничение имен.</summary>
		// Token: 0x04000C86 RID: 3206
		HasNotDefinedNameConstraint = 8192,
		/// <summary>Указывает, что сертификат имеет недопустимое ограничение имен.</summary>
		// Token: 0x04000C87 RID: 3207
		HasNotPermittedNameConstraint = 16384,
		/// <summary>Указывает, что цепочка X509 является недопустимой, так как сертификат исключил ограничение имен.</summary>
		// Token: 0x04000C88 RID: 3208
		HasExcludedNameConstraint = 32768,
		/// <summary>Указывает на невозможность построения цепочки X509 до корневого сертификата.</summary>
		// Token: 0x04000C89 RID: 3209
		PartialChain = 65536,
		/// <summary>Указывает, что список доверия сертификатов (CTL) является недопустимым из-за недопустимого значения времени (например, значения, указывающего, что срок действия списка CTL истек).</summary>
		// Token: 0x04000C8A RID: 3210
		CtlNotTimeValid = 131072,
		/// <summary>Указывает, что список доверия сертификатов (CTL) содержит недопустимую подпись.</summary>
		// Token: 0x04000C8B RID: 3211
		CtlNotSignatureValid = 262144,
		/// <summary>Указывает, что список доверия сертификатов (CTL) недопустим для использования в данном случае.</summary>
		// Token: 0x04000C8C RID: 3212
		CtlNotValidForUsage = 524288,
		/// <summary>Указывает, что веб-список отзыва сертификатов (CRL), от которого зависит цепочка X509, в настоящий момент находится в автономном режиме.</summary>
		// Token: 0x04000C8D RID: 3213
		OfflineRevocation = 16777216,
		/// <summary>Указывает, что в сертификате отсутствует расширение политики сертификата. Эта ошибка возникает в том случае, если групповая политика указала, что все сертификаты должны иметь политику сертификата.</summary>
		// Token: 0x04000C8E RID: 3214
		NoIssuanceChainPolicy = 33554432,
		/// <summary>Указывает, что сертификат явно не является доверенным.</summary>
		// Token: 0x04000C8F RID: 3215
		ExplicitDistrust = 67108864,
		/// <summary>Указывает, что сертификат не поддерживает критическое расширение.</summary>
		// Token: 0x04000C90 RID: 3216
		HasNotSupportedCriticalExtension = 134217728,
		/// <summary>Указывает, что сертификат не был подписан с помощью надежной подписи. Как правило, это означает, что для создания хэша сертификата использовались алгоритмы хэширования MD2 или MD5.</summary>
		// Token: 0x04000C91 RID: 3217
		HasWeakSignature = 1048576
	}
}
