using System;
using System.Runtime.InteropServices;

namespace System.Runtime.Serialization
{
	/// <summary>Определяет набор флагов, которые указывают контекст источника или назначения для потока во время сериализации.</summary>
	// Token: 0x02000674 RID: 1652
	[Flags]
	[ComVisible(true)]
	[Serializable]
	public enum StreamingContextStates
	{
		/// <summary>Указывает, что контекст источника или назначения представляет другой процесс на том же компьютере.</summary>
		// Token: 0x04002798 RID: 10136
		CrossProcess = 1,
		/// <summary>Указывает, что контекст источника или назначения представляет другой компьютер.</summary>
		// Token: 0x04002799 RID: 10137
		CrossMachine = 2,
		/// <summary>Указывает, что контекст источника или назначения является файлом. Пользователи могут предполагать, что файлы будут существовать дольше, чем создавшие их процессы, и поэтому не сериализировать объекты так, чтобы при десериализации требовался доступ к любым данным текущего процесса.</summary>
		// Token: 0x0400279A RID: 10138
		File = 4,
		/// <summary>Указывает, что контекст источника или назначения представляет материализованное хранилище, например базу данных, файл или другое резервное хранилище. Пользователи могут предполагать, что хранимые данные будут существовать дольше, чем создавшие их процессы, и поэтому не сериализировать объекты так, чтобы при десериализации требовался доступ к любым данным текущего процесса.</summary>
		// Token: 0x0400279B RID: 10139
		Persistence = 8,
		/// <summary>Указывает, что данные находятся в удаленном контексте, расположение которого неизвестно. Пользователи не имеют оснований полагать, что этот контекст будет располагаться на том же компьютере.</summary>
		// Token: 0x0400279C RID: 10140
		Remoting = 16,
		/// <summary>Указывает, что контекст сериализации неизвестен.</summary>
		// Token: 0x0400279D RID: 10141
		Other = 32,
		/// <summary>Указывает, что выполняется клонирование графа объекта. Пользователи могут предполагать, что клонированный граф будет и дальше существовать в том же процессе, и поэтому могут безопасно обращаться к дескрипторам и другим ссылкам на неуправляемые ресурсы.</summary>
		// Token: 0x0400279E RID: 10142
		Clone = 64,
		/// <summary>Указывает, что контекст источника или назначения представляет другой домен приложения. (Описание доменов приложений можно найти здесь.)</summary>
		// Token: 0x0400279F RID: 10143
		CrossAppDomain = 128,
		/// <summary>Указывает, что сериализованные данные могут быть переданы в любые другие контексты и быть получены оттуда.</summary>
		// Token: 0x040027A0 RID: 10144
		All = 255
	}
}
