using System;

namespace System.Runtime.ConstrainedExecution
{
	/// <summary>Задает поведение метода при его вызове из области с ограничением исполнения.</summary>
	// Token: 0x020007D3 RID: 2003
	public enum Cer
	{
		/// <summary>Метод, тип или сборка не поддерживает понятие CER. Этот метод не использует преимущества гарантий для области ограниченного выполнения. В этом случае подразумевается следующее:</summary>
		// Token: 0x04002D17 RID: 11543
		None,
		/// <summary>При возникновении исключительных условий метод может завершиться неудачно. В этом случае метод сообщит о удачном или неудачном завершении вызвавшему его методу. Тело метода должно быть заключено в конструкцию CER, чтобы метод мог гарантированно передать возвращаемое значение.</summary>
		// Token: 0x04002D18 RID: 11544
		MayFail,
		/// <summary>При возникновении исключительных условий, метод гарантированно завершится успешно. Всегда следует заключать вызываемый метод в конструкцию CER, даже если он вызывается из области, где CER не используется. Метод завершается успешно, если он выполняет то, для чего предназначен. Например, если пометить свойство <see cref="P:System.Collections.ArrayList.Count" /> атрибутом ReliabilityContractAttribute(Cer.Success), это подразумевает, что когда свойство выполняется в области CER, оно всегда возвращает число элементов в <see cref="T:System.Collections.ArrayList" /> и никогда не оставляет внутренние поля неопределенными.</summary>
		// Token: 0x04002D19 RID: 11545
		Success
	}
}
