using System;
using System.Runtime.InteropServices;

namespace System.Configuration.Internal
{
	/// <summary>Определяет интерфейсы, которые позволяет внутренней инфраструктуре платформы .NET Framework настраивать конфигурацию.</summary>
	// Token: 0x0200007F RID: 127
	[ComVisible(false)]
	public interface IInternalConfigClientHost
	{
		/// <summary>Возвращает путь к файлу конфигурации приложения.</summary>
		/// <returns>Строка, представляющая путь к файлу конфигурации приложения.</returns>
		// Token: 0x06000438 RID: 1080
		string GetExeConfigPath();

		/// <summary>Возвращает строку, представляющую путь к известному локальному пользовательскому файлу конфигурации.</summary>
		/// <returns>Строка, представляющая путь к известному локальному пользовательскому файлу конфигурации.</returns>
		// Token: 0x06000439 RID: 1081
		string GetLocalUserConfigPath();

		/// <summary>Возвращает строку, представляющая путь к известному перемещаемому файлу пользовательской конфигурации.</summary>
		/// <returns>Строка, представляющая путь к известному перемещаемому файлу пользовательской конфигурации.</returns>
		// Token: 0x0600043A RID: 1082
		string GetRoamingUserConfigPath();

		/// <summary>Возвращает значение, определяющее, является ли путь файла конфигурации таким же, как известный на текущий момент путь файла конфигурации.</summary>
		/// <param name="configPath">Строка, представляющая путь к файлу конфигурации приложения.</param>
		/// <returns>
		///   <see langword="true" /> если строка, представляющая путь конфигурации такая же, как путь к файлу конфигурации приложения; <see langword="false" /> если строка, представляющая путь конфигурации не такая же, как путь к файлу конфигурации приложения.</returns>
		// Token: 0x0600043B RID: 1083
		bool IsExeConfig(string configPath);

		/// <summary>Возвращает значение, определяющее, является ли путь файла конфигурации таким же, как путь файла конфигурации для известного на текущий момент локального пользователя.</summary>
		/// <param name="configPath">Строка, представляющая путь к файлу конфигурации приложения.</param>
		/// <returns>
		///   <see langword="true" /> если строка, представляющая путь конфигурации такая же, как путь к известному локальному пользовательскому файлу конфигурации; в противном случае — <see langword="false" />.</returns>
		// Token: 0x0600043C RID: 1084
		bool IsLocalUserConfig(string configPath);

		/// <summary>Возвращает значение, определяющее, является ли путь файла конфигурации таким же, как путь файла конфигурации для известного на текущий момент перемещаемого пользователя.</summary>
		/// <param name="configPath">Строка, представляющая путь к файлу конфигурации приложения.</param>
		/// <returns>
		///   <see langword="true" /> если строка, представляющая путь конфигурации такая же, как путь к известному перемещаемому файлу пользовательской конфигурации; в противном случае — <see langword="false" />.</returns>
		// Token: 0x0600043D RID: 1085
		bool IsRoamingUserConfig(string configPath);
	}
}
