using System;

namespace System.Net.Mime
{
	/// <summary>Указывает сведения о заголовке Content-Transfer-Encoding для вложения сообщения электронной почты.</summary>
	// Token: 0x02000814 RID: 2068
	public enum TransferEncoding
	{
		/// <summary>Указывает, что передаваемые данные кодируются неизвестным образом.</summary>
		// Token: 0x04002804 RID: 10244
		Unknown = -1,
		/// <summary>Кодирует данные, состоящие из печатных символов, в кодировке US-ASCII. См. раздел 6.7 стандарта RFC 2406.</summary>
		// Token: 0x04002805 RID: 10245
		QuotedPrintable,
		/// <summary>Кодирует потоковые данные. См. раздел 6.8 стандарта RFC 2406.</summary>
		// Token: 0x04002806 RID: 10246
		Base64,
		/// <summary>Используется для данных, которые не кодируются. Такие данные представляют собой 7-разрядные символы US-ASCII с общей длинной строк, не превышающей 1000 символов. См. раздел 2.7 стандарта RFC 2406.</summary>
		// Token: 0x04002807 RID: 10247
		SevenBit,
		/// <summary>Данные представляют собой 8-разрядные символы, которые могут представлять международные символы с общей длинной строк, не превышающей 1000 8-разрядных символов. Дополнительные сведения об этом 8-битном расширении транспорта MIME см. в IETF RFC 6152.</summary>
		// Token: 0x04002808 RID: 10248
		EightBit
	}
}
