using System;

namespace System.Dynamic
{
	/// <summary>
	///         Представляет информацию о динамической операции получения члена, сообщающую, должен ли этот член вызывать свойства при выполнении операции получения.
	///       </summary>
	// Token: 0x0200031C RID: 796
	public interface IInvokeOnGetBinder
	{
		/// <summary>
		///         Возвращает значение, указывающее, следует ли данная операция получения члена вызывать свойства при выполнении операции get.
		///          Если этот интерфейс не присутствует значение по умолчанию — true.
		///       </summary>
		/// <returns>
		///         Значение true, если данная операция получения члена должна вызывать свойства при выполнении операции получения; в противном случае — значение false.
		///       </returns>
		// Token: 0x17000428 RID: 1064
		// (get) Token: 0x060017F8 RID: 6136
		bool InvokeOnGet { get; }
	}
}
