using System;

namespace System.Data
{
	/// <summary>Описывает текущее состояние подключения к источнику данных.</summary>
	// Token: 0x020000A8 RID: 168
	[Flags]
	public enum ConnectionState
	{
		/// <summary>Соединение закрыто.</summary>
		// Token: 0x04000777 RID: 1911
		Closed = 0,
		/// <summary>Подключение открыто.</summary>
		// Token: 0x04000778 RID: 1912
		Open = 1,
		/// <summary>Объект подключения подключается к источнику данных.</summary>
		// Token: 0x04000779 RID: 1913
		Connecting = 2,
		/// <summary>Объект подключения выполняет команду. (Это значение зарезервировано для будущих версий продукта.)</summary>
		// Token: 0x0400077A RID: 1914
		Executing = 4,
		/// <summary>Объект подключения получает данные. (Это значение зарезервировано для будущих версий продукта.)</summary>
		// Token: 0x0400077B RID: 1915
		Fetching = 8,
		/// <summary>Подключение к источнику данных разорвано. Это может произойти только после открытия подключения. Подключение в этом режиме может быть закрыто, а затем повторно открыто. (Это значение зарезервировано для будущих версий продукта.)</summary>
		// Token: 0x0400077C RID: 1916
		Broken = 16
	}
}
