using System;

namespace System.Data
{
	/// <summary>Указывает тип данных поля, свойства или объекта <see langword="Parameter" /> поставщика данных .NET Framework.</summary>
	// Token: 0x020000DF RID: 223
	public enum DbType
	{
		/// <summary>Поток переменной длины из символов, не принадлежащих кодировке Юникод. В нем может быть от 1 до 8000 символов.</summary>
		// Token: 0x04000860 RID: 2144
		AnsiString,
		/// <summary>Поток переменной длины из двоичных данных, имеющий длину от 1 до 8000 байт.</summary>
		// Token: 0x04000861 RID: 2145
		Binary,
		/// <summary>8-разрядное целое число без знака, которое может принимать значения от 0 до 255.</summary>
		// Token: 0x04000862 RID: 2146
		Byte,
		/// <summary>Простой тип для представления логических значений <see langword="true" /> и <see langword="false" />.</summary>
		// Token: 0x04000863 RID: 2147
		Boolean,
		/// <summary>Значение типа currency, лежащее в диапазоне от -2 63 (или -922 337 203 685 477,5808) до 2 63 -1 (или +922 337 203 685 477,5807) и имеющее точность до одной десятитысячной денежной единицы.</summary>
		// Token: 0x04000864 RID: 2148
		Currency,
		/// <summary>Тип, представляющий значение даты.</summary>
		// Token: 0x04000865 RID: 2149
		Date,
		/// <summary>Тип, представляющий значение даты и времени.</summary>
		// Token: 0x04000866 RID: 2150
		DateTime,
		/// <summary>Простой тип для представления значений в диапазоне от 1,0 x 10 -28 до приблизительно 7,9 x 10 28 с 28–29 значимыми цифрами.</summary>
		// Token: 0x04000867 RID: 2151
		Decimal,
		/// <summary>Тип для представления значений с плавающей запятой в диапазоне от 5,0 x 10 -324 до приблизительно 1,7 x 10 308 с точностью до 15–16 знаков.</summary>
		// Token: 0x04000868 RID: 2152
		Double,
		/// <summary>Глобальный уникальный идентификатор (GUID).</summary>
		// Token: 0x04000869 RID: 2153
		Guid,
		/// <summary>Целочисленный тип для представления 16-разрядных целых чисел со знаком в диапазоне от -32768 до 32767.</summary>
		// Token: 0x0400086A RID: 2154
		Int16,
		/// <summary>Целочисленный тип для представления 32-разрядных целых чисел со знаком в диапазоне от -2147483648 до 2147483647.</summary>
		// Token: 0x0400086B RID: 2155
		Int32,
		/// <summary>Целочисленный тип для представления 64-разрядных целых чисел со знаком в диапазоне от -9223372036854775808 до 9223372036854775807.</summary>
		// Token: 0x0400086C RID: 2156
		Int64,
		/// <summary>Общий тип для представления всех значений и ссылок, которые не могут быть представлены ни одним другим значением <see langword="DbType" />.</summary>
		// Token: 0x0400086D RID: 2157
		Object,
		/// <summary>Целочисленный тип для представления 8-разрядных целых чисел со знаком в диапазоне от -128 до 127.</summary>
		// Token: 0x0400086E RID: 2158
		SByte,
		/// <summary>Тип для представления значений с плавающей запятой в диапазоне от 1,5 x 10 -45 до приблизительно 3,4 x 10 38 с точностью до 7знаков.</summary>
		// Token: 0x0400086F RID: 2159
		Single,
		/// <summary>Тип, представляющий символьные строки в Юникоде.</summary>
		// Token: 0x04000870 RID: 2160
		String,
		/// <summary>Тип, представляющий значение <see langword="DateTime" /> SQL Server. Если нужно использовать значение <see langword="time" /> SQL Server, необходимо воспользоваться <see cref="F:System.Data.SqlDbType.Time" />.</summary>
		// Token: 0x04000871 RID: 2161
		Time,
		/// <summary>Целочисленный тип для представления 16-разрядных целых чисел без знака в диапазоне от 0 до 65535.</summary>
		// Token: 0x04000872 RID: 2162
		UInt16,
		/// <summary>Целочисленный тип для представления 32-разрядных целых чисел со значениями от 0 до 4294967295.</summary>
		// Token: 0x04000873 RID: 2163
		UInt32,
		/// <summary>Целочисленный тип для представления 64-разрядных целых чисел со значениями от 0 до 18446744073709551615.</summary>
		// Token: 0x04000874 RID: 2164
		UInt64,
		/// <summary>Числовое значение переменной длины.</summary>
		// Token: 0x04000875 RID: 2165
		VarNumeric,
		/// <summary>Поток фиксированной длины из символов, не принадлежащих кодировке Юникод.</summary>
		// Token: 0x04000876 RID: 2166
		AnsiStringFixedLength,
		/// <summary>Строка фиксированной длины из символов Юникода.</summary>
		// Token: 0x04000877 RID: 2167
		StringFixedLength,
		/// <summary>Проанализированное представление фрагмента или документа XML.</summary>
		// Token: 0x04000878 RID: 2168
		Xml = 25,
		/// <summary>Данные даты и времени. Значение даты может находиться в диапазоне от 1 января 1 г. н. э. до 31 декабря 9999 года н. э. Значение времени может находиться в диапазоне от 00:00:00 до 23:59:59,9999999 с точностью до 100 наносекунд.</summary>
		// Token: 0x04000879 RID: 2169
		DateTime2,
		/// <summary>Данные даты и времени с учетом часового пояса. Значение даты может находиться в диапазоне от 1 января 1 г. н. э. до 31 декабря 9999 года н. э. Значение времени может находиться в диапазоне от 00:00:00 до 23:59:59,9999999 с точностью до 100 наносекунд. Часовые пояса могут находиться в диапазоне от -14:00 до +14:00.</summary>
		// Token: 0x0400087A RID: 2170
		DateTimeOffset
	}
}
