using System;

namespace System.Data
{
	/// <summary>Указывает режим блокировки транзакций для подключения.</summary>
	// Token: 0x0200010A RID: 266
	public enum IsolationLevel
	{
		/// <summary>Используется уровень изоляции, отличный от указанного, однако этот уровень не может быть определен.</summary>
		// Token: 0x0400096D RID: 2413
		Unspecified = -1,
		/// <summary>Ожидающие изменения более изолированных транзакций не могут быть перезаписаны.</summary>
		// Token: 0x0400096E RID: 2414
		Chaos = 16,
		/// <summary>Чтение "грязных" данных возможно, что означает отсутствие совмещаемых и монопольных блокировок.</summary>
		// Token: 0x0400096F RID: 2415
		ReadUncommitted = 256,
		/// <summary>В процессе чтения данных совмещаемые блокировки сохраняются, чтобы избежать чтения "грязных" данных, однако данные могут быть изменены до окончания транзакции, что может стать причиной неповторяемого чтения или появления фиктивных данных.</summary>
		// Token: 0x04000970 RID: 2416
		ReadCommitted = 4096,
		/// <summary>Блокировки помещаются на все данные, используемые в запросе, что предотвращает обновление данных другими пользователями. Предотвращает неповторяемое чтение, однако появление фиктивных строк остается возможным.</summary>
		// Token: 0x04000971 RID: 2417
		RepeatableRead = 65536,
		/// <summary>Блокировка диапазона устанавливается для объекта <see cref="T:System.Data.DataSet" />, что предотвращает обновление или ставку строк другими пользователями в набор данных до завершения транзакции.</summary>
		// Token: 0x04000972 RID: 2418
		Serializable = 1048576,
		/// <summary>Уменьшает блокировку, сохраняя версию данных, которую приложение может считывать в то время, когда другое приложение изменяет те же самые данные. Указывает, что из одной транзакции пользователь не может просматривать изменения, сделанные в других транзакциях, даже если он запросит их повторно.</summary>
		// Token: 0x04000973 RID: 2419
		Snapshot = 16777216
	}
}
