using System;

namespace System.Security.Policy
{
	/// <summary>Определяет специальные флаги атрибутов в группах кода для политики безопасности.</summary>
	// Token: 0x020003FB RID: 1019
	[Flags]
	public enum PolicyStatementAttribute
	{
		/// <summary>Установлены все флаги атрибутов.</summary>
		// Token: 0x04001F4D RID: 8013
		All = 3,
		/// <summary>Исключающий флаг группы кода. Если в группе кода установлен этот флаг, то принадлежащему к группе коду предоставляются разрешения, связанные только с этой группой кода. Только для одной группы кода, соответствующей данной части кода, может быть установлен исключающий флаг.</summary>
		// Token: 0x04001F4E RID: 8014
		Exclusive = 1,
		/// <summary>Флаг, представляющий инструкцию политики, которая обеспечивает отсутствие оценки более низких уровней политики при выполнении операции разрешения, что позволяет уровню политики эффективно переопределять более низкие уровни.</summary>
		// Token: 0x04001F4F RID: 8015
		LevelFinal = 2,
		/// <summary>Флаги не установлены.</summary>
		// Token: 0x04001F50 RID: 8016
		Nothing = 0
	}
}
