using System;

namespace System.Threading
{
	/// <summary>Содержит явно заданный макет, видимый из неуправляемого кода и имеющий тот же макет, что и структура OVERLAPPED Win32, с дополнительными зарезервированными полями в конце.</summary>
	// Token: 0x020002A3 RID: 675
	public struct NativeOverlapped
	{
		/// <summary>Задает системно-зависимый статус. Зарезервировано для использования операционной системой.</summary>
		// Token: 0x04001A68 RID: 6760
		public IntPtr InternalLow;

		/// <summary>Задает длину полученных данных. Зарезервировано для использования операционной системой.</summary>
		// Token: 0x04001A69 RID: 6761
		public IntPtr InternalHigh;

		/// <summary>Задает позицию в файле, с которой начать передачу данных.</summary>
		// Token: 0x04001A6A RID: 6762
		public int OffsetLow;

		/// <summary>Задает старшее слово смещения в байтах, на котором следует начать передачу данных.</summary>
		// Token: 0x04001A6B RID: 6763
		public int OffsetHigh;

		/// <summary>Определяет обработчик события, которое задается сигнальным состоянием при завершении операции. Вызывающий процесс должен установить значение этого члена или нулем, или правильным обработчиком события до вызова наложенных функций.</summary>
		// Token: 0x04001A6C RID: 6764
		public IntPtr EventHandle;
	}
}
