using System;

namespace System.Drawing.Imaging
{
	/// <summary>Указывает формат данных о цвете для каждого пикселя изображения.</summary>
	// Token: 0x02000112 RID: 274
	public enum PixelFormat
	{
		/// <summary>Данные о пикселях содержат значения индексированных цветов, то есть значение является индексом цвета в системной таблице цветов, в отличие от отдельных значений цветов.</summary>
		// Token: 0x04000A20 RID: 2592
		Indexed = 65536,
		/// <summary>Данные о пикселях содержат цвета GDI.</summary>
		// Token: 0x04000A21 RID: 2593
		Gdi = 131072,
		/// <summary>Данные о пикселях содержат значения альфа, которые не умножаются в обратном порядке (начиная со старшего разряда).</summary>
		// Token: 0x04000A22 RID: 2594
		Alpha = 262144,
		/// <summary>Формат пикселей содержит значения альфа, умноженные в обратном порядке.</summary>
		// Token: 0x04000A23 RID: 2595
		PAlpha = 524288,
		/// <summary>Зарезервировано.</summary>
		// Token: 0x04000A24 RID: 2596
		Extended = 1048576,
		/// <summary>В формате пикселей по умолчанию на точку приходится 32 бита. Этот формат задает 24-битовую глубину цвета и 8-битовый альфа-канал.</summary>
		// Token: 0x04000A25 RID: 2597
		Canonical = 2097152,
		/// <summary>Формат пикселей не определен.</summary>
		// Token: 0x04000A26 RID: 2598
		Undefined = 0,
		/// <summary>Формат пикселей не указан.</summary>
		// Token: 0x04000A27 RID: 2599
		DontCare = 0,
		/// <summary>Указывает, что форматом отводится 1 бит на пиксель и используется индексированный цвет. Следовательно, таблица цветов содержит два цвета.</summary>
		// Token: 0x04000A28 RID: 2600
		Format1bppIndexed = 196865,
		/// <summary>Указывает, что форматом отводится 4 бита на пиксель и цвета индексированы.</summary>
		// Token: 0x04000A29 RID: 2601
		Format4bppIndexed = 197634,
		/// <summary>Указывает, что форматом отводится 8 бит на пиксель и цвета индексированы. Следовательно, таблица цветов содержит 256 цветов.</summary>
		// Token: 0x04000A2A RID: 2602
		Format8bppIndexed = 198659,
		/// <summary>Формат пикселей – 16 бит на точку. Данные цвета предусматривают 65 536 оттенков серого.</summary>
		// Token: 0x04000A2B RID: 2603
		Format16bppGrayScale = 1052676,
		/// <summary>Указывает, что форматом отводится 16 бит на пиксель: по 5 бит на красный, зеленый и синий каналы. Оставшийся бит не используется.</summary>
		// Token: 0x04000A2C RID: 2604
		Format16bppRgb555 = 135173,
		/// <summary>Указывает, что форматом отводится 16 бит на пиксель: по 5 бит на красный и синий канал, 6 бит на зеленый канал.</summary>
		// Token: 0x04000A2D RID: 2605
		Format16bppRgb565,
		/// <summary>Формат пикселей – 16 бит на точку. Информация о цвете определяет 32 768 оттенков цвета, где 5 бит отведены на красный канал, 5 бит на зеленый, 5 бит на синий и 1 бит на альфа-канал.</summary>
		// Token: 0x04000A2E RID: 2606
		Format16bppArgb1555 = 397319,
		/// <summary>Указывает, что форматом отводится 24 бита на пиксель: по 8 бит на красный, зеленый и синий каналы.</summary>
		// Token: 0x04000A2F RID: 2607
		Format24bppRgb = 137224,
		/// <summary>Указывает, что форматом отводится 32 бита на пиксель: по 8 бит на красный, зеленый и синий каналы. Оставшиеся 8 бит не используются.</summary>
		// Token: 0x04000A30 RID: 2608
		Format32bppRgb = 139273,
		/// <summary>Указывает, что форматом отводится 32 бита на пиксель: по 8 бит на красный, зеленый и синий каналы, а также альфа-канал.</summary>
		// Token: 0x04000A31 RID: 2609
		Format32bppArgb = 2498570,
		/// <summary>Указывает, что форматом отводится 32 бита на пиксель: по 8 бит на красный, зеленый и синий каналы, а также альфа-канал. Красный, зеленый и синий каналы умножаются в обратном порядке с учетом альфа-канала.</summary>
		// Token: 0x04000A32 RID: 2610
		Format32bppPArgb = 925707,
		/// <summary>Указывает, что форматом отводится 48 бит на пиксель: по 16 бит на красный, зеленый и синий каналы.</summary>
		// Token: 0x04000A33 RID: 2611
		Format48bppRgb = 1060876,
		/// <summary>Указывает, что форматом отводится 64 бита на пиксель: по 16 бит на красный, зеленый и синий каналы, а также альфа-канал.</summary>
		// Token: 0x04000A34 RID: 2612
		Format64bppArgb = 3424269,
		/// <summary>Указывает, что форматом отводится 64 бита на пиксель: по 16 бит на красный, зеленый и синий каналы, а также альфа-канал. Красный, зеленый и синий каналы умножаются в обратном порядке с учетом альфа-канала.</summary>
		// Token: 0x04000A35 RID: 2613
		Format64bppPArgb = 1851406,
		/// <summary>Максимальное значение данного перечисления.</summary>
		// Token: 0x04000A36 RID: 2614
		Max = 15
	}
}
