using System;

namespace System.Globalization
{
	/// <summary>Устанавливает различные правила для определения первой недели года.</summary>
	// Token: 0x02000953 RID: 2387
	public enum CalendarWeekRule
	{
		/// <summary>Указывает, что первая неделя года начинается в первый день года и заканчивается перед назначенным первым днем недели. Значение равно 0.</summary>
		// Token: 0x040033B0 RID: 13232
		FirstDay,
		/// <summary>Указывает, что первая неделя года начинается с назначенного первого дня недели, который встречается первым в году. Значение равно 1.</summary>
		// Token: 0x040033B1 RID: 13233
		FirstFullWeek,
		/// <summary>Указывает, что первой неделей года является первая неделя, состоящая из четырех или более дней, следующих перед назначенным первым днем недели. Значение равно 2.</summary>
		// Token: 0x040033B2 RID: 13234
		FirstFourDayWeek
	}
}
