using System;

namespace System.Globalization
{
	/// <summary>Определяет параметры сравнения строк для использования с классом <see cref="T:System.Globalization.CompareInfo" />.</summary>
	// Token: 0x02000956 RID: 2390
	[Flags]
	public enum CompareOptions
	{
		/// <summary>Указывает настройки параметров по умолчанию для сравнения строк.</summary>
		// Token: 0x040033C9 RID: 13257
		None = 0,
		/// <summary>Указывает, что сравнение строк не должно учитывать регистр.</summary>
		// Token: 0x040033CA RID: 13258
		IgnoreCase = 1,
		/// <summary>Указывает, что при сравнении строк необходимо игнорировать не занимающие место несамостоятельные знаки, например, диакритические. В стандарте Юникода комбинированные символы определяются как символы, объединяемые с базовыми символами для получения нового символа. Непробельные составные символы в своем представлении не требуют дополнительного пространства.</summary>
		// Token: 0x040033CB RID: 13259
		IgnoreNonSpace = 2,
		/// <summary>Указывает, что при сравнении строк необходимо игнорировать такие символы, как разделители, знаки препинания, знаки денежных единиц, знак процента, математические символы, амперсанд и т. д.</summary>
		// Token: 0x040033CC RID: 13260
		IgnoreSymbols = 4,
		/// <summary>Указывает, что при сравнении строк необходимо игнорировать тип "Кана". Типы японской азбуки Каны обозначают символы хираганы и катаканы, представляющие звуки японского языка. Хирагана используется для японских выражений и слов, а катакана — для слов, заимствованных из других языков, например "компьютер" и "Интернет". Для обозначения любого звука может быть использована как хирагана, так и катакана. Если выбрано это значение, знаки хирагана и катакана для одного и того же звука считаются равными.</summary>
		// Token: 0x040033CD RID: 13261
		IgnoreKanaType = 8,
		/// <summary>Указывает, что при сравнении строк необходимо игнорировать ширину символа. Например, символы японской катаканы могут быть написаны в полную ширину или в половину ширины. Если выбрано это значение, знаки катаканы, написанные в полную ширину, считаются равными тем же знакам, написанным в половину ширины.</summary>
		// Token: 0x040033CE RID: 13262
		IgnoreWidth = 16,
		/// <summary>При сравнении строк не должен учитываться регистр. После этого выполняется обычное сравнение. Этот способ аналогичен преобразованию строки в верхний регистр с помощью инвариантного языка и региональных параметров и выполнению порядкового сравнения результатов.</summary>
		// Token: 0x040033CF RID: 13263
		OrdinalIgnoreCase = 268435456,
		/// <summary>Указывает, что при сравнении строк следует использовать алгоритм сортировки строк. В строке сортировки дефис, апостроф, а также другие знаки, не являющиеся буквенно-цифровыми, предшествуют буквенно-цифровым знакам.</summary>
		// Token: 0x040033D0 RID: 13264
		StringSort = 536870912,
		/// <summary>Указывает, что при сравнении строк должны использоваться последовательные значения строки в кодировке Юникода UTF-16 (последовательное сравнение единиц кода). Это позволяет быстро выполнить сравнение, которое, однако, не учитывает особенностей, связанных с языком и региональными параметрами. Строка, начинающаяся с единицы кода XXXX16, отображается перед строкой, начинающейся с YYYY16, если XXXX16 меньше YYYY16. Это значение не может быть объединено с другими значениями <see cref="T:System.Globalization.CompareOptions" /> и должно использоваться обособленно.</summary>
		// Token: 0x040033D1 RID: 13265
		Ordinal = 1073741824
	}
}
