using System;

namespace System.Globalization
{
	/// <summary>Указывает отображение цифр, зависящее от языка и региональных параметров.</summary>
	// Token: 0x02000964 RID: 2404
	public enum DigitShapes
	{
		/// <summary>Фигуры цифр зависят от предыдущего текста в этом формате вывода. Европейские цифры используются в латинском письме, арабо-индийские — в арабском, а тайские — в тайском.</summary>
		// Token: 0x0400348B RID: 13451
		Context,
		/// <summary>Фигуры цифр не изменяются. Поддерживается полная совместимость с Юникодом.</summary>
		// Token: 0x0400348C RID: 13452
		None,
		/// <summary>Фигуры цифр являются собственными эквивалентами цифр от 0 до 9. Цифры ASCII от 0 до 9 заменяются эквивалентными собственными национальными цифрами.</summary>
		// Token: 0x0400348D RID: 13453
		NativeNational
	}
}
