using System;

namespace System.Globalization
{
	/// <summary>Определяет категорию Юникода для символа.</summary>
	// Token: 0x0200097C RID: 2428
	public enum UnicodeCategory
	{
		/// <summary>Прописная буква. Принятое обозначение в Юникоде — "Lu" (letter, uppercase). Значение равно 0.</summary>
		// Token: 0x04003531 RID: 13617
		UppercaseLetter,
		/// <summary>Строчная буква. Принятое обозначение в Юникоде — "Ll" (letter, lowercase). Значение равно 1.</summary>
		// Token: 0x04003532 RID: 13618
		LowercaseLetter,
		/// <summary>Буква регистра заголовка. Принятое обозначение в Юникоде — "Lt" (letter, titlecase). Значение равно 2.</summary>
		// Token: 0x04003533 RID: 13619
		TitlecaseLetter,
		/// <summary>Символ буквы модификатора, представляющий собой отдельно стоящий знак ненулевой ширины, указывающий на изменение предшествующей буквы. Принятое обозначение в Юникоде — "Lm" (letter, modifier). Значение равно 3.</summary>
		// Token: 0x04003534 RID: 13620
		ModifierLetter,
		/// <summary>Буква, не являющаяся прописной, строчной, буквой модификатора и не находящаяся в регистре заголовка. Принятое обозначение в Юникоде — "Lo" (letter, other). Значение равно 4.</summary>
		// Token: 0x04003535 RID: 13621
		OtherLetter,
		/// <summary>Непробельный символ, указывающий на изменения базового символа. Принятое обозначение в Юникоде — "Mn" (mark, nonspacing). Значение равно 5.</summary>
		// Token: 0x04003536 RID: 13622
		NonSpacingMark,
		/// <summary>Символ ненулевой ширины, который указывает на изменения базового символа и влияет на ширину его глифа. Принятое обозначение в Юникоде — "Mc" (mark, spacing combining). Значение равно 6.</summary>
		// Token: 0x04003537 RID: 13623
		SpacingCombiningMark,
		/// <summary>Вложенный символ — непробельный несамостоятельный знак, который окружает все предыдущие символы до базового символа включительно. Принятое обозначение в Юникоде — "Me" (mark, enclosing). Значение равно 7.</summary>
		// Token: 0x04003538 RID: 13624
		EnclosingMark,
		/// <summary>Знак десятичной цифры в диапазоне от 0 до 9. Принятое обозначение в Юникоде — "Nd" (number, decimal digit). Значение равно 8.</summary>
		// Token: 0x04003539 RID: 13625
		DecimalDigitNumber,
		/// <summary>Число, представленное буквой вместо десятичной цифры, например обозначение римской цифры пять — V. Принятое обозначение в Юникоде — "Nl" (number, letter). Значение равно 9.</summary>
		// Token: 0x0400353A RID: 13626
		LetterNumber,
		/// <summary>Число, не являющееся ни десятичной цифрой, ни буквенной цифрой, например дробь 1/2. Принятое в Юникоде обозначение индикатора — "No" (number, other). Значение равно 10.</summary>
		// Token: 0x0400353B RID: 13627
		OtherNumber,
		/// <summary>Символ пробела, не имеющий глифа, но не являющийся управляющим символом или символом форматирования. Принятое обозначение в Юникоде — "Zs" (separator, space). Значение равно 11.</summary>
		// Token: 0x0400353C RID: 13628
		SpaceSeparator,
		/// <summary>Символ, используемый для разделения строк текста. Принятое обозначение в Юникоде — "Zl" (separator, line). Значение равно 12.</summary>
		// Token: 0x0400353D RID: 13629
		LineSeparator,
		/// <summary>Символ, используемый для разделения абзацев. Принятое обозначение в Юникоде — "Zp" (separator, paragraph). Значение равно 13.</summary>
		// Token: 0x0400353E RID: 13630
		ParagraphSeparator,
		/// <summary>Управляющий символ кода со значением в Юникоде, равным U+007F либо находящемся в диапазоне от U+0000 до U+001F или от U+0080 до U+009F. Принятое обозначение в Юникоде — "Cc" (other, control). Значение равно 14.</summary>
		// Token: 0x0400353F RID: 13631
		Control,
		/// <summary>Символ форматирования, который влияет на расположение текста или на операции по обработке текста, но обычно не отображается. Принятое обозначение в Юникоде — "Cf" (other, format). Значение равно 15.</summary>
		// Token: 0x04003540 RID: 13632
		Format,
		/// <summary>Старший или младший символ-заместитель. Значения кодов символов-заместителей находятся в диапазоне от U+D800 до U+DFFF. Принятое обозначение в Юникоде — "Cs" (other, surrogate). Значение равно 16.</summary>
		// Token: 0x04003541 RID: 13633
		Surrogate,
		/// <summary>Символ для личного использования, значение которого в Юникоде находится в диапазоне от U+E000 до U+F8FF. Принятое обозначение в Юникоде — "Co" (other, private use). Значение равно 17.</summary>
		// Token: 0x04003542 RID: 13634
		PrivateUse,
		/// <summary>Знак препинания, являющийся соединителем двух символов. Принятое обозначение в Юникоде — "Pc" (punctuation, connector). Значение равно 18.</summary>
		// Token: 0x04003543 RID: 13635
		ConnectorPunctuation,
		/// <summary>Знак тире или дефиса. Принятое обозначение в Юникоде — "Pd" (punctuation, dash). Значение равно 19.</summary>
		// Token: 0x04003544 RID: 13636
		DashPunctuation,
		/// <summary>Открывающий символ для одного из парных знаков препинания, таких как круглые, квадратные и фигурные скобки. Принятое обозначение в Юникоде — "Ps" (punctuation, open). Значение равно 20.</summary>
		// Token: 0x04003545 RID: 13637
		OpenPunctuation,
		/// <summary>Закрывающий символ для одного из парных знаков препинания, таких как круглые, квадратные и фигурные скобки. Принятое обозначение в Юникоде — "Pe" (punctuation, close). Значение равно 21.</summary>
		// Token: 0x04003546 RID: 13638
		ClosePunctuation,
		/// <summary>Открывающий или начальный знак кавычки. Принятое обозначение в Юникоде — "Pi" (punctuation, initial quote). Значение равно 22.</summary>
		// Token: 0x04003547 RID: 13639
		InitialQuotePunctuation,
		/// <summary>Закрывающий или заключительный знак кавычки. Принятое обозначение в Юникоде — "Pf" (punctuation, final quote). Значение равно 23.</summary>
		// Token: 0x04003548 RID: 13640
		FinalQuotePunctuation,
		/// <summary>Знак препинания, который не является соединителем, тире, открывающим или закрывающим знаком препинания, начальной или заключительной кавычкой. Принятое обозначение в Юникоде — "Po" (punctuation, other). Значение равно 24.</summary>
		// Token: 0x04003549 RID: 13641
		OtherPunctuation,
		/// <summary>Математические символы, например "+" или "=". Принятое обозначение в Юникоде — "Sm" (symbol, math). Значение равно 25.</summary>
		// Token: 0x0400354A RID: 13642
		MathSymbol,
		/// <summary>Символ денежной единицы. Принятое обозначение в Юникоде — "Sc" (symbol, currency). Значение равно 26.</summary>
		// Token: 0x0400354B RID: 13643
		CurrencySymbol,
		/// <summary>Символ модификатора, который указывает на изменения окружающих его символов. Например, дробная черта указывает, что число слева является числителем, а число справа — знаменателем. Индикатор отмечается специальным знаком Юникода "Sk" (symbol, modifier). Значение равно 27.</summary>
		// Token: 0x0400354C RID: 13644
		ModifierSymbol,
		/// <summary>Символ, который не является математическим символом, символом денежной единицы или символом модификатора. Принятое обозначение в Юникоде — "So" (symbol, other). Значение равно 28.</summary>
		// Token: 0x0400354D RID: 13645
		OtherSymbol,
		/// <summary>Символ, не относящийся ни к одной из категорий Юникода. Принятое обозначение в Юникоде — "Cn" (other, not assigned). Значение равно 29.</summary>
		// Token: 0x0400354E RID: 13646
		OtherNotAssigned
	}
}
