using System;
using System.Runtime.InteropServices;

namespace System.Security.Cryptography
{
	/// <summary>Задает режим блочного шифра для использования при шифровании.</summary>
	// Token: 0x02000480 RID: 1152
	[ComVisible(true)]
	[Serializable]
	public enum CipherMode
	{
		/// <summary>Режим сцепления блоков шифра (<see langword="CBC" />) реализует обратную связь. Перед шифрованием каждого блока открытого текста он объединяется с зашифрованным текстом предыдущего блока с помощью побитовой операции "исключающего ИЛИ". При этом даже в случае, если открытый текст содержит большое количество идентичных блоков, при их шифровании будут получены различные блоки зашифрованного текста. Перед шифрованием первого блока открытого текста с ним с помощью побитовой операции "исключающего ИЛИ" объединяется вектор инициализации. При искажении отдельного бита блока зашифрованного текста будет искажен и соответствующий блок открытого текста. Кроме того, будет изменен и бит следующего блока, находящийся в том же месте, что и исходный измененный бит.</summary>
		// Token: 0x04002134 RID: 8500
		CBC = 1,
		/// <summary>В режиме электронной кодовой книги (<see langword="ECB" />) каждый блок зашифровывается отдельно. Любые блоки открытого текста, которые идентичны и содержатся в одном и том же сообщении или в разных сообщениях, зашифрованных одним и тем же ключом, преобразуются в идентичные текстовые блоки шифра. Важно.  Этот режим не рекомендуется, потому что при его использовании возникает возможность успешного применения различных эксплойтов. Если шифруемый открытый текст содержит значительное число повторов, нарушение шифрованного текста возможно в одном блоке, но не в нескольких блоках одновременно. Также возможно использовать анализ блоков, чтобы определить ключ шифрования. Кроме того, активный злоумышленник может незаметно подменять и переставлять местами отдельные блоки, что позволяет свободно сохранять и вставлять блоки в поток в других местах.</summary>
		// Token: 0x04002135 RID: 8501
		ECB,
		/// <summary>В режиме выходной обратной связи ( <see langword="OFB" /> ) вместо преобразования всего блока в шифрованный текст преобразуются небольшие фрагменты открытого текста. Этот режим похож на режим <see langword="CFB" />. Единственное отличие заключается в способе заполнения регистра сдвига. При искажении бита в зашифрованном тексте будет искажен и соответствующий бит открытого текста. Однако если имеются дополнительные биты из зашифрованного текста или их не хватает, открытый текст будет искажен, начиная с этого места.</summary>
		// Token: 0x04002136 RID: 8502
		OFB,
		/// <summary>Режим обратной связи по шифру ( <see langword="CFB" /> ) вместо преобразования всего блока преобразует в шифрованный текст небольшие фрагменты открытого текста. Этот режим использует регистр сдвига длиной в один блок, разделенный на секции. Например, при размере блока восемь байт и побайтовой обработке регистр сдвига разделяется на восемь секций. При искажении бита в зашифрованном тексте искажается бит открытого текста и разрушается регистр сдвига. Это приводит к искажению нескольких следующих фрагментов открытого текста до тех пор, пока поврежденный бит не выйдет за пределы регистра сдвига. Размер порции данных обратной связи по умолчанию может зависеть от алгоритма, но обычно равняется 8 битам или числу битов в блоке. Количество битов данных обратной связи можно изменять с помощью свойства <see cref="P:System.Security.Cryptography.SymmetricAlgorithm.FeedbackSize" />. Алгоритмы, поддерживающие CFB, используют это свойство для настройки обратной связи.</summary>
		// Token: 0x04002137 RID: 8503
		CFB,
		/// <summary>Режим захвата зашифрованного текста ( <see langword="CTS" /> ) обрабатывает открытый текст любой длины и создает зашифрованный текст, длина которого совпадает с длиной открытого текста. В этом режиме все блоки, кроме двух последних боков открытого текста, обрабатываются так же, как в режиме <see langword="CBC" />.</summary>
		// Token: 0x04002138 RID: 8504
		CTS
	}
}
