using System;

namespace System.Security.Cryptography
{
	/// <summary>Указывает, следует ли создать асимметричный ключ подписи или асимметричный ключ обмена.</summary>
	// Token: 0x02000468 RID: 1128
	public enum KeyNumber
	{
		/// <summary>Пара ключей обмена, которая используется для шифрования сеансовых ключей, что позволяет безопасно хранить эти ключи и обмениваться ими с другими пользователями.</summary>
		// Token: 0x040020CF RID: 8399
		Exchange = 1,
		/// <summary>Пара ключей подписи, которая используется для проверки подлинности сообщений или файлов с цифровой подписью.</summary>
		// Token: 0x040020D0 RID: 8400
		Signature
	}
}
