using System;
using System.Runtime.InteropServices;

namespace System.Security.Cryptography
{
	/// <summary>Задает тип заполнения, используемого, когда блок данных сообщения короче полного числа байтов, необходимого для криптографической операции.</summary>
	// Token: 0x02000481 RID: 1153
	[ComVisible(true)]
	[Serializable]
	public enum PaddingMode
	{
		/// <summary>Заполнение не выполнено.</summary>
		// Token: 0x0400213A RID: 8506
		None = 1,
		/// <summary>Строка заполнения по стандарту PKCS 7 состоит из последовательности байтов, в каждый из которых записывается общее число добавленных байтов заполнения.</summary>
		// Token: 0x0400213B RID: 8507
		PKCS7,
		/// <summary>Строка заполнения состоит из нулевых байтов.</summary>
		// Token: 0x0400213C RID: 8508
		Zeros,
		/// <summary>Строка заполнения по стандарту ANSIX923 состоит из последовательности байтов, каждый из которых заполняется нулями, кроме последнего — в него записывается число октетов заполнения.</summary>
		// Token: 0x0400213D RID: 8509
		ANSIX923,
		/// <summary>Строка заполнения по стандарту ISO10126 состоит из последовательности байтов, каждый из которых заполняется случайными данными, кроме последнего — в него записывается число октетов заполнения.</summary>
		// Token: 0x0400213E RID: 8510
		ISO10126
	}
}
