using System;

namespace System.ComponentModel
{
	/// <summary>Обеспечивает функциональные возможности предоставления сведений об настраиваемых ошибках, которые могут быть связаны с пользовательским интерфейсом.</summary>
	// Token: 0x020003B4 RID: 948
	public interface IDataErrorInfo
	{
		/// <summary>Возвращает сообщение об ошибке для свойства с заданным именем.</summary>
		/// <param name="columnName">Имя свойства, для которого возвращается сообщение об ошибке.</param>
		/// <returns>Сообщение об ошибке для свойства. Значение по умолчанию — пустая строка ("").</returns>
		// Token: 0x1700064D RID: 1613
		string this[string columnName]
		{
			get;
		}

		/// <summary>Возвращает сообщение об ошибке, показывающее причину отказа в данном объекте.</summary>
		/// <returns>Сообщение об ошибке, показывающее причину отказа в данном объекте. Значение по умолчанию — пустая строка ("").</returns>
		// Token: 0x1700064E RID: 1614
		// (get) Token: 0x06001F11 RID: 7953
		string Error { get; }
	}
}
