using System;

namespace System.ComponentModel
{
	/// <summary>Определяет идентификаторы, которые указывают неизменяемую область видимости вкладки в окне "Свойства".</summary>
	// Token: 0x020003A1 RID: 929
	public enum PropertyTabScope
	{
		/// <summary>Эта вкладка добавляется в окно "Свойства" и не может быть удалена.</summary>
		// Token: 0x04000F2A RID: 3882
		Static,
		/// <summary>Эта вкладка добавляется в окно "Свойства" и может быть только явно удалена родительским компонентом.</summary>
		// Token: 0x04000F2B RID: 3883
		Global,
		/// <summary>Эта вкладка зависит от текущего документа. Эта вкладка добавляется в окно "Свойства" и удаляется, когда выделенный в данный момент документ изменяется.</summary>
		// Token: 0x04000F2C RID: 3884
		Document,
		/// <summary>Эта вкладка зависит от текущего компонента. Эта вкладка добавляется в окно "Свойства" только для текущего компонента и удаляется, когда компонент перестает быть выделенным.</summary>
		// Token: 0x04000F2D RID: 3885
		Component
	}
}
