using System;

namespace System.Diagnostics
{
	/// <summary>Указывает тип события в записи журнала событий.</summary>
	// Token: 0x0200025D RID: 605
	public enum EventLogEntryType
	{
		/// <summary>Ошибка. Указывает на существенную проблему, о которой необходимо сообщить пользователю; как правило, это потеря данных или функциональных возможностей.</summary>
		// Token: 0x04000AC9 RID: 2761
		Error = 1,
		/// <summary>Предупреждение. Указывает на незначительную проблему, которая, однако, может свидетельствовать о наличии предпосылок для возникновения проблем в дальнейшем.</summary>
		// Token: 0x04000ACA RID: 2762
		Warning,
		/// <summary>Уведомление. Указывает на то, что важная операция успешно выполнена.</summary>
		// Token: 0x04000ACB RID: 2763
		Information = 4,
		/// <summary>Аудит успехов. Указывает на событие, происходящее в системе безопасности при успешной попытке контролируемого доступа, например при успешном входе в систему.</summary>
		// Token: 0x04000ACC RID: 2764
		SuccessAudit = 8,
		/// <summary>Аудит отказов. Указывает на событие, происходящее в системе безопасности при сбое контролируемого доступа, такое как сбой при открытии файла.</summary>
		// Token: 0x04000ACD RID: 2765
		FailureAudit = 16
	}
}
