using System;
using System.ComponentModel;

namespace System.Diagnostics
{
	/// <summary>Задает формулу для вычисления метода <see cref="M:System.Diagnostics.PerformanceCounter.NextValue" /> для экземпляра <see cref="T:System.Diagnostics.PerformanceCounter" />.</summary>
	// Token: 0x0200027B RID: 635
	[TypeConverter(typeof(AlphabeticalEnumConverter))]
	public enum PerformanceCounterType
	{
		/// <summary>Счетчик мгновенного значения, показывающий последнее наблюдавшееся значение в шестнадцатеричном формате. Используется, например, для хранения числа элементов или операций.</summary>
		// Token: 0x04000B34 RID: 2868
		NumberOfItemsHEX32,
		/// <summary>Счетчик мгновенного значения, показывающий последнее наблюдавшееся значение. Используется, например, для хранения очень большого числа элементов или операций. Такой же, что и тип <see langword="NumberOfItemsHEX32" />, за тем исключением, что используются большие поля для размещения больших значений.</summary>
		// Token: 0x04000B35 RID: 2869
		NumberOfItemsHEX64 = 256,
		/// <summary>Счетчик мгновенного значения, показывающий последнее наблюдавшееся значение. Используется, например, для хранения числа элементов или операций.</summary>
		// Token: 0x04000B36 RID: 2870
		NumberOfItems32 = 65536,
		/// <summary>Счетчик мгновенного значения, показывающий последнее наблюдавшееся значение. Используется, например, для хранения очень большого числа элементов или операций. Такой же, что и тип <see langword="NumberOfItems32" />, за тем исключением, что используются большие поля для размещения больших значений.</summary>
		// Token: 0x04000B37 RID: 2871
		NumberOfItems64 = 65792,
		/// <summary>Счетчик разницы, показывающий изменение в измеряемом атрибуте между двумя последними интервалами измерения.</summary>
		// Token: 0x04000B38 RID: 2872
		CounterDelta32 = 4195328,
		/// <summary>Счетчик разницы, показывающий изменение в измеряемом атрибуте между двумя последними интервалами измерения. Это то же самое, что и тип счетчика <see langword="CounterDelta32" />, за тем исключением, что используются большие поля для размещения больших значений.</summary>
		// Token: 0x04000B39 RID: 2873
		CounterDelta64 = 4195584,
		/// <summary>Счетчик среднего значения, который показывает среднее число операций, завершенных за одну секунду. Когда счетчик этого типа измеряет данные, каждое выборочное прерывание возвращает единицу или ноль. Данными счетчика является число измеренных единиц. Он измеряет время в тактах системного таймера производительности.</summary>
		// Token: 0x04000B3A RID: 2874
		SampleCounter = 4260864,
		/// <summary>Счетчик среднего значения предназначен для исследования средней длины очереди к ресурсу за все время наблюдения. Он показывает разницу между длинами очередей, наблюдаемых в течение двух последних интервалов измерения, деленную на продолжительность интервала. Этот тип счетчика обычно используется для хранения числа элементов, ожидающих очереди.</summary>
		// Token: 0x04000B3B RID: 2875
		CountPerTimeInterval32 = 4523008,
		/// <summary>Счетчик среднего значения, наблюдающий среднюю длину очереди к ресурсу за все время наблюдения. Счетчики этого типа отображают разницу между длинами очередей, наблюдаемых в течение двух последних интервалов измерения, деленную на продолжительность интервала. Этот тип счетчика такой же, что и <see langword="CountPerTimeInterval32" />, за тем исключением, что используются большие поля для размещения больших значений. Этот тип счетчика обычно используется для хранения очень большого числа элементов, ожидающих очереди.</summary>
		// Token: 0x04000B3C RID: 2876
		CountPerTimeInterval64 = 4523264,
		/// <summary>Счетчик разницы, показывающий среднее число операций, завершенных в течение каждой секунды интервала измерения. Счетчики этого типа измеряют время в тактах системных часов.</summary>
		// Token: 0x04000B3D RID: 2877
		RateOfCountsPerSecond32 = 272696320,
		/// <summary>Счетчик разницы, показывающий среднее число операций, завершенных в течение каждой секунды интервала измерения. Счетчики этого типа измеряют время в тактах системных часов. Этот тип счетчика такой же, что и тип <see langword="RateOfCountsPerSecond32" />, но использует большие поля для размещения больших значений для хранения очень большого числа элементов или операций в секунду, например частоты передачи байтов.</summary>
		// Token: 0x04000B3E RID: 2878
		RateOfCountsPerSecond64 = 272696576,
		/// <summary>Счетчик мгновенного значения в процентах, показывающий отношение подмножества к множеству в процентах. Например, он позволяет сравнить число байтов, используемых на диске, и общее число байтов на этом диске. Счетчики этого типа отображают только текущий процент, а не среднее значение за все время.</summary>
		// Token: 0x04000B3F RID: 2879
		RawFraction = 537003008,
		/// <summary>Счетчик процентов, показывающий среднее время как процент отношения времени активности компонента к полному времени измерения.</summary>
		// Token: 0x04000B40 RID: 2880
		CounterTimer = 541132032,
		/// <summary>Счетчик процентов, показывающий процент активного времени компонента за все прошедшее время интервала измерения. Вычисляет время в единицах времени, равных 100 нс. Счетчики этого типа предназначены для измерения активности компонента в течение какого-либо времени.</summary>
		// Token: 0x04000B41 RID: 2881
		Timer100Ns = 542180608,
		/// <summary>Счетчик процентов, показывающий среднее отношение обращений ко всем операциям за последние два интервала измерения.</summary>
		// Token: 0x04000B42 RID: 2882
		SampleFraction = 549585920,
		/// <summary>Счетчик процентов, который отображает средний процент наблюдавшегося активного времени за интервал измерения. Значение этих счетчиков вычисляется за счет измерения процента времени, в течение которого служба была неактивна, и затем вычитанием этого значения из 100%.</summary>
		// Token: 0x04000B43 RID: 2883
		CounterTimerInverse = 557909248,
		/// <summary>Счетчик процентов, который показывает средний процент наблюдавшегося активного времени за интервал измерения.</summary>
		// Token: 0x04000B44 RID: 2884
		Timer100NsInverse = 558957824,
		/// <summary>Счетчик процентов, отображающий процент отношения активности одного или более компонентов ко всему интервалу измерения. Поскольку числитель записывает время активности работающих компонентов одновременно, результат может превышать 100%.</summary>
		// Token: 0x04000B45 RID: 2885
		CounterMultiTimer = 574686464,
		/// <summary>Счетчик процентов, показывающий процент активного времени одного или более компонентов за весь интервал измерения. Вычисляет время в единицах времени, равных 100 нс.</summary>
		// Token: 0x04000B46 RID: 2886
		CounterMultiTimer100Ns = 575735040,
		/// <summary>Счетчик процентов, показывающий процент активного времени одного или более компонентов за весь интервал измерения. Он получает активное время путем измерения времени, в котором компоненты не были активны, и вычитая результат из 100 процентов, умноженных на число исследуемых объектов.</summary>
		// Token: 0x04000B47 RID: 2887
		CounterMultiTimerInverse = 591463680,
		/// <summary>Счетчик процентов, показывающий процент активного времени одного или более компонентов за весь интервал измерения. Счетчики этого типа вычисляют время в единицах времени, равных 100 нс. Они получают активное время путем измерения времени, в котором компоненты не были активны, и вычитая результат из 100 процентов, умноженных на число исследуемых объектов.</summary>
		// Token: 0x04000B48 RID: 2888
		CounterMultiTimer100NsInverse = 592512256,
		/// <summary>Счетчик среднего значения, измеряющий время, которое он в среднем займет для завершения процесса или операции. Счетчики этого типа отображают отношение всего прошедшего интервала измерения к числу процессов или операций, завершенных за это время. Этот тип счетчика измеряет время в тактах системных часов.</summary>
		// Token: 0x04000B49 RID: 2889
		AverageTimer32 = 805438464,
		/// <summary>Таймер разницы, который показывает полное время между началом работы компонента или процесса и вычислением значения.</summary>
		// Token: 0x04000B4A RID: 2890
		ElapsedTime = 807666944,
		/// <summary>Счетчик средних значений, показывающий, сколько элементов обработано в среднем за операцию. Счетчики этого типа отображают отношение обработанных элементов к числу завершенных операций. Отношение вычисляется соотношением числа обработанных элементов в течение последнего интервала времени к числу завершенных операций за этот же интервал.</summary>
		// Token: 0x04000B4B RID: 2891
		AverageCount64 = 1073874176,
		/// <summary>Базовый счетчик, который хранит число взятых выборочных прерываний и используется в качестве знаменателя дроби. Выборочная доля представляет собой число измерений, равных 1 (или <see langword="true" />), для выборочного прерывания. Следует проверить, что это значение больше нуля до использования его в качестве знаменателя при расчете значения <see langword="SampleFraction" />.</summary>
		// Token: 0x04000B4C RID: 2892
		SampleBase = 1073939457,
		/// <summary>Базовый счетчик, используемый в расчете времени или количества средних значений, например <see langword="AverageTimer32" /> и <see langword="AverageCount64" />. Хранит знаменатель для подсчета значения счетчика для представления времени, необходимого для совершения операции или количества за операцию.</summary>
		// Token: 0x04000B4D RID: 2893
		AverageBase,
		/// <summary>Базовый счетчик, который хранит знаменатель счетчика, представляющего обычную арифметическую дробь. Следует проверить, что это значение больше нуля до использования его в качестве знаменателя при расчете значения <see langword="RawFraction" />.</summary>
		// Token: 0x04000B4E RID: 2894
		RawBase,
		/// <summary>Базовый счетчик, показывающий число измеренных элементов. Используется как знаменатель в вычислениях для получения среднего значения среди измеренных элементов при измерении времени нескольких, но однотипных элементов. Используется со счетчиками <see langword="CounterMultiTimer" />, <see langword="CounterMultiTimerInverse" />, <see langword="CounterMultiTimer100Ns" /> и <see langword="CounterMultiTimer100NsInverse" />.</summary>
		// Token: 0x04000B4F RID: 2895
		CounterMultiBase = 1107494144
	}
}
