using System;

namespace System.Diagnostics
{
	/// <summary>Указывает приоритет, который система связывает с процессом. Это значение вместе со значением приоритета каждого потока процесса определяет базовый уровень приоритета каждого потока.</summary>
	// Token: 0x0200027D RID: 637
	public enum ProcessPriorityClass
	{
		/// <summary>Указывает, что значение приоритета процесса находится между <see langword="Normal" /> и <see cref="F:System.Diagnostics.ProcessPriorityClass.High" />.</summary>
		// Token: 0x04000B57 RID: 2903
		AboveNormal = 32768,
		/// <summary>Указывает, что значение приоритета процесса находится между <see langword="Idle" /> и <see langword="Normal" />.</summary>
		// Token: 0x04000B58 RID: 2904
		BelowNormal = 16384,
		/// <summary>Указывает, что процесс выполняет срочные задачи, которые должны быть выполнены немедленно, например диалоговое окно <see langword="Task List" />, которое должно быстро отвечать при вызове пользователя независимо от загрузки операционной системы. Потоки процесса выгружают потоки процессов с нормальными или низкими приоритетами.</summary>
		// Token: 0x04000B59 RID: 2905
		High = 128,
		/// <summary>Указывает, что потоки этого процесса выполняются, только когда система не занята. Примером может служить программа-заставка. Потоки данного процесса выгружаются потоками любых процессов с более высоким приоритетом.</summary>
		// Token: 0x04000B5A RID: 2906
		Idle = 64,
		/// <summary>Указывает, что у процесса нет особых запланированных потребностей.</summary>
		// Token: 0x04000B5B RID: 2907
		Normal = 32,
		/// <summary>Указывает, что процесс обладает максимально высоким приоритетом.</summary>
		// Token: 0x04000B5C RID: 2908
		RealTime = 256
	}
}
