using System;

namespace System.Diagnostics
{
	/// <summary>Указано, каким образом должно выглядеть новое окно при запуске процесса системой.</summary>
	// Token: 0x0200027F RID: 639
	public enum ProcessWindowStyle
	{
		/// <summary>Скрытый стиль окна. Окно может быть видимым или скрытым. Система отображает скрытое окно, не прорисовывая его. Если окно скрыто, оно эффективно отключено. Скрытое окно может обрабатывать сообщения от системы или от других окон, но не может обрабатывать ввод от пользователя или отображать вывод. Часто, приложение может держать новое окно скрытым, пока приложение определит внешний вид окна, а затем сделать стиль окна <see cref="F:System.Diagnostics.ProcessWindowStyle.Normal" />. Чтобы использовать значение <see cref="F:System.Diagnostics.ProcessWindowStyle.Hidden" />, свойство <see cref="P:System.Diagnostics.ProcessStartInfo.UseShellExecute" /> должно иметь значение <see langword="true" />.</summary>
		// Token: 0x04000B5E RID: 2910
		Hidden = 1,
		/// <summary>Полноэкранный стиль окна. По умолчанию система расширяет полноэкранное окно, и оно занимает весь экран или, если это дочернее окно, клиентскую область родительского окна. Если окно имеет строку заголовка, система автоматически переместит окно наверх экрана или вверху клиентской области родительского окна. Также система отключает границу установки размера окна и способность строки заголовка позиционировать окно, так что пользователь не может двигать окно перетаскиванием за строку заголовка.</summary>
		// Token: 0x04000B5F RID: 2911
		Maximized = 3,
		/// <summary>Минимизированный стиль окна. По умолчанию система уменьшает минимизированное окно до размеров кнопки панели задач и перемещает его на панель задач.</summary>
		// Token: 0x04000B60 RID: 2912
		Minimized = 2,
		/// <summary>Нормальный, видимый стиль окна. Система отображает окно на экране со стилем <see cref="F:System.Diagnostics.ProcessWindowStyle.Normal" /> в положении по умолчанию. Если окно видимое, пользователь может производить ввод в окно и видеть вывод окна. Часто приложение может инициализировать новое окно стилем <see cref="F:System.Diagnostics.ProcessWindowStyle.Hidden" />, пока приложение определит внешний вид окна, а затем сделать стиль окна <see cref="F:System.Diagnostics.ProcessWindowStyle.Normal" />.</summary>
		// Token: 0x04000B61 RID: 2913
		Normal = 0
	}
}
