using System;

namespace System.Diagnostics
{
	/// <summary>Задает текущее состояние выполнения потока.</summary>
	// Token: 0x02000282 RID: 642
	public enum ThreadState
	{
		/// <summary>Состояние, указывающее, что поток инициализирован, но еще не запущен.</summary>
		// Token: 0x04000B70 RID: 2928
		Initialized,
		/// <summary>Состояние, указывающее, что поток ожидает освобождения процессора. Поток готов к выполнению на следующем доступном процессоре.</summary>
		// Token: 0x04000B71 RID: 2929
		Ready,
		/// <summary>Состояние, указывающее, что поток в данный момент использует процессор.</summary>
		// Token: 0x04000B72 RID: 2930
		Running,
		/// <summary>Состояние, указывающее, что поток приступает к использованию процессора. В каждый момент времени в этом состоянии может быть только один поток.</summary>
		// Token: 0x04000B73 RID: 2931
		Standby,
		/// <summary>Состояние, указывающее, что выполнение потока завершено и он выполнил выход.</summary>
		// Token: 0x04000B74 RID: 2932
		Terminated,
		/// <summary>Состояние, указывающее, что поток ожидает ресурс (не процессор), необходимый для его выполнения. Например, он может ожидать считывания с диска стека его выполнения.</summary>
		// Token: 0x04000B75 RID: 2933
		Transition = 6,
		/// <summary>Состояние потока неизвестно.</summary>
		// Token: 0x04000B76 RID: 2934
		Unknown,
		/// <summary>Состояние, указывающее, что поток не готов использовать процессор, поскольку ожидает завершения внешней операции или освобождения ресурса. Когда поток становится готовым, его выполнение планируется повторно.</summary>
		// Token: 0x04000B77 RID: 2935
		Wait = 5
	}
}
